༄༅། ། མུ་ར་དགོན་པའི་ལོ་རྒྱུས་འབྲིང་པོ་ལྷ་དབང་གཙུག་གི་ནོར་བུ་ཞེས་བྱ་བ་བཞུགས། །
木拉寺简史
帝释天王顶宝

























རྡོ་རྗེ་གདན་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ།
★菩提迦耶本师释迦牟尼佛






























བསམ་ཡས་གུ་རུ་ང་འདྲ་མ།
桑耶寺莲师如我像


མུ་ར་དགོན་པའི་རྒྱང་བཏབ་འདྲ་པར།
	★木拉寺远景图


















མུ་ར་དགོན་རྨ་ཡུལ་བསམ་གཏན་ཆོས་གླིང་།
★木拉寺玛隅禅定法轮洲全景图介绍


 









མུ་རའི་འགྲོ་བ་ཀུན་གྲོལ་སྒར།
★木拉解脱遍诸众生营


















མུ་ར་ཚང་།
★木拉村
	













དགོན་པའི་ཚོགས་ཆེན་འདུ་ཁང་།
★木拉寺大经堂
 
 
༄༅། ། མུ་ར་དགོན་པའི་ལོ་རྒྱུས་འབྲིང་པོ་ལྷ་དབང་གཙུག་གི་ནོར་བུ་ཞེས་བྱ་བ་བཞུགས། །
ན་མོ་གུ་ར་ཝེ། ཚོགས་གཉིས་འོ་མའི་རྒྱ་མཚོ་བསྲུབས་པ་ལས། །སྐུ་གསུང་ཐུགས་ཡོན་ཡོངས་རྫོགས་འོད་དཀར་ཅན། །གཉིས་འཛིན་ཚ་གདུང་སེལ་བའི་དཔལ་ཤར་བ། །ཤེས་བྱ་ཀུན་མཁྱེན་ཤཱཀྱ་སེངྒེར་འདུད། །བསྟན་གཉིས་ཕན་བདེའི་འོད་སྟོང་འགྱེད་པ་ལ། །སྨོན་ལམ་ལོག་པའི་དུག་གི་ཁ་རླངས་ཅན། །མཐུ་སྟོབས་འཁོར་ལོ་འབར་བས་གཅོད་མཛད་པ། །རྒྱལ་བ་གཉིས་པ་པདྨ་ཀཱ་ར་མཆོད། །དུས་གསུམ་སངས་རྒྱས་ཀུན་གྱི་འཕྲིན་ལས་གར། །ཡིད་འཕྲོག་སྒེག་མོའི་སྐུར་ཤར་སྒྲོལ་མ་ཡུམ། །རྒྱལ་བའི་བཀའ་སྡོད་དཔལ་མགོན་ལྕམ་དྲལ་དང་། །རྩ་གསུམ་བསྟན་སྲུང་རྒྱ་མཚོས་དགེ་ལེགས་སྩོལ། །ལུང་རྟོགས་བསྟན་པའི་འོད་སྣང་འབུམ་འབྱེད་པའི། །ལྷ་དབང་གཙུག་ན་བརྗིད་པའི་ནོར་བུའི་མཆོག །བསམ་གཏན་ཆོས་ཀྱི་འཁོར་ལོས་བསྒྱུར་བའི་གཏམ། །ལྷོ་གླིང་འཛིན་མའི་འགྲོ་ལ་སྐྱེས་སུ་འབུལ། །ཞེས་མཆོད་པར་བརྗོད་པ་སྔོན་དུ་འགྲོ་བས་མུ་ར་དགོན་གྱི་ལོ་རྒྱུས་མདོ་ཙམ་གླེང་བར་བྱ་སྟེ།
1. དགོན་པའི་མིང་། ད་ལྟ་ཡོངས་གྲགས་ལ་མུ་ར་དགོན། མཚན་ཚང་བར་རྨ་ཡུལ་བསམ་གཏན་ཆོས་འཁོར་གླིང་། མུ་ར་ནི་མུ་རུ་ཧན་སྟེ་སོག་སྐད་དུ་རྟ་སྟེང་རྒྱལ་པོ་ཞེས་གྲགས་པ་མུ་རའི་རིགས་རྒྱུད་ཀྱི་མཆེད་ཁུངས་བསྟན་པ་དང་། རྨ་ཡུལ་ནི་རྨ་ཆུའི་ཆུ་འགྲམ་དུ་ཆགས་པ་དང་། བསམ་གཏན་ཆོས་འཁོར་གླིང་ནི། སྤོང་བ་བསམ་གཏན་གཙོ་བོར་བྱེད་པའི་ལུང་རྟོགས་དམ་པའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་ཡུལ་ཡིན་པས་སོ། །སྔར་དགོན་པའི་མཚན་ལ་སྒོ་མདོའི་སྒོམ་གྲྭ། མུ་རའི་ནག་སྒར་དང༌། ནོར་བསྟན་ཆོས་སྒར། ཆོས་ལུང་སྒར་བ། མཆོད་རྟེན་ཐང་ནག་སྒར། འདུག་དགེའི་རི་ཁྲོད་དགོན། ཤར་ཐུབ་བསྟན་འཕེལ་རྒྱས་གླིང༌། མུ་རའི་བླ་མ་དགོན་སོགས་དགོན་པའི་མཚན་དང་གནས་ལ་འགྱུར་བ་ཅི་རིགས་པ་བྱུང་བའོ། །
2. དགོན་སྡེ་དབུ་བརྙེས་པའི་དུས་ནི། ཕྱི་ལོ་(1477)་མེ་བྱ་ལོར་སྟེ། སྤྱིར་འབྲོག་དགོན་སྦྲ་ནག་ཅན་ཡིན་པས་གནས་གཅིག་ནས་གཅིག་ཏུ་འཕོ་འགྱུར་མང་པོ་བྱུང་ཡང་། རྨ་རྒྱུད་དུ་སྒོམ་ཁང་གི་ཚུལ་དུ་བྱུང་ཞིང་བརྒྱུད་འཛིན་མཁས་གྲུབ་གཅིག་ནས་གཅིག་ཏུ་བར་མ་ཆད་པར་བྱུང་བའི་གཞི་འཛིན་ས་དེ་ཁོ་ན་ཉིད་དོ། །གདུང་རབས་ཆོས་བརྒྱུད་ཀྱི་དབང་དུ་བྱས་ན་མུ་ར་སྣ་ནག་གི་མ་ཡུམ་བེ་རུ་སྲས་མོ་བྱ་བ་ནི་གྲུབ་པའི་དབང་ཕྱུག་ཆེན་པོ་ལབ་སྟོན་ནམ་མཁའ་རིན་ཆེན་གྱི་གདུང་བརྒྱུད་ཡིན། དེ་ཁམས་ཀྱི་བསྭ་ཐོག་རྒྱལ་བའི་དབེན་གནས་ཀྱི་བདག་པོ་ཡིན་པས་དེ་ནས་བཟུང་བརྩི་སྲོལ་ཡང་ཡོད་དོ། ། 
3. ས་གནས། སྔོན་གྱི་ལོ་རྒྱུས་ལྟར་རྨ་ཡུལ་ཐང་བརྒྱད་ཅེས་གྲགས་པ་སྟེ། མངའ་བདག་ཉང་གི་གཡུལ་མདོས་ལས། ཡུལ་ནི་རྨ་ཡུལ་ཐང་བརྒྱད་ན། །རྨ་རྗེ་ཕོ་འབྲང་ལྕམ་གཅིག་མ། །གདུང་རུས་གཉན་ཏེ་རྨ་བཟའ་མོ། །བྱང་གི་སྨན་ཏིང་ཏིང་མོ་བཙུན། །ཞེས་དང་། ས་སྐྱ་ངག་དབང་ཀུན་དགའ་བློ་གྲོས་ཀྱིས་མཛད་པའི་བརྟན་མའི་མཆོད་ཐབས་ལས། །མདོ་ཁམས་རྨ་ཆེན་སྤོམ་རའི་རྩེ་ཞིག་ན། །རྨ་རི་རབ་འབྱམས་རྡོ་རྗེ་དྲག་མོ་རྒྱལ། །ཞེས་བོད་ཁམས་སྐྱོང་བའི་བརྟན་མ་བཅུ་གཉིས་ཀྱི་ནང་ཚན་རྨ་རི་རབ་འབྱམས་རྡོ་རྗེ་དྲག་མོ་རྒྱལ་ལམ་རྒྱོག་གི་རི་རྒྱལ་ཕྱུག་མོའི་མདུན་ཞོལ། རྨ་ཆུའི་བཞུར་ཕྱོགས་ཀྱིས་ཕྱེས་ན་མགོ་ལོག་ཁ་གསུམ་གྱི་མར་མཐའ། ཕྱི་འབྲོག་གླིང་གསུམ་གྱི་ཡར་མཐའ། ད་ལྟ་ཀན་སུའུ་ཁུལ་རྨ་ཆུ་རྫོང་མུར་བྱེ་ཡུལ་ཚོའི་མུ་ར་རུ་ཆེན་གྱི་ནང་། དཀར་པོའི་ལུང་ཆེན་དང་གྲོགས་འཛོམས་(རྒྱོག་རྫོང་)ལུང་ཆེན་གྱི་བར་དུ། དཀར་འཕྲང་དང་རྒྱོག་འཕྲང་གཉིས་ཀྱི་བར་དུ་འཕྲང་བར་གོང་ཞོལ་གཉིས་ཡོད་པའི་ཞོལ་མ། ལུང་ཆུང་ཆོས་ལུང་དང་སྒར་ལུང་གཉིས་ཀྱི་བར་ཏུ། དགོན་སྡེ་བྱིན་འཐིབས་སེ་ཆགས་ཡོད་དོ། །
4. ཆོས་རྒྱུན། དཔལ་རྒྱལ་བ་ཤཱཀྱ་ཐུབ་པའི་བསྟན་པ་ལ་མདོ་སྔགས་ཀྱི་བཀའ་སྲོལ་འཛིན་པ་ཇི་སྙེད་བྱུང་བ་ལས་སྣང་སྲིད་ཟིལ་གནོན་པདྨ་རྒྱལ་པོའི་རང་ལུགས་གཙོ་བོར་བྱས་པའི་གྲུབ་མཐའ་རིས་མེད་བྱེད་པའི་ཆོས་སྡེ་ཞིག་ཡིན་ནོ། །དཔལ་རྒྱལ་བ་ཀཿཐོག་པའི་ལབ་སྟོན་ནམ་མཁའ་རིན་ཆེན་ནས་བྱུང་བའི་གདུང་བརྒྱུད་ཀྱི་བཀའ་སྲོལ་དང་། གཞི་ཆེན་སྐྱབས་མགོན་བསོད་ནམས་དཔལ་ལྡན་ནས་བྱུང་བའི་མངའ་བདག་ཉང་ཉི་མ་འོད་ཟེར་ཀྱི་བཀའ་སྲོལ། འདུག་དགེ་རི་ཁྲོད་པ་བློ་བཟང་རབ་རྒྱས་ནས་བརྒྱུད་པའི་དབེན་ས་སྙན་བརྒྱུད་ཀྱི་བཀའ་སྲོལ་ཏེ། བརྒྱུད་པའི་བཀའ་སྲོལ་ཆེན་པོ་གསུམ་དང་། སྔ་འགྱུར་ནང་ཚན། བྱང་གཏེར་རྡོ་རྗེ་བྲག བདུད་འདུལ་དང་ཀློང་གསལ། ཀློང་ཆེན་སྙིང་ཐིག ཁམས་གཙང་གཏེར་སྟོན་གྱི་ཆོས་རྒྱུན་བཅས་ནི་དགོན་པ་འདི་ཉིད་ཀྱི་བརྒྱུད་པ་གཙོ་བོར་འཛིན་པ་ཡིན་ནོ། །
5. དགོན་སྡེ།  གཙུག་ལག་ཁང་གི་སྐོར་ལ། སྔར་དགོན་པའི་ཚོགས་ཆེན་འདུ་ཁང་། ཐུགས་ཆེན་ལྷ་ཁང་། མགོན་ཁང་། ཇ་ཁང་། སྒར་བ་ཁག་སོ་སོའི་མཆོད་ཁང་། གྲྭ་ཤག་བརྒྱད་ཅུ། གྲྭ་བ་བརྒྱ་དང་བདུན་ཅུ་བཞུགས། དགོན་པའི་སྐོར་མཐའ་རུ་དུང་འཁོར་ལྔ་བཅུ་ང་གསུམ་འཁོར་ཆུང་སྟོང་གཉིས་ལྔ་བརྒྱ་ལྷག་ཡོད། སྡེ་ཚན་གྱི་དབང་དུ་བྱས་ན། ཚོགས་ཆེན། བཤད་གྲྭ། སྒྲུབ་གྲྭ། སྨན་གྲྭ། སྔགས་སྡེ་བཅས་སྡེ་ཚན་ལྔ་ཡོད། སྤྱི་ལ་གཟིགས་སྐྱོང་གནང་མཁན་དགོན་བདག་བླ་སྤྲུལ་རྣམས་དང་། ཡུལ་སྡེའི་ཚོ་དཔོན་ཁག་ཡིན། ཚོགས་ཆེན་ནས་འཛིན་སྐྱོང་དང་། སྔར་སྲོལ་དུས་མཆོད་མཛད་སྒོ། ཉིན་རེའི་ཆོས་བྱ། ཞབས་རིམ། དཔལ་འབྱོར་སོགས་ཀྱི་ལས་འགན་ཁུར་ཡོད། བཤད་གྲྭ་བས་བརྡ་དག་ནས་གཞུང་ཆེན་བཀའ་པོད་ལྔ་གསང་ཆེན་སྔགས་ཀྱི་རྒྱུད་སྡེའི་བར་སློབ་སྦྱོང་གནང་གི་ཡོད། སྒྲུབ་གྲྭ་ནས་ཀློང་ཆེན་སྙིང་ཐིག་གི་སྔོན་འགྲོ་འབུམ་ལྔ་ནས་བཟུང་ཐུགས་ཆེན་སྡུག་བསྔལ་རང་གྲོལ་བསྙེན་པ་ཚད་ལྡན་གཏོང་དགོས། མུ་རའི་མ་ཎི་དང་། འདུག་དགེའི་སྨྱུང་གནས་ཞེས་གྲགས་ཆེ་བའི་སྒྲུབ་པ་དེ་མ་ཆད་པར་རྒྱུན་སྐྱོང་བ་ཡིན། སྨན་གྲྭ་ནས་སྨན་རྩིས་ཕྱོགས་ལ་སློབ་སྦྱོང་བྱས་ཏེ་སྤྱི་ཚོགས་ལ་ཕན་བདེ་སྒྲུབ་གནང་གི་ཡོད། སྔགས་སྡེ་ནས་དགེ་བསྙེན་ཕོ་མོས་སྔོན་འགྲོ་གཏོང་བ། མ་ཎིའི་བསྒྲུབ་པ་དང་། ཏཱ་རེའི་བསྒྲུབ་པ། བདེ་ཆེན་ཞིང་བསྒྲུབ་སོགས་ཀྱིས་འབྲེལ་ཚད་དགེ་ལ་སྦྱོར་བའི་མཛད་པ་སྐྱོང་གི་ཡོད། །
6. ནང་རྟེན་གཙོ་བོ་ལ། རྟེན་གཙོ་ཟངས་གསེར་ལས་གྲུབ་པའི་ཐུགས་རྗེ་ཆེན་པོ་ཕྱག་སྟོང་སྤྱན་སྟོང་མཐོ་ཚད་རྨིད་དྲུག་ཅན། གུ་རུ་ཞི་དྲག་གི་སྐུ་གཉིས་མཐོ་ཚད་རྨིད་ལྔ་རེ་ཅན། སངས་རྒྱས་སྟོང་སྐུ། སྒྲོལ་མ་སྟོང་སྐུ་གཉིས། ཡར་ལུང་ཤེལ་བྲག་གཏེར་བྱོན་གུ་རུ་ཟ་ཧོར་མ། ཐུགས་ཆེན་འཁོར་བ་དོང་སྤྲུགས། བསམ་ཡས་རྡོ་རྭ་མངའ་བདག་ཉང་གི་གཏེར་བྱོན། ཀུན་མཁྱེན་འཇིགས་མེད་དབང་པོས་གནངས་བའི་ཐུབ་པ་རྡོར་གདན་དང་དབོན་སྤྲུལ་རྡོ་རྗེ་འཆང་སོགས་ལ་རྒྱ་གར་ནག་བལ་བོད་སོགས་ནས་ཕྱག་ཏུ་ཐོབ་པའི་རྟེན་རྙིང་ལི་མ་དང་གཏེར་མ་མང་པོ་དང་སྲུང་མའི་ཕྱར་དར་གཉན་པོ་གཙོ་བོར་བྱས་པའི་ཤིན་ཏུ་མང་པོ་བཞུགས་སོ། །
7. ཐུགས་དམ་གཙོ་བོ། ཐུགས་རྗེ་ཆེན་པོ། སྒྲུབ་པ་བཀའ་བརྒྱད། སྒྲོལ་མ། སྲུང་མ་མགོན་པོ་ཚོགས་བདག་ཡབ་ཡུམ།  ཙིའུ་དམར་པོ། ཞིང་སྐྱོང་སེང་གདོང་། བརྟན་མ་རྡོ་རྗེ་དྲག་རྒྱལ་མའོ། ། འདུལ་བ་གཞི་གསུམ་གྱི་ཕྱག་བཞེས་དགོན་སྡེ་སྤྱི་ལྟར་ཆད་མེད་རྒྱུན་ཆགས་སུ་གནས་པ་དང་། གྲྭ་བ་ཚོགས་སུ་ཞུགས་ནས་བཀའ་བརྒྱད་ལུས་དཀྱིལ་མི་ཆད་པ་མངའ་བདག་ཉང་ཉི་མ་འོད་ཟེར་ནས་བརྒྱུད་པའི་རྒྱལ་བ་གཞི་ཆེན་པའི་བཀའ་སྲོལ་དང་། ཕུར་བ་དང་སྲུང་མའི་གསོལ་མཆོད་ཆག་མེད་བྱེད་པ་མུ་རའི་སེར་སྡེའི་ལུགས་བཟང་རྒྱུན་ཆགས་སུ་གནས་པ་དང་། ལོ་རེར་སྨྱུང་གནས་མཆོག་བརྒྱད་མི་ཆག་པ་འདུག་དགེ་རི་ཁྲོད་པའི་ཕྱག་བཞེས་འཁྲུལ་མེད་ཡིན་ནོ། ། ཐུགས་རྗེ་ཆེན་པོའི་སྒྲུབ་པ་བྱུང་ཚུལ་ནི། མུ་ར་སྣ་ནག་རྨ་བརྒྱུད་དུ་བྱུང་བ་ནས་བཟུང་མ་ཎི་སྒྲུབ་པ་དང་། ཕུར་བའི་སྒྲུབ་པ། དཔལ་མགོན་ཚོགས་ཀྱི་བདག་པོའི་སྒྲུབ་པ་གསུམ་པོ་ཆད་མ་མྱོང་ཞིང་། དེ་དག་ཀུན་གྱི་ནང་ནས་མུ་རའི་མ་ཎིའི་སྒྲུབ་པ་ཞེས་གྲགས་ཆེ་བ་བྱུང་། རབ་བྱུང་བཅུ་གསུམ་པའི་ཕྱི་ལོ་(1789)་ས་བྱ་ལོ་ནས་བྱང་གཏེར་ཐུགས་རྗེ་ཆེན་པོ་འགྲོ་བ་ཀུན་གྲོལ་གྱི་སྒྲུབ་པ་ཚུགས།
8. སྒྲིག་ཁྲིམས། དགོན་པ་འདི་འདུལ་བ་གྲྭ་ཚང་ཡིན། མི་ཆོག་པ་གསུམ། བུད་མེད་ཞག་སྡོད་མི་ཆོག དུ་ཆང་ནང་འདྲེན་མི་ཆོག ཚོགས་ལ་དམར་ཟས་མི་ཆོག དགོས་པ་གསུམ། ཐོས་བསམ་སྒོམ་གསུམ་བྱེད་དགོས། སྒྲིག་ལམ་བརྩི་སྲུང་བྱེད་དགོས། སྤྱི་དོན་གཙོ་བོར་འཛིན་དགོས།
9. ཆོས་སྤྱོད། ལོ་གསར་ཚེས་གཏོར་ཞིང་སྐྱོང་གསོལ་མཆོད་ཀཿཐོག་གཞི་ཆེན་ལུགས།
10. དབོ་ཟླའི་ཚེས་༡་ནས་༡༣་བར་ཚེས་བཅུ་ཆེན་མོ་ཀཿཐོག་རྒྱལ་དབང་གཞི་ཆེན་ལུགས། ས་ཟླའི་སྨྱུང་གནས་དགེ་ལུགས། ཟླ་དྲུག་པའི་སིདྡྷིའི་བུམ་སྒྲུབ་ཆེན་མོ་ཁམས་གཏེར་ལུགས། དབྱར་གནས་རྫོགས་ཆེན་ལུགས། དབྱར་ནང་གི་ཐུགས་ཆེན་སྡུག་བསྔལ་རང་གྲོལ་བདུན་སྒྲུབ་གྲུབ་ཆེན་ལུགས། ཟླ་བརྒྱད་པའི་ཐུགས་ཆེན་འགྲོ་བ་ཀུན་གྲོལ་བདུན་སྒྲུབ་བྱང་གཏེར་ལུགས། ཟླ་བཅུ་བའི་ཕུར་བ་བདུན་སྒྲུབ་ཀཿཐོག་ལུགས། རྟ་ཟླའི་ལྔ་མཆོད་ཆེན་མོ་དགེ་ལུགས། དགུ་གཏོར་ཉིན་གསུམ་ཕུར་བ། སེང་གདོང་མ། རྟ་མགྲིན་གང་རུང་ཀཿཐོག་ལུགས། སྤྱི་སྲུང་ལ། བསམ་ལྷུན། སྒྲོལ་མ། མགོན་པོ་ཚོགས་བདག  གསོལ་མཆོད་རྒྱས་པར་བྱ་སྲོལ་ཡོད་དོ། །
11. ལོ་རྒྱུས། ས་ཕྱོགས་འདིར་གཉུག་མར་གནས་པའི་མི་ལ་མུ་ར་ཞེས་གྲགས་པ་ཡིན། མུ་རའི་མི་རབས་གོང་མ་སོག་རྒྱལ་ཆོག་ཐུ་ཧན་གྱི་ཡབ་མྱེས་ཀྱི་གཉེན་མུར་ཀུན་དགའ་དཔལ་བཟང་ཀཿཐོག་ནས་གསང་སྔགས་རྙིང་མ་དང་། ཕྱི་ལོ་(1477)་མེ་བྱ་ལོར་ཆོས་རྗེ་རྒྱལ་བ་བཟང་ལས་དཔལ་དུས་ཀྱི་འཁོར་ལོའི་སྦྱོར་དྲུག་སྦྱངས་ཏེ་སྒྲུབ་ཁང་བཙུགས་པ་ནི་མུ་རའི་སེར་སྡེ་དབུ་བརྙེས་པ་ཡིན། དེའི་གཉེན་ཚན་མུ་ར་དགེ་རྒན་གོང་མ་ཀུན་དགའ་ཕུན་ཚོགས་རིག་འཛིན་བདུད་འདུལ་རྡོ་རྗེའི་(1615-1672)སློབ་མར་གྱུར། བདུད་འདུལ་རྨ་ཆེན་གསོལ་ཁ་ཞུ་བ་པོ་ཡང་ཡིན། ལྕགས་འབྲུག་ལོ་(1640)་མུ་རའི་མྱེས་པོ་དགྲ་ལས་རྣམ་རྒྱལ་མུ་ར་སྣ་ནག་གམ་ནོ་ནོ་ཞུ་བ་རྨ་རྒྱུད་དུ་གནས་སྤོས་ཏེ་སླེབས་ནས་གཞིས་ཆགས་ཏེ་སྐྱ་སེར་སྡེ་གཉིས་རིམ་བཞིན་ཡར་རྒྱས་སོང་བ་ཡིན་ནོ། །དེ་རྗེས་མུ་རུའི་སྔགས་པ་ཁེན་འབུམ་དབོན་བརྒྱུད་རྣམས་དང་། མུ་ར་དགེ་རྒན་ཕྱི་མ།  མུ་ར་ཆོས་མཛད། མུ་ར་བླ་མ། མུ་ར་ནོར་བསྟན་སོགས་ཀྱིས་བསྟན་པ་ལོ་ཉིས་བརྒྱར་ཉེ་བར་བསྐྱངས༌སོ། །  ནམ་ཞིག་ཐུགས་བསྐྱེད་དུས་སུ་སྨིན་པས་གསེར་རྟའི་ཡུལ་གྱི་མངའ་བདག་ཉང་གི་གདུང་རྒྱུད་གླིང་བཞག་ཨོ་རྒྱན་ལྷུན་གྲུབ་དང་ཆོས་འབྲེལ་བྱུང་ཞིང་། ཁོང་གི་བླ་མ་ཀཿཐོག་རྒྱལ་སྲས་བསོས་ནམས་ལྡེའུ་བཙན། (1679-1723)་བར་བྱུང་། ལོ་ཚིག་དེའི་སྟེང་ནས་བརྩིས་པས་གླིང་བཞག་ཨོ་རྒྱན་ལྷུན་གྲུབ་ཀྱི་གསུང་ཞི་ཁྲོའི་སྲི་འདུལ་ལས། །ལྕགས་སྟག་ལོར་(1770)དབྱར་ཟླ་ར་བའི་ཚེས་ལ་བླ་མ་རྒན་པོ་ཨོ་རྒྱན་ལྷུན་གྲུབ་པའི་རང་ལོ་དོན་བདུན་པའི་སྟེང་མཁར་ཆེན་གསང་སྔགས་གླིང་གི་སྒྲུབ་ཁང་དུ་བསྙེན་སྒྲུབ་ཀྱི་ཐུན་སྐབས་སུ་སྦྱར། །ཅེས་པའི་བརྩི་གཞི་བྱས་པས་འཁྲུངས་ལོ་(1693)-ཆུ་བྱ་ལོ་འམ་(1694)་ཤིང་ཁྱི་ལོ་གང་རུང་ཡིན་དགོས། གཤེགས་ལོ་ལྕགས་རྟ་ལོ་ཡིན་འདུག་སྟེ། རྣམ་ཐར་ཏུ། །རྟ་ལོ་རྟ་ཟླའི་ཚེས་བཅུའི་ཉི་ཤར་དུ། །སློབ་དཔོན་པདྨ་ཀ་ཐོག་དྲུང་པ་དང་། །དབྱེར་མེད་དཔལ་ཆེན་དཀྱིལ་འཁོར་དབྱིངས་ལ་ཐིམ། །ཞེས་འཁོད་ཡོད་དོ། །གླིང་བཞག་ཨོ་རྒྱན་ལྷུན་གྲུབ་སྐུ་ཕྲེང་གཉིས་པ་གཞི་ཆེན་༧སྐྱབས་མགོན་བསོད་ནམས་དཔལ་ལྡན་ལ་ཀཿཐོག་གི་བླ་མ་རྨོག་སྤྲུལ་ཆོས་དབྱིངས་རྡོ་རྗེས་བསང་ཡིག་(མདོ་སྨད་ཤར་ཕྱོགས་མ) བསྩལ་ཞིང་ཁྱེད་ཤར་ཕྱོགས་སུ་སོང་ལ་རྒྱོག་གི་བ་ཡན་རི་རྒྱལ་ཕྱུག་མོར་གྲོགས་འཛོམས་རི་ཕྱོར་ལབ་རྩེ་ཞོག ཐུགས་རྗེ་ཆེན་པོ་འགྲོ་བ་ཀུན་གྲོལ་གྱི་སྒྲུབ་མཆོད་ཅིག་འཛུགས་ཐུབ་ན་འབྲེལ་ཚད་དོན་ལྡན་དུ་འགྱུར་བ་དང་ཆོས་བརྒྱུད་འབྱུང་ངེས་ཡིན་ཞེས་ལུང་བསྟན། ཀཿཐོག་རྡོ་རྗེ་གདན་གྱི་བཀའ་ཤོག་ཐེལ་དམར་ཅན་སྤྲད། མུ་རའི་བླ་མ་སྟོབས་ཆེན་གྱིས་༧སྐྱབས་མགོན་བསོད་ནམས་དཔལ་ལྡན་སྐུ་གཞོན་གདན་དྲངས། ། རབ་བྱུང་བཅུ་གསུམ་པའི་ཕྱི་ལོ་(1789)་ས་བྱ་ལོར་ལབ་རྩེ་བསྟད། མུ་ར་སྒོ་མདོའི་བཀའ་བརྒྱད་མཆོད་རྟེན་ཆེན་མོ་བཞེངས། སྔར་ཡོད་ནག་སྒར་རྒྱ་ཆེ་རུ་བཏང་སྟེ་ཐུགས་རྗེ་ཆེན་པོ་འགྲོ་བ་ཀུན་གྲོལ་གྱི་སྒྲུབ་མཆོད་ཉིན་དགུ་ལ་ཚོགས་བའི་སྲོལ་བཙུགས། བླ་མ་གཞི་ཆེན་པའི་བླ་རབས་རྣམས་ལ་ཆོས་དང་དམ་ཚིག་གི་འབྲེལ་བ་ཤིན་ཏུ་ཟབ་པར་གྱུར་པ་ཡིན་ནོ། །ཕྱི་ལོ་(1784)་ཡས་མས་སུ་མུ་ར་བན་རྒན་བསྟན་རྒྱས་ཨ་མདོ་ཀུན་མཁྱེན་འཇམ་དབྱངས་བཞད་པ་སྐུ་ཕྲེང་གཉིས་པ་འཇིགས་མེད་དབང་པོའི་མགྲོན་གཉེར་ཆེན་མོ་བྱས། མུ་ར་བླ་བྲང་བཀྲ་ཤིས་འཁྱིལ་གྱི་སྨོན་ལམ་ཤོག་ཁའི་གྲས་སུ་བཞག ཐུབ་སྐུ་རྡོར་གདན་དང་བཀའ་ཤོག་གནང༌། དུས་བཟང་ཆོ་འཕྲུལ་ཆེན་མོའི་ཚེས་༡༥་མུ་ར་ལ་གནང་། དཔལ་ལྡན་བཀྲ་ཤིས་འཁྱིལ་བ་དང་འབྲེལ་བ་ཐུན་མོང་མ་ཡིན་པ་བྱུང་།
ཕྱི་ལོ་(1818)་ས་སྟག་ལོར་གཞི་ཆེན་བཻ་རོ་མཁས་གྲུབ་གསང་སྔགས་བསྟན་འཛིན་བྱོན་ནས་སྒར་ལུང་མདོའི་བྱང་ཆུབ་མཆོད་རྟེན་བཞེངས་ཤིང་སིདྡྷིའི་བུམ་སྒྲུབ་བཙུག མུ་ར་བླ་མ་བསོད་ནམས་ཆོས་འཕེལ་སོགས་ཀྱིས་བསྟན་པ་བསྐྱངས། རབ་བྱུང་བཅོ་ལྔ་བའི་ཤིང་བྱ་(1884)་ལོར་མུ་ར་འཇམ་བསྟན་གྱིས་དབེན་ས་སྙན་རྒྱུད་ཀྱི་མངའ་བདག་༧སྐྱབས་མཆོག་འདུག་དགེ་རིན་པོ་ཆེ་སྐུ་ཕྲེང་དང་པོ་གདན་འདྲེན་བྱས་ཤིང་རི་ཁྲོད་བཏབ། མུ་ར་ལ་ཆོས་རྒྱུན་ཁ་ཤས་ཡོད་པ་གཅིག་ཏུ་བསྡུས་ཏེ་མུ་ར་སྤྱིའི་དགོན་པར་གྱུར། ཕྱོགས་ནས་ཡོང་བའི་བླ་སྤྲུལ་དགེ་འདུན་ཤིན་ཏུ་མང་བས་མུ་རའི་བླ་མ་དགོན་ཞེས་པའི་མིང་ཐོགས། མུ་རའི་བྱང་སེམས་བརྒྱད་དང༌། གྲུབ་ཆེན་ཀུར་ནག་གཉིས་ཞེས་གྲགས་པས་བསྟན་པ་བསྐྱངས་སོ། ། ལྕགས་སྤྲེལ་ལོ་(1980)་ལོར་ནས་རྒྱལ་ཁབ་དང་རྫོང་གིས་རྒྱབ་སྐྱོར་འོག་ཆོས་སྒོ་གསར་ཏུ་ཕྱེ་བའི་བརྡ་ཁྱབ་ཐོན་པ་དང་མུ་རའི་སེར་སྡེ་ཚན་པ་གསུམ་དུ་བསྒྲིལ་ཏེ་རང་རང་ས་ནས་སྤྲེལ་ལོའི་ཚེས་བཅུའི་ཚོགས་མཆོད་བཏོན། ། ལྕགས་བྱ་(1981)་ལོར་བསྟན་པ་ཡང་དར་རྟེན་འབྲེལ་རི་ཁྲོད་དུ་ཚེས་བཅུ་རྒྱས་པ་འཚོགས། མཆོད་རྟེན་སྐྱར་གསོ་གྲུབ། ཆུ་ཕག་(1983)་ལོར་ཁམས་གཙང་གཏེར་ཆེན་དང་ཁྲི་གུང་ཐང་བསྟན་པའི་དབང་ཕྱུག་མཆོག་གི་གསུང་བཀོད་ལྟར་དགོན་པ་ད་ལྟའི་གནས་ཆོས་ལུང་དུ་སྤོས། མུ་ར་བླ་མ་བསོད་ནམས་དབང་རྒྱལ། མུ་ར་ཚ་སྤྲུལ་དགེ་ལེགས། སྤྲུལ་སྐུ་མཆོག སྤྲུལ་ཐུབ་སྙན་སོགས་བླ་གྲྭ་འདུས་བཞུགས་ཡོངས་ཀྱིས་དགོན་པ་སྐྱར་གསོ་བྱས་པ་ད་ལྟའི་འདིའོ། ། 
12. མུ་རའི་བླ་རབས་རིམ་བྱོན། །སྔར་མུ་ར་ཚང་གི་གདུང་རབས་ནི་རིམ་གཉིས་ཀྱི་རྣལ་འབྱོར་སྔགས་པ་ཤ་སྟག་བྱོན་ཞིང་། དེ་དག་གིས་སེར་སྡེ་དང་ཡུལ་སྡེ་གཉིས་ཀྱི་བསྟན་འགྲོའི་དོན་ཆེན་ཕྱག་མཚན་དུ་བཞེས་ཚུལ་མདོ་ཙམ་གསལ་བར་བརྗོད་ན། མུ་ར་ཀུན་དགའ་དཔལ་བཟང་། མུ་ར་ཀུན་དགའ་ཕུན་ཚོགས། མུ་ར་སྣ་ནག་རྡོ་རྗེ་གྲགས་ལྡན། མུ་ར་ཀླུ་རྒྱལ་འབུམ། མུ་ར་སྔགས་པ་ཁེན་ཐར་འབུམ། མུ་ར་ཐེར་འབུམ། མུ་ར་བླ་མ་སྟོབས་ཆེན། མུ་ར་བན་རྒན་བསྟན་རྒྱས། མུ་ར་དགེ་རྒན་ཨོ་རྒྱན་ནོར་བུ། མུ་ར་བླ་མ་ཨོ་རྒྱན་མཐུ་སྟོབས། མུ་ར་སྔགས་རྒན་བསོ་ཆོས། མུ་ར་བླ་མ་ཨུར་ཆོས།  མུ་ར་ཚ་སྤྲུལ། མུ་ར་སྤྲུལ་སྐུ་མཆོག མུ་ར་ཨོ་རྒྱན་གསུང་རབ་བཟང་པོ། མུ་ར་བསྟན་འཛིན་ཉི་མའི་བར་རིན་པོ་ཆེའི་ཕྲེང་བ་ལྟ་བུ་མང་དུ་བྱོན་པ་ལས། འདིར་གལ་ཆེ་བ་འགའ་ཞིག་རགས་རིམ་ཙམ་བརྗོད་པའོ། ། 
13. གཞི་ཆེན་༧སྐྱབས་མགོན་དབོན་སྤྲུལ་སྐུ་ཕྲེང་བཞི་པ་སྐྱབས་མགོན་དབོན་སྤྲུལ་ཐུབ་བསྟན་ལུང་རྟོགས་རྒྱ་མཚོ་ནི། ཡབ་དམུ་རིགས་མུ་རུ་ཝང་གི་གདུང་རྒྱུད་སྡེ་གཙོ་མུ་ར་གར་མགོན་དང་། མ་ཡུམ་གྱི་ཡབ་བྱ་ཁྱུང་དཔོན་དང་མ་བརྒྱུད་ཁྲོ་ཁོ་དཔལ་ཤུལ་དཔོན་བརྒྱུད་ཡིན་པ། མཚན་ལ་མཁའ་འགྲོ་མཚོ་ཞེས་གྲགས།  བོད་ཆུ་ཕོ་ཁྱི་ལོ་(1922)་ལོར་མུ་རའི་རི་ཁྲོད་དུ་འཁྲུངས། འདུག་དགེ་རི་ཁྲོད་པའི་དྲུང་དུ་གཙུག་ཕུད་ཕུལ་ཞིང་ནབ་བཟའ་གསོལ། གསར་རྙིང་རིས་མེད་ཀྱི་བླ་སྤྲུལ་མང་པོའི་ལུང་བསྟན་རྩེ་མཐུན་དང་ཁྱད་པར་རྫོགས་སྤྲུལ་ལྔ་བའི་ལུང་བསྟན་དུ། རྨ་ཡུལ་ནོར་འཛིན་ཨིནྡྲ་ནི་ལའི་གཞིར། །ཕ་ནི་རྟ་མགྲིན་སྤྲུལ་བ་གར་གྱི་མིང༌། །མ་ནི་ཕག་མོའི་སྤྲུལ་བ་མཚོ་ཡི་མིང༌། །ཐང་སྟོང་རྒྱལ་པོའི་རྣམ་སྤྲུལ་ཁྱི་ལོ་བ། །ཞེས་དང་། འཇམ་དབྱངས་མཁྱེན་བརྩེ་ཆོས་ཀྱི་བློ་གྲོས་ཀྱིས། རྨ་ཀླུང་དལ་གྱིས་འབབས་པའི་འགྲམ། །ཤར་ཕྱོགས་མི་ཚང་རྒྱས་པའི་ནང༌། །ཕ་ནི་མགོན་ལ་མ་ནི་མཚོ། །རིགས་བཟང་ཁྱེའུ་ཁྱི་ལོར་འཁྲུངས། །བུདྱ་དྷ་ར་བྱང་ཆུབ་སེམས། །མདོ་སྔགས་ཆོས་ཀྱི་བསྟན་སྲོག་འཛིན། །འབྲེལ་ཚད་རྣམ་གྲོལ་ས་ལ་འགོད། །ཅེས་པའི་ལུང་བསྟན་རྣམ་གཉིས་ནང་ཡབ་ཡུམ་གྱི་མཚན་དང༌། འཁྲུངས་ཡུལ། ལོ་རྟགས། བུདྱ་དྷ་ར་ཞེས་པས་ཆུང་དུས་མཚན་ལ་རིག་འཛིན་དགའ་རབ་རྡོ་རྗེའམ་གཅེས་མིང་དུ་རིག་པོ་ཞུ་བའི་མཚན་སྒྲ་བཅས་གསལ་བོ་བསྟན་པ་ལྟར་ཆུང་ངུའི་དུས་ནས་གཞི་ཆེན་དགོན་དུ་གདན་འདྲེན་ཞུས། གཞི་ཆེན་རྒྱལ་སྲས་ཉི་ཟླ་བཟང་པོ་དང་བཻ་རོ་མ་འདས་སྤྲུལ་སྐུ་བློ་བཟང་དྲི་མེད་བསྟན་འཛིན་རྣམ་གཉིས་ནས་ཁྲུས་གསོལ་དང་ན་བཟའ་བརྗེས། ཨོ་རྒྱན་དྲི་མེད་མདོ་སྔགས་ཆོས་ཀྱི་རྒྱལ་མཚན་དཔལ་བཟང་པོ་ཞེས་པའི་མཚན་གྱི་ཅོད་པཎ་ཕུལ་ཏེ་ཁྲི་འདོན་གཟབ་རྒྱས་བྱས། ཀཿཐོག་གཞི་ཆེན་གྱི་མ་དགོན་གསུམ་དང་བུ་དགོན་ཉེར་གཅིག་གི་བསྟན་པའི་རྒྱལ་མཚན་ཕྱག་ཏུ་གཏད། ཨ་ཁུ་རྒྱ་རོང་པ་སྐལ་བཟང་རྒྱ་མཚོ་ཞེས་དབོན་སྤྲུལ་སྐུ་གོང་མའི་ཞལ་སློབ། བླ་མའི་མཚན་ཁོ་ན་ལོ་གསུམ་དུ་བགྲང་པས་དོན་བརྒྱུད་ཀྱི་རྟོགས་པ་འཕོས་ཤིང་དགོངས་པའི་ཀློང་མཛོད་རྡོལ་བ་དེ་ཉིད་ཡོངས་འཛིན་དུ་བསྐོས། སྔ་འགྱུར་བཀའ་གཏེར་ཐུན་མོང་གི་ཕྱག་བཞེས་དང༌། ཐུན་མོང་མ་ཡིན་པ་སྐུ་ཕྲེང་དང་པོ་གཞི་ཆེན་སྐྱབས་མགོན་གྱི་དག་སྣང་མར་གྲགས་པའི་ཀཿཐོག་ལུགས་སྲོལ་གཞན་ལས་འཕགས་ཆོས་དུ་མ་དང་ལྡན་པ་སོགས་མཐོང་བ་བརྒྱུད་པའི་ཕྱག་བཞེས་བཞིན་སྦྱོང་ཚེ་བརྡ་ཙམ་བསྟན་པས་ཐུགས་སུ་ཆུད་དོ། གཞི་ཆེན་ཀུན་བཟང་ཉི་མ་དང་དབོན་པོ་གང་ཤར་རང་གྲོལ། རྒྱལ་སྲས་ཉི་ཟླ། གཞི་ཆེན་མ་འདས། མཁན་ཆེན་ངག་གི་དབང་པོ། དབང་མདའི་གྱང་སྤྲུལ་སོགས་བླ་མར་བསྟེན། སྔ་རྗེས་དུ་མར་སྐྱབས་མགོན་ཆེན་པོ། བདུད་འཇོམས་སྤྲུལ་སྐུ། དིལ་མགོ་མཁྱེན་བརྩེ་སོགས་བླ་མར་བསྟེན། ཤུགས་ཆུང་སྤྲུལ་སྐུ་ཚུལ་ཁྲིམས་བཟང་པོ་ཐུན་མིན་གྱི་བླ་མར་བཀུར།  དབུས་སུ་ཕེབས་ཤིང་དཔལ་ལྡན་འབྲས་དཀར་སྤུང་བའི་ཆོས་སྡེར་བཞུགས། གཞུང་བཀའ་པོད་ལྔ་ལ་གསན་སྦྱང་མཛད། དཔལ་ལྡན་འབྲས་དཀར་སྤུངས་པའི་ཆོས་སྡེའི་ཚོགས་ཆེན་སྤྲུལ་སྐུའི་གོ་གནས་དང༌། སྒོ་མང་གྲྭ་ཚང་སྤྲུལ་སྐུའི་མཚན་ཐོབ་ཀྱང་བཟུང༌སྟེ་དགེ་བཤེས་ལྷ་རམས་པའི་མཚན་རྟགས་བཞེས། ཕ་ཡུལ་དུ་ལན་གཉིས་ཕེབས་པའི་ཐ་མ་བཞུགས་གཏན་ཁེལ། གཞི་ཆེན་འབུམ་བརྩིགས་དགོན་གསར་བཞེངས་མཛད། གཞི་ཆེན་དགོན་མ་ལག་བཅས་པར་ཆོས་དང་ཟང་ཟིང་གིས་བརྩེ་སྐྱོང་གནང་། དགུང་གྲངས་དོན་དྲུག་བཞེས་པ་(1997)་ལོ་མེ་མོ་གླང་གི་ལོའི་བོད་ལུགས་གླང་ཟླའི་དམར་ཕྱོགས་བཟང་པོ་གཉིས་པའི་ཚེས་ལ་རྒྱལ་བ་མྱ་ངན་ལས་འདས་པའི་བཞུགས་སྟངས་ཁྱད་པར་བ་སེངྒེ་ཉལ་སྟབས་མཛད་དེ་ཧིག་གི་སྒྲ་བཅས་གཟུགས་སྐུ་རག་པའི་བཀོད་པ་ཉེ་བར་བསྡུས་ཤིང་ཐུགས་འོད་གསལ་ཆོས་ཀྱི་དབྱིངས་སུ་བསྡུ་བའི་ཚུལ་བསྟན་ཏོ། །གདུང་བཞུ་བའི་དུས་སུ་མཁའ་དབྱིངས་ནས་རོལ་མོའི་སྒྲ་སྙན་ཞིང་འཇེབས་པ་ཉིན་དུ་མར་གྲགས་པ་དང་འོད་ཟེར་དར་ཐག་ལྟ་བུ་ཕྱོགས་དུ་མར་འཕྲོས་པ་ཡུན་རིང་པོར་བསྡད་ཏེ་གདུང་ལས་རིང་བསྲེལ་དང་སྐུ་བརྙན་སོགས་བྱུང་བ་སོགས་ངོ་མཚར་བའི་མཛད་པ་དད་ལྡན་རྣམས་ཀྱི་མིག་ཡིད་ཚིམ་པའི་བདུད་རྩིར་གྱུར།  
སློབ་མ། ༧རྒྱལ་དབང་འབྲུག་ཆེན་སྐུ་ཕྲེང་བཅུ་གཉིས་པ་མཆོག་དང་གཞི་ཆེན་དགོན་པའི་བླ་སྤྲུལ་སྐྱ་སེར་ཡོངས་རྫོགས། འབྲུག་ཐུབ་བསྟན་ཆོས་གླིང་གི་མཁན་ཆེན། གཞི་ཆེན་དགོན་སྡེ་ཁག་གི་བླ་སྤྲུལ། གཞན་ཡང་ས་དགེ་བཀའ་རྙིང་གི་མཁན་སྤྲུལ་དགེ་བའི་བཤེས་གཉེན་གསེར་གྱི་ཕྲེང་བ་ལྟ་བུ་གྲངས་མེད་པ་འཛམ་གླིང་གི་ཕྱོགས་སོ་སོར་ཡོད་དོ། །
གསུང་རྩོམ། གསང་བ་འདུས་པའི་དཀའ་གནས་དོགས་གཅོད་མཇུག་མ་གྲུབ་པ་ཞིག་དང༌། མི་ཕམ་རིན་པོ་ཆེའི་དམ་ཆོས་དོགས་སེལ་སྐོར་ལ་ཞིབ་ཕྲའི་རིགས་པས་བཤད་སྲོལ་ཟེར་བ་ལྡེབས་ཉི་ཤུ་ཙམ་ཞིག གསང་བ་སྙིང་པོའི་མཆན་འགྲེལ་ཐུན་མོང་མ་ཡིན་པ་ཞིག ཡོན་ཏན་མཛོད་མཆན། རྫོགས་ཆེན་ལྟ་བ་དམར་འབྱིན་གྱི་ཞལ་རྒྱུན་ཟེར་བ་ཞིག ཡིག་བསྐུར་ཁ་ཤས། མུ་ར་དགོན་སྡེའི་སྒྲིགས་བཤད་མདོར་བསྡུས། ཟིན་བྲིས་སྣ་ཚོགས་བཞུགས་སོ། ། 
14. ༧སྐྱབས་མཆོག་འདུག་དགེ་རི་ཁྲོད་པ་རིམ་བྱོན། མུ་ར་སེར་སྡེ་བླ་སྤྲུལ་རྣམས་ནི་ཐོབ་ཐང་ཆེ་ཆུང་མིན་པར། སྐུ་བགྲེས་གཞོན་དང་། བསླབ་པའི་རྒན་རིམ། རྡོ་རྗེ་སློབ་དཔོན་ཆེན་མོའི་བསྟན་པའི་ཁུར་ཆེན་སུ་ལ་བབ་པ་དེ་གཙོ་བོར་བྱེད་དེ། མངའ་རིས་པཎ་ཆེན་པདྨ་དབང་རྒྱལ་གྱིས། དོན་བརྒྱུད་ཡེ་ཤེས་ལྡན་པ་གཙོ་བོར་འཛིན། །ཞེས་མདོ་རྒྱུད་ཀྱི་བཀའ་སྲོལ་དང་མཐུན་པར་གོང་དུ་བཀུར་བའི་ལུགས་བཟང་བཞུགས་སོ། །མུ་རའི་སེར་སྡེ་དང་རི་ཁྲོད་གཅིག་ཏུ་སྒྲིལ་ནས་བཟུང་སྟེ། དགོན་པ་དང་རི་ཁྲོད་ཀུན་གྱི་བསྟན་པའི་རྒྱལ་མཚན་འཛིན་པ་པོ་འདུག་དགེ་སྤྲུལ་སྐུ་རིམ་བྱོན་དུ་གྱུར་པ་ཡིན།
སྐུ་ཕྲེང་དང་པོ། ༧སྐྱབས་མཆོག་འདུག་དགེ་རིན་པོ་ཆེ་བློ་བཟང་རབ་རྒྱས་ནི། རབ་བྱུང་བཅུ་བཞི་བའི་སྨད་སྤྱི་ལོ་(1853)་ལོར་ཡབ་འདུག་དམར་འོད་རྒྱམ་དང་། ཡུམ་མ་བཟའ་ཨུ་དྷི་གཉིས་ཀྱི་སྲས་སུ་བྱེ་གཤོང་འདུག་ཚང་དུ་སྐུ་བལྟམས། གྲུབ་ཆེན་བྱམས་པ་ཆོས་འཛིན་སོགས་ཀྱི་རྡོ་རྗེའི་ལུང་གིས་འཇིག་རྟེན་གསུམ་གྱི་མགོན་པོ་འཕགས་མཆོག་ཕྱག་ན་པདྨོའི་སྒྱུ་འཕྲུལ་རོལ་བའི་གར་གྱིས་གདུལ་བྱ་བསྟན་འགྲོའི་གསོས་སུ་ཐུགས་བསྐྱེད་རྣམ་པར་དཀར་བའི་སྟོབས་ལས་འཁྲུངས་པ་སྐྱབས་མཆོག་མི་ཡི་སེང་གེ་བློ་བཟང་རབ་རྒྱས་ཞེས་མཚན་སྙན་གྱི་ང་རོ་དབྱར་རྔའི་སྒྲ་བཞིན་ཕྱོགས་བཅུར་ཁྱབ་པས་སྐྱེས་མཆོག་དམ་པ་དེ་ཉིད་ཀྱི་རྣམ་པར་ཐར་པ་ནི་རྒྱ་མཚོ་ལྟར་བསམ་བརྗོད་ལས་འདས། དད་པའི་གསོས་སུ་ཟུར་ཙམ་བརྗོད་ན། དགུང་གྲངས་བཅོ་བརྒྱད་སྟེང་རིག་སད་ནས་སྲིད་པ་འཁོར་བའི་ཆོས་མཐའ་དག་ལ་སྙིང་པོ་སྤུ་ཙམ་མེད་པ་དང་། མི་རྟག་པ་ཁོ་ནར་གཟིགས་ཏེ་འཁོར་བའི་བྱ་བ་སྤང་ཞིང་ཁྱིམ་ནས་བྱུང་སྟེ་རྔ་སྨད་ཧེ་རི་ཁྲོད་པའི་མདུན་དུ་བྱོན། དབང་ཁྲིད་མན་ངག་གི་རིམ་པ་གསན་སྦྱངས་མཛད་དེ་ཟབ་དོན་གཅོད་ཀྱི་གདམས་པ་ཉམས་སུ་བླང་ནས་གནས་ངེས་མེད་དུ་ཆུ་མིག་སྟོང་ཁར་བྱོན། དགུང་གྲངས་ཉེར་གཅིག་ཐོག་ཀིརྟི་བློ་བཟང་འཕྲིན་ལས་ཀྱི་མདུན་ནས་བསྙེན་རྫོགས་ཀྱི་སྡོམ་པ་བཞེས་ནས་ཐུགས་རྒྱུད་དྲན་ཤེས་བག་ཡོད་ཀྱིས་བསྡམས་ནས་ཉེས་ལྟུང་གི་དྲི་མས་མ་གོས་པའི་བཙུན་པའི་མཆོག་ཏུ་གྱུར། དུས་རྟག་པར་ངེས་འབྱུང་དང་སྐྱོ་ཤེས་མི་རྟག་པས་ཐུགས་རྒྱུད་བསྐུལ་ནས་འདི་སྣང་ལ་ཞེན་པ་སྤངས་ཤིང་། བྱང་ཆུབ་སེམས་ཀྱིས་ཐུགས་རྒྱུད་ལེགས་པར་གཏམས་ནས་གདུལ་བྱ་མཆོག་དམན་ཀུན་ལ་མས་བུ་གཅིག་ལ་བརྩེ་བ་ལྟར་བྱམས་པ་དང་སྙིང་རྗེ་ཆེན་པོའི་ཆོས་སྦྱིན་གྱི་ལས་ལ་ཤིན་ཏུ་མཉེས་པ། འཇིག་རྟེན་ཆོས་བརྒྱད་ཀྱི་འཁྲི་བ་ལས་དབེན་ཞིང་བདུད་བཞིའི་སྙེམས་ཐག་ཆོད་དེ་ཡུམ་དོན་སྤྲོས་བྲལ་གྱི་དགོངས་པ་ཀློང་དུ་གྱུར་ནས་གདོད་མའི་རྒྱལ་ཐབས་བརྙེས། ལམ་ལྷག་པའི་བསླབ་པ་གསུམ་དང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་བསྡུ་བའི་དངོས་པོ་བཞི་སོགས་རྒྱལ་སྲས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྒྱ་མཚོ་ལྟ་བུ་ལ་ཉིན་མཚན་ཀུན་ཏུ་བརྩོན་ཞིང་གུས་རྟག་གི་བརྩོན་འགྲུས་ཆེན་པོས་སྐུ་ཚེ་གང་ལ་སྐུ་ཆིངས་ཙམ་ཡང་མི་བཀྲོལ་ཞིང་། ཉིན་མོ་གཡེངས་བ་མེད་པར་ཆོས་སྤྱོད་ཁོ་ནས་དུས་འདའ་ཞིང་མཚན་ཡང་ནམ་གྱི་གསུམ་ཆ་ཙམ་ལས་མི་གཟིམ་པར་དགེ་སྦྱོར་དང་སྒྲུབ་པ་ཉམས་ལེན་ཁོ་ནས་སྐུ་ཚེ་ཧྲིལ་པོར་ཉིན་གཅིག་གི་འགྲོ་ཚུལ་ལས་མི་འདའ་ཞིང་། སྐྱབས་གནས་རྣམས་ལ་རང་རང་གི་འདོད་མོས་བཞིན་བྱིན་རླབས་བྱེད་པ་སོགས་རྒྱལ་སྲས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཕྱོགས་རྒྱ་མཚོ་ཕྱག་མཚན་དུ་བཞེས་པ་ཡིན་ནོ། །དགུང་གྲངས་སོ་གཉིས་ཐོག་སྤྱི་ལོ་(1885) ་ལོར་མུ་ར་འཇམ་བསྟན་སོགས་ཀྱིས་གྲོགས་བྱས་ནས་རྨ་ཡུལ་དཀར་སྒྲོག་(རྒྱོག)གཉིས་ཀྱི་བར་མཚམས་ལུག་བའི་ལུང་བ་ཞེས་པ་དེ་ས་ཡི་དཔྱད་ལེགས་པ། དགེ་སྦྱོར་དང་ཏིང་ངེ་འཛིན་འཕེལ་བའི་གནས་ཁྱད་པར་ཅན་ཏུ་བྱིན་གྱིས་བརླབས་ནས་རི་ཁྲོད་ཅིག་ཕྱག་འདེབས་མཛད། རི་ཁྲོད་བཏབ་པ་གཟིམ་ཁང་བཞེངས་པ་དང་། རི་ཁྲོད་དབུ་བརྙེས་པ་གནས་དེར་ཆོས་ཀྱི་མཛད་པ་བསྐྱང་བའི་དབུ་བརྩམས་པ་ལ་གོ་དགོས་སོ། ། དེ་དུས་ཁོང་གི་ཐུགས་བསྐྱེད་རྣམ་པར་དཀར་བའི་སྟོབས་དང་། ལས་དང་སྨོན་ལམ་གྱི་དབང་གིས་གདུལ་བྱ་དུས་སུ་སྨིན་ནས། མུ་རའི་སྒར་བ་ཁག་བརྒྱད་སོགས་ཕྱོགས་ཀུན་ནས་བླ་སྤྲུལ་དགེ་བའི་བཤེས་གཉེན་མང་པོ་པདྨའི་ཚལ་ལ་བུང་བ་ལྟར་འདུས། དགེ་བའི་བཤེས་གཉེན་ཆེན་པོ་བྱ་བླ་མ་འཇིགས་མེད་དར་རྒྱས་དང་། བྱ་བླ་མ་སྦྱིན་པ་རྒྱ་མཚོ་སྐུ་མཆེད་རྣམ་གཉིས་བྱོན། ཁོང་གཉིས་མཁས་བཙུན་གཉིས་ལྡན་གྱི་སྐྱེས་བུ་དམ་པ་ཡིན་པས་བཤད་སྒྲུབ་འཁོར་ལོ་གསུམ་གྱི་བྱ་བ་ལ་རྟག་པར་བརྩོན་ཞིང་གྲུབ་མཐའ་རིས་མེད་ཀྱིས་རྒྱལ་བསྟན་རིན་པོ་ཆེ་འཛིན་སྐྱོང་སྤེལ་གསུམ་བྱེད་པ་དང་། བསྟན་པའི་གཞི་མ་དམ་ཆོས་འདུལ་བའི་བསྟན་པ་གཙོ་བོར་བྱས། མཁན་འཇིགས་མེད་དར་རྒྱས་དཔལ་བཟང་པོའི་མདུན་ནས་དགེ་ཚུལ་སློང་བཅུ་ཕྲག་དུ་མ་ཞིག་བསྒྲུབས་ཏེ་བླ་མ་སྦྱིན་པ་རྒྱ་མཚོས་དབྱར་བདག་གི་ཁུར་བཞེས་ནས་དབྱར་གནས་དང་གསོ་སྦྱོང་སོགས་དམ་ཆོས་འདུལ་བའི་གཞི་ལེགས་པར་བཙུགས། སློབ་ཚོགས་རྣམས་ལ་རང་རང་གི་དགོས་མཁོ་དང་བསྟུན་ནས་མདོ་སྔགས་ཀྱི་ཆོས་འཆད་ཉན་སྒོམ་སྒྲུབ་སོགས་ལུང་རྟོགས་ཀྱི་བསྟན་པ་རྒྱས་པར་མཛད། གཞན་འཇིག་རྟེན་གྱི་བྱ་བ་དང་། གྲོང་ཆོག་སོགས་ཀྱི་འདུ་འཛི་གཅིག་ཀྱང་མི་སྒྲུབ་པར་སྐུ་ཚེ་ཧྲིལ་པོར་འཆད་ཉན་མེད་ཚེ་མཚམས་བཅད་རྒྱ་བྱས་ནས་ཚོགས་བསགས་དང་བསྙེན་སྒྲུབ་ཁོ་ནས་དུས་འདའ་བར་བཞུགས། པཎ་ཆེན་དགུ་བ་ཆེན་པོ་སྐྱེ་དགུར་ཕེབས་ཚེ་ཤར་འོད་རི་ཁྲོད་དང་འདུག་དགེ་རི་ཁྲོད་གཉིས་ཀྱི་སྙན་པ་གསན་ཏེ་སྨྱུང་གནས་གསུང་རྟེན་འབུལ་བ་རྒྱ་ཆེར་གནང་། རི་ཁྲོད་གཉིས་ཀྱིས་ཀྱང་ཞབས་བརྟན་དུ་སྨྱུང་གནས་འབུམ་རེ་ཆོས་ཀྱི་མཎྜལ་དུ་ཕུལ། པཎ་ཆེན་མཆོག་གིས་དབེན་ས་སྙན་བརྒྱུད་ཀྱི་ཕྱག་བཞེས་དྲི་མེད་འཛིན་པའི་བསྔགས་པ་དང་། ཤར་འོད་ཚུལ་རྣམ་ཚངས་དང་། འདུག་དགེ་རི་ཁྲོད་པ་གཉིས་ལ་བཀྲ་ཤིས་ལྷུན་པོའི་སྔགས་གྲྭའི་རྡོ་རྗེ་སློབ་དཔོན་དང་མཚུངས་པའི་གདན་ཐོབ་གནང་། སྐུ་གཟན་སེར་པོ་དང་བཀའ་ཤོག་ཀྱང་བསྩལ། སྤྱི་ལོ་(1935)་ལོར་དགུང་གྲངས་༨༣སྐབས་ཁོང་རིན་པོ་ཆེས་ཞལ་ནས། བླ་མ་རྣམ་གཉིས་ཞིང་ལ་བྱོན་ཤུལ་དུ་ཁྱེད་རྣམས་ལ་འདུག་རོགས་ཅུང་ཟད་རེ་དགོས་སྙམས་ནས་ད་བར་ལུས། ད་ནི་ཚ་ཁོ་བླ་མ་སོགས་བཞུགས་རིང་ལ་ཤི་ན་དགའ་གསུངས་ནས་སྐུ་བསྙུང་ཚུལ་བསྟན་ཀྱང་། བསྙེན་གནས་བསྲུང་བ། མཆོད་པ་ཕུལ་བ། ཕྱག་འཚལ་བ། སྐུ་དང་ས་ཙྪ་འདེབས་པ་སོགས་གཅིག་ཀྱང་མི་ལུས་པར་སྔར་ལྟར་བྱེད། གཞི་ཆེན་ཚང་གི་བླ་མ་མགོ་སེར་བཀྲ་ཤིས་རྒྱ་མཚོ་ལ་དངུལ་རྡོ་ཚད་གཅིག་དང་མཛོད་ཐག་དཀར་པོ་གནང་ནས་ད་ནི་རི་ཁྲོད་འདི་ལ་བདག་པོ་མེད་པས་ཁྱེད་བླ་མ་གཞི་ཆེན་ཚང་གིས་རོགས་རམ་མཛོད་ལ་མུ་རའི་སེར་སྡེས་རི་ཁྲོད་འདི་ལ་བདག་པོ་གྱིས་གསུངས་ནས་རྗེ་འདི་བའི་སྐུ་རིང་ལ་མུ་རའི་སེར་སྡེ་དང་རི་ཁྲོད་བསྲེས། །འདི་སྐོར་ཞིག་ལ་ཨ་སྐྱོང་ཁང་གསར་དཔོན་པཎ་ཆེན་སྐུ་མཆེད་ཀྱིས་གསོལ་བ་ནན་གྱིས་བཏབ་པ་ལྟར་ཐུགས་རྗེ་ཆེན་པོ་སྡུག་བསྔལ་རང་གྲོལ་གྱི་དབང་ཆེན་བསྐུར། རྨ་ཆུའི་ཉིན་སྲིབ་གཉིས་ཀ་དབང་ཞུ་པས་གང་། དབང་འདི་སྐུ་ཚེའི་ནང་དུ་ཐོག་མར་གནང་པ་དང་ཐ་མར་ཡང་གྱུར། དྲུག་པ་ཆུ་སྟོད་ཟླ་བའི་ཡར་ཚེས་༤་བཟང་པོར་སྨྱུང་གནས་བསྲུང་ཞིང་ངག་བཅད་ཉིན། ནང་སྔ་མོར་ཞལ་འདོན་གནང་། མཆོད་པ་ཡོངས་རྫོགས་བཤམས། ཕྱག་བརྒྱ་ཙམ་འཚལ་ནས་ཆུ་གཏོར་གསུངས་སྐབས་ནམ་མཁར་འཇའ་འོད་ཀྱིས་གང་། གཟིམ་ཁང་དུ་བྱོན་ཚེ་འཇའ་སྣེ་གཟིམ་ཁང་སྟེང་དུ་ཟུག་ཡོད་པ་ཀུན་ཀྱིས་མཐོང་། གཟིམ་ཁང་སྒོ་སྡོམ་པའི་ཕྱག་བརྡ་མཛད་ནས་གཟུགས་སྐུའི་བཀོད་པ་ཆོས་ཀྱི་དབྱིངས་སུ་བསྡུས་པའི་ཚུལ་བསྟན་ཐུགས་དམ་ཉིན་གསུམ་ལ་བཞུགས་སོ། །དེ་རྗེས་རིམ་བཞིན་ཕྱོགས་ཀྱི་གྲྭ་བ་དང་། སྐྱབས་གནས་པ་ཀུན་སོ་སོའི་རང་ཡུལ་དུ་ཕེབས། ཛ་མགོ་ཚ་སྤྲུལ་ཚང་གིས་དབུ་བྱས་ནས་མུ་རའི་སེར་སྡེ་དང་རི་ཁྲོད་བསྲེས་ནས་རིམ་བཞིན་སྤྱི་དགོན་གྱུར་ཏོ། །
༈ འདུག་དགེ་སྐུ་ཕྲེང་གཉིས་པ། བྱམས་པ་ཆོས་གྲགས། སྤྱི་ལོ་(1936)་ལོར་ཡབ་ཁྱུང་རྒྱལ་དང་ཡུམ་བཀའ་སྒྲོན་གཉིས་ཀྱི་སྲས་སུ་བྱེ་གཤོང་འདུག་ཚང་དུ་སྐུ་བལྟམས། ཡོངས་འཛིན་ཕུར་བུ་ཅོག་བྱམས་པ་དཔོན་སློབ་རིན་པོ་ཆེའི་མདུན་ནས་བུམ་པ་ཐེངས་གསུམ་ལ་དཀྲུགས་ནས་ངོས་འཛིན་གནང་། མཚན་བྱམས་པ་ཆོས་གྲགས་གསོལ། དགུང་གྲངས་བདུན་ལོར་མུ་རའི་རི་ཁྲོད་དུ་ཁྲི་འདོན་མཛད། མཁན་བྱང་ཆུབ་རྒྱལ་མཚན་དང་མུ་ར་བླ་མ་བཟོད་ཀུན་རྣམ་གཉིས་དགེ་རྒན་དུ་བསྐོས། སྙིང་རྗེ་དང་མཁྱེན་རབ་ལྷན་སྐྱེས་སུ་མངའ་བའི་སྐྱེས་བུ་དམ་པའི་ཁྱད་ཆོས་དང་ལྡན་པ་ཡིན་པས་འབྲི་ཀློག་ཚེགས་མེད་དུ་མཁྱེན། དགུང་གྲངས་བཅུ་གཅིག་ཐོག་རབ་ཏུ་བྱུང་ནས་བསླབ་པ་གསུམ་ཉམས་སུ་བླང་། སྐྱེས་བུ་དམ་པ་དུ་མའི་མདུན་ནས་དབང་ལུང་མན་ངག་གི་རིམ་པ་མང་པོ་གསན། དགུང་གྲངས་བཅོ་བརྒྱད་སྟེང་བླ་བྲང་བཀྲ་ཤིས་འཁྱིལ་དུ་གྲྭ་སར་ཕེབས་ནས་དཔེ་གཟིགས་གནང་། དགུང་གྲངས་ཉི་ཤུའི་སྟེང་ཕྱིར་རང་དགོན་དུ་ཕེབས་ནས་ཚེ་དབང་དང་བཀའི་བཀོད་རྒྱ་མི་ཆུང་བར་གནང་ནས་ཕྱིར་ཕེབས། དགུང་གྲངས་ཉེར་གཅིག་ལོར་ཕར་ཕྱིན་ལ་སླེབས་ཚེ་མཁས་པའི་གྲགས་པ་ཐོབ། དགུང་གྲངས་ཉེར་གསུམ་ལོ་སྤྱི་ལོ་(1958)་ལོར་དགོངས་པ་ཆོས་དབྱིངས་སུ་གཤེགས། །
༈ འདུག་དགེ་སྐུ་ཕྲེང་གསུམ་པ། ཨོ་རྒྱན་གསུང་རབ་བཟང་པོ་ནི། སྤྱི་ལོ་(1973)་རབ་བྱུང་བཅུ་དྲུག་པའི་ཆུ་གླང་ལོར་ཡབ་སོག་ནོར་དང་ཡུམ་མུར་བཟའ་འཛོམས་པོའི་སྲས་སུ་སྐུ་འཁྲུངས། ཁོང་སྐུ་ན་ཆུང་ངའི་དུས་ནས་བྱམས་སྙིང་རྗེ་སོགས་དམ་པའི་སྤྱོད་བཟང་ལྷན་སྐྱེས་སུ་མངའ། བྱ་སྤྱོད་གང་ཐད་ནས་བཟང་པོ་ཞིག་ཡིན་པས་ཆུང་མིང་ལའང་བཟང་པོ་ཞེས་གྲགས། ལུང་བསྟན་དུ་སྐུ་འཕྲེང་འདི་ལ་སྐུ་གསུང་ཐུགས་ཀྱི་སྤྲུལ་བ་གསུམ་བྱུང་བ་ལས། འདུག་དགེ་སྐུ་གོང་མས་ད་ལྟའི་སྤྲུལ་སྐུ་ལུང་བསྟན་གནང་པ་ནི། ཡབ་སོག་པོ་ནོར་བུ་སྔ་སོར་ཀིརྟི་དགོན་གྱི་གྲྭ་བ་ཡིན། ཀློག་ལ་མཁས་པས་བྱེ་གཤོང་དཔོན་ཚང་ལ་ཨ་མཆོད་དུ་བཞུགས་སྐབས་ཤིག་ལ། འདུག་དགེ་སྐུ་འཕྲེང་གཉིས་པ་བྱམས་པ་ཆོས་གྲགས་ནས་གསུང་འཕྲིན་བཏང་སྟེ་ཁོང་གི་སྐུ་མདུན་དུ་ཤོག་གསུངས་པ་བཞིན་སོང་ཚེ་ཁྱོད་གྲྭ་སའི་གྲྭ་བ་ཡིན་པས་གྲྭ་སའི་འགྲོ་ལུགས་ལ་རྒྱུས་ཆེ་བས་འདྲི་འདོད་པ་རེ་ཡོད་གསུངས་ནས་བཀའ་མོལ་ཞིབ་རྒྱས་མཛད་རྗེས། ཁོང་གིས་ཕྱག་ཕྲེང་འདི་ཁྱོད་ལ་སྦྱིན། དགོས་པའི་དུས་ཤིག་ཡོད་གསུང་ནས་ཐུགས་དགྱེས་པར་མཛད། ཕྱག་ཕྲེང་ད་ལྟ་ཡང་སྤྲུལ་གསུང་རབ་སྐལ་ལྡན་ཕྱག་ན་ཡོད་པས་སྐུ་གོང་མའི་དུས་ནས་རྟེན་འབྲེལ་བསྒྲིགས་པ་ལྟ་བུར་གྱུར་པ་དང་། ཁམས་གཙང་གཏེར་ཆེན་གར་དབང་འགྲོ་འདུལ་གླིང་པའི་གཏེར་ལུང་དུ། རང་གནས་ཉེ་འདབས་དཀར་པོའི་རི་སུལ་དུ། །ནོར་བུའི་ཅང་ཤེས་བརྒྱན་པའི་རྟེན་འབྱུང་ལས། །ཁྱུ་མཆོག་ལོ་བ་སྙིང་རྗེ་ཤེས་རབ་ལྡན། །ཏཱ་རེའི་ཐུགས་རྗེའི་བསིལ་གྲིབ་ལ་བརྟེན་ནས། །ལྔ་ལྡན་ཨུཏྤལ་གསར་བའི་ལང་ཚོ་དེ། །ངུར་སྨྲིག་རྩི་ཡིས་བརྒྱན་ན་བསྟན་འགྲོར་ཕན། །ཞེས་གསུངས་པའི་འཕགས་པ་སྤྱན་རས་གཟིགས་ཀྱི་བཀའ་ལུང་། དེ་བཞིན་དུ་(2010)་བོད་ཟླ་(09)-ཚེས་(01)་ཉིན་ཀུན་མཁྱེན་སྐུ་ཕྲེང་དྲུག་པ་༧ བློ་བཟང་འཇིགས་མེད་ཐུབ་བསྟན་ཆོས་ཀྱི་ཉི་མ་མཆོག་གིས་འདུག་དགེ་སྐུ་ཕྲེང་གཉིས་པའི་ཡང་སྤྲུལ་དུ་ངོས་འཛིན་མཛད་དེ་ཨོ་རྒྱན་གསུང་རབ་བཟང་པོ་ཞེས་མཚན་གྱི་ཅོད་པན་བསྩལ། དགུང་ལོ་བཅུ་གཅིག་གི་སྟེང་ (1983)་ལོ་མུ་ར་སྤྲུལ་སྐུ་མཆོག་གམ་བསྟན་འཛིན་བཟང་པོས་ཀློག་བསླབ་ཚེ་ཁོང་དམ་པའི་སྐྱེ་སྤྲུལ་ཡིན་པས་དཀའ་ཚེགས་མེད་པར་མཁྱེན། སྔོན་འགྲོ་བསགས་སྦྱང་སོགས་ནས་རིག་འཛིན་བརྒྱུད་པའི་ཕྱག་བཞེས་ས་བཅད་ཕྱག་ལེན་འདོན་ལྟ་དབྱངས་སོགས་དང་ཁམས་གཙང་གཏེར་ཆེན་རིན་པོ་ཆེའི་གཏེར་ཆོས་ཡོངས་ཀྱི་དབང་ལུང་ཁྲིད་སོགས་རྒྱས་པར་གསན། དམ་པ་དུ་མའི་མདུན་ནས་ཐོས་བསམ་ལ་གསན་སྦྱང་མཛད། དགུང་གྲངས་བཅུ་བཞིའི་ཐོག་དབོན་སྤྲུལ་རིན་པོ་ཆེའི་མདུན་ནས་དགེ་ཚུལ་གྱི་སྡོམ་པ་བཞེས་པའི་མཚན་ལ་གསུང་རབ་སྐལ་ལྡན་དུ་གསོལ། ཁོང་གི་སྐུ་མདུན་ནས་སྤྱོད་འཇུག་ཆེན་མོ་སོགས་གསན་སྦྱང་ལེགས་པར་བགྱིས། གཞི་ཆེན་བཻ་རོ་འཇམ་དབྱངས་བསྟན་པའི་རྒྱལ་མཚན་མདུན་ནས་བདུད་ཀློང་གཉིས་ཀྱི་དབང་གསན། དགུང་གྲངས་ཉི་ཤུ་ནས་བླ་བྲང་བཀྲ་ཤིས་འཁྱིལ་དུ་བྱོན་ནས་དགེ་བའི་བཤེས་གཉེན་ཆེན་པོ་ཨ་ཁུ་འཇམ་དབྱངས་ཉི་མ་དང་ཁྲི་བ་དགེ་འདུན་རྒྱ་མཚོ། ཨ་ཁུ་བཀྲ་ཤིས་རྒྱ་མཚོ། ཁྲི་ཆེན་གུང་ཐང་སྐུ་ཕྲེང་དྲུག་པ་བསྟན་པའི་དབང་ཕྱུག་སོགས་ཀྱི་མདུན་ནས་དབང་དང་བཀའ་ཆོས་མང་དུ་གསན་བཞེས་གནང་ནས་ལོ་འགའ་ཤས་ལ་སློབ་གཉེར་བྱས། དགུང་གྲངས་སུམ་ཅུ་(2002)་ནས་བླ་རུང་ཆོས་སྡེ་ཆེན་པོར་ཕེབས་ནས་ ༧ མཁན་ཡིད་བཞིན་ནོར་བུ་འཇིགས་མེད་ཕུན་ཚོགས་འབྱུང་གནས་དང་དགེ་བའི་བཤེས་གཉེན་དུ་མ་གཙུག་ཏུ་བཀུར་ནས་ཐོས་བསམ་སློབ་གཉེར་བྱས་ཤིང་དབང་ལུང་མན་ངག་གི་རིམ་པ་རྒྱ་ཆེར་ཐོབ། ཕྱི་ལོ་(2019/03/22)་ཉིན་ཁྱབ་བདག་རྫོགས་ཆེན་པ་༧ པདྨ་སྐལ་བཟང་གི་མདུན་ནས་རྫོགས་པ་ཆེན་པོ་བླ་མ་ཡང་ཏིག་དང་རྫོགས་ཆེན་སྙན་བརྒྱུད་ཆེན་མོ་གསན་བཞེས་མཛད་སྐབས་ཐུགས་དགྱེས་པ་ཆེན་པོས་རྗེས་སུ་བཟུང་ནས་ཐུགས་སྲས་ཀྱི་ཡ་གྱལ་དུ་གྱུར། ཐུགས་རྒྱུད་དྲན་ཤེས་བག་ཡོད་ཀྱིས་ལེགས་པར་བསྡམས་ནས་ལམ་བསླབ་པ་གསུམ་གྱི་ཡོན་ཏན་གྱིས་ཕྱུག་ཅིང་སྤོང་ཀློག་འཁོར་ལོ་གསུམ་གྱི་བྱ་བ་ལ་རྟག་པར་བརྩོན། སྐྱེས་བུ་དམ་པའི་ངང་ཚུལ་ལས་མི་འདའ་ཞིང་ལུགས་གཉིས་ཀྱི་ཕྱོགས་ལ་སྤྱན་དཀྱུས་ཡངས་པོས་བཞུགས་སོ། །
15. མུ་རའི་མཁན་རབས་རིམ་བྱོན། མུ་རའི་སེར་སྡེ་ཆགས་ནས་ཡུན་རིང་བྱུང་ཡང་རབ་བྱུང་དང་སྔགས་པ་འདྲེས་མ་ཡིན་པས་འདུལ་བ་གཞི་གསུམ་གྱི་ཕྱག་བཞེས་ཚུགས་ཐུབ་མེད། འདུག་དགེ་རི་ཁྲོད་དུ་ཡང་ཐོག་མར་སྒྲུབ་སྡེ་ཡིན་པས་རབ་བྱུང་གི་སྡེ་ཡོད་ཀྱང་དབྱར་གནས་ཕྱག་བཞེས་མ་བྱུང་། རྫོགས་ཆེན་ནས་བྱ་གཏེར་གྱི་སྲས་བླ་མ་རྣམ་གཉིས་དང་། ཚ་བླ་སྐུ་མཆེད་གཉིས་ཕེབས་ཏེ་རབ་བྱུང་རྣམས་ཀྱིས་གསོ་སྦྱོང་ལོ་ཤས་མཛད། དབྱར་གནས་ལ་དགོན་སྡེ་གཞན་དུ་ཕེབས་དགོས་སྟབས། བླ་མ་རྣམས་ཐུགས་དགོངས་རྩེ་གཅིག་ཏུ་གཏད་དེ་མུ་ར་རང་གི་ས་གནས་སུ་དབྱར་གནས་ཚུགས་ཐབས་མཛད། ཐོག་མར་རྟེན་འབྲེལ་གྱིས་ཀུན་གྱིས་བཀུར་བའི་བླ་མ་གཞི་ཆེན་མ་འདས་སྤྲུལ་སྐུར་མཁན་པོར་བཞུགས་པར་གསོལ་བ་བཏབ་པས་ཁོང་ཐུགས་རབ་ཏུ་མཉེས་ཏེ་ཞལ་བཞེས་གནང་། དཔའ་བླའམ་དཔའ་མཚོའི་གྲུབ་ཆེན་དུ་གྲགས་པས་དགོན་སྡེའི་ཆེད་སྤོང་དག་ལན་གསུམ་མཛད་པའི་དང་པོ་མུ་རའི་དབྱར་གནས་ཚུགས་པའི་ཆེད་དུ་སྤོང་དག་མཛད་པ་སྟེ། སྦྲ་ཕུག་ནོར་དང་བཅས་པ། སྒོ་ཟོག་ཁྱི་དང་བཅས་པ་གཙང་འབུལ་བྱས། དགོན་པས་བླ་མ་ཉེ་བར་མཁོ་བའི་ཆས་ཀ་ཅུང་ཟད་ཕྱིར་ཕུལ། གཞན་ཚང་བར་བཞེས་པར། རྟ་བཅུ། དྲེལ་གཉིས། ཁྱི་གཉིས། འབྲི་སུམ་བཅུ། ཟོག་བརྒྱ། ལུག་བརྒྱ་ལྷག དངུལ་ཕོན་ཆེན། གོས་ཆེན་དོ་བོ་ཁ་ཤས་དང་། སྦྲ་གུར་ཆེ་ཆུང་དུ་མ་ཡོད་པར་བཤད། དབྱར་གནས་པ་རྣམས་ལ་འདུ་ཁང་གུར་ཆེན། སྦྲ་ནག་རུང་ཁང་། ཆོས་གོས། རྣམ་སྦྱར། གདིང་བ། གུང་ཚིག་སོགས་ཀྱི་རྟེན་དུ་བསྔོས། ཐེངས་དང་པོའི་དབྱར་གནས་སྐབས་འདིར་མཁན་སློབ་སྦྱིན་པའི་བདག་པོ་བཅས་ཕུན་སུམ་ཚོགས་པ་བྱུང་བས་དབྱར་གནས་ཁ་བསོད་ཅན་གྱི་སྐབས་ཟེར་བའི་གཏམ་དཔེ་བྱུང་། ཕྱིས་སུ་འདུག་དགེ་རི་ཁྲོད་པ་སོགས་གཤེགས་པའི་རྗེས་སུ་རི་ཁྲོད་ཀྱི་དགེ་སློང་རྣམས་ལ་འཚོ་བའི་དཀའ་ངལ་ཅུང་ཟད་བྱུང་ཡང་བསྟན་འགྲོའི་དོན་དུ་སྐུ་སྲོག་གཏོང་ཐུབ་པའི་དགེ་སྦྱོང་ཐུགས་སྟོབས་བླ་ན་མེད་པ་དག་གིས་འབད་པ་ཆེན་པོས་མུ་ར་ལ་དབྱར་གནས་གསོ་སྦྱོང་ཚུགས་ནས་བཟུང་སྟེ་ཆད་མེད་གནང་བའི་ངོ་མཚར་བའི་རྣམ་པར་ཐར་བ་ཤིན་ཏུ་མང་པོ་མངའ་བ་ཡིན་ནོ། །
༡མཁན་རབས་དང་པོ། གཞི་ཆེན་བཻ་རོ་མ་འདས་སྤྲུལ་སྐུ་བློ་བཟང་དྲི་མེད་བསྟན་འཛིན། ཁོང་གིས་གཞི་ཆེན་དགོན་པའི་མཁན་པོ་དང་རྡོ་རྗེ་སློབ་དཔོན་གཅིག་ཆོག་མཛད། ཉག་བླ་བསོད་རྒྱལ་གྱི་ཆོས་བདག་ཡིན། ཁོང་གི་ཐུགས་བསྐྱེད་ལ་བསྟེན་ནས་ཉག་བླ་བསོད་རྒྱལ་དགུང་ལོ་༥༩་བཞེས་པ་ཤིང་སྟག་ལོའི་(1914)དཔྱིད་ཀ་མུ་ར་ལ་གདན་དྲངས། མུ་རའི་མགོན་པོ་དང་ཕུར་བའི་སྒྲུབ་པའི་དབུ་བཞུགས་གནང་། མུ་རའི་ཆེད་དུ་མགོན་པོའི་གསོལ་བསྡུས་དགོངས་གཏེར་བཏོན། ལོ་དེར་བཻ་རོ་མ་འདས་སྐུ་དངོས་ཀྱིས་མཁན་པོ་མཛད་དེ་མུ་ར་དབྱར་གནས་བཙུགས། ལྷུང་བཟེད་དང་གཎྜི། རིལ་བ་སྤྱི་བླུགས་སོགས་འདུལ་བའི་ཉེར་སྤྱད་རིགས་སྤུས་གཙང་ཚད་ལྡན་སྐུ་དངོས་ཀྱིས་ཡོན་གྱིས་བླུས་ཏེ་མུ་ར་དགོན་སྡེར་སྤྱི་འཇོག་གནང་། མུར་བྱེ་(མུ་ར། བྱེ་གཤོང་)གཉིས་དང་གཞི་ཆེན་ཚང་གི་གྲྭ་བ་རྣམས་བསྡོམ་པའི་དབྱར་གནས་ཚུལ་ཤིང་ལེན་མཁན་བརྒྱད་ཅུ་བྱུང་། མུ་རའི་སེར་སྡེ་བརྒྱད་ཅུ་ཟེར་བའི་སྲོལ་བྱུང་།
༢མཁན་རབས་གཉིས་པ། མཁན་ཆེན་འཇིགས་དར། བྱ་གཏེར་གྱི་སྲས་སུ་འཁྲུངས། སྐུ་ཆུང་ངུའི་དུས་ནས་རབ་ཏུ་བྱུང་། མདོ་སྔགས་རིག་གནས་ཀུན་ལ་མཁས། རྫོགས་ཆེན་དགོན་དང་རྡོ་གྲུབ་སྒར་ནས་སློབ་གཉེར་གནང་ཤིང་མཁན་པོར་གྱུར། དགེ་སྦྱོང་བྱ་བྲལ་བའི་ཚུལ་གྱིས་བཞུགས་པ་ཡིན་ནོ། །
༣མཁན་རབས་གསུམ་པ། མཁན་ཆེན་སྦྱིན་པ། བྱ་གཏེར་གྱི་སྲས་སུ་འཁྲུངས། སྐུ་ཆུང་ངུའི་དུས་ནས་རབ་ཏུ་བྱུང་། རྫོགས་ཆེན་དགོན་དང་རྡོ་གྲུབ་སྒར་ནས་སློབ་གཉེར་གནང་ཤིང་མཁན་པོར་གྱུར། མུ་རའི་རི་ཁྲོད་དུ་ཕེབས་ནས་བཟུང་སྐུ་མ་གཤེགས་བར་ཐེག་ཆེན་སྨྱུང་གནས་ལ་བཞུགས། དགེ་སྦྱོང་བྱ་བྲལ་བའི་ཚུལ་གྱིས་བཞུགས་པ་ཡིན་ནོ། །ཁོང་སྐུ་མཆེད་གཉིས་རེས་མོས་བྱས་ཏེ་སྐུ་གཤེགས་བར་མུ་ར་དགོན་པའི་མཁན་པོ་གནང་ངོ་། །
༤མཁན་རབས་བཞི་བ། མཁན་ཆེན་ཀུན་དགའ་ལེགས་བཟང་། ཛ་མགོ་ཚ་སྤྲུལ་སྐུ་ཕྲེང་གཉིས་པ་ཡིན། ཛ་མགོའི་རི་ཁྲོད་དུ་ཀུན་དགའ་རིག་མཆོག་ལས་རབ་ཏུ་བྱུང་། ཛཾ་ཐང་སོགས་སུ་གཞུང་ལུགས་རྒྱ་མཚོར་ཐོས་བསམ་གནང་། མུ་ར་དགོན་པའི་མཁན་པོ་ལོ་ཤས་མཛད། རྣམ་ཐར་གོང་དུ་སོང་། 
༥མཁན་རབས་ལྔ་བ། མཁན་ཆེན་ཐུབ་པ། གཞི་ཆེན་མཚོ་མགོ་ཚང་ཡིན། གཞི་ཆེན་མཁར་དམར་གླིང་གི་མགོན་བླ་དང་། གཞི་ཆེན་རག་བཀྲམ་དགོན་པའི་དབྱར་བདག་སོགས་གནང་། སྐུ་བཙུན་པའི་མཆོག་ཏུ་གྱུར། ལོ་རེ་ཟུང་ལ་མུ་རའི་དབྱར་གནས་ཀྱི་མཁན་པོ་མཛད།
༦མཁན་རབས་དྲུག་པ། མཁན་ཆེན་དགའ་གྲོལ་རིན་པོ་ཆེ། སྐུ་ཆུང་ངའི་དུས་ནས་རབ་ཏུ་བྱུང་། གཞི་ཆེན་དགོན་དང་ཀཿཐོག་དགོན་ནས་སློབ་སྦྱོང་གནང་། ཨ་ཛཾ་འབྲུག་པའི་ཐུགས་ཟིན་གྱི་སློབ་མར་གྱུར། སྐུ་ཚེ་དེ་ཉིད་ལ་བཞོན་པ་དང་ཤ་སྤང་། དཀོར་ཟས་དགེ་འདུན་ལ་བསྔོ་བ་ལས་བདག་གིར་མི་མཛད། མུ་ར་དགོན་གྱི་སྤྲུལ་སྐུ་རྣམས་ཀྱི་ཡོངས་འཛིན་དང་དབྱར་གནས་མཁན་པོ་མཛད། 
༧མཁན་རབས་བདུན་པ། མཁན་ཆེན་བྱང་ཆུབ་རྒྱལ་མཚན། སྐུ་ཆུང་ངུའི་དུས་ནས་རབ་ཏུ་བྱུང་། སྐུ་ཚེ་དེ་ཉིད་དུ་སྒྲུབ་པ་ཉམས་ལེན་གནང་། མུ་ར་དགོན་པའི་མཁན་པོ་ཡུན་རིང་མཛད།
༨མཁན་རབས་བརྒྱད་པ། མཁན་ཆེན་དཀོན་མཆོག་ཚུལ་ཁྲིམས། སྐུ་ཆུང་ངུའི་དུས་ནས་རབ་ཏུ་བྱུང་། རྭ་རྒྱ་དགོན་དུ་ཚོགས་ཞུགས་གནང་། ཤར་འོད་ཚུལ་རྣམ་ལས་བསྙེན་རྫོགས་ཞུས། མུ་ར་དགོན་པའི་མཁན་པོ་རྣམས་དངོས་ཕེབས་ཐུབ་མིན་སྐབས་སུ་མཁན་ཚབ་དང་། ལས་ཐོག་མཁན་པོ་ཡང་ཡུན་རིང་གནང་། རྗེས་སུ་དུས་འགྱུར་སྐབས་དབྱར་གནས་དང་གསོ་སྦྱོང་ཆད་མེད་མཛད་པའང་ཁོང་གི་སྐུ་དྲིན་ཉག་གཅིག་ཡིན།
༩མཁན་རབས་དགུ་པ། མཁན་ཆེན་ཀུན་དགའ་ཆོས་འཕེལ། མཁས་བཙུན་བཟང་གསུམ་འཛོམས་པའི་སྐྱེས་བུ་དམ་པ་ཞིག་ཡིན། མཁན་དཀོན་མཆོག་ཚུལ་ཁྲིམས་ཁོང་རྣམ་གཉིས་མཁན་རེས་མོས་བྱས་ཏེ་ཡུན་རིང་བཞུགས་སུ་གསོལ། །
༡༠མཁན་རབས་བཅུ་བ། མཁན་ཆེན་བསྟན་འཛིན་བཟང་པོ། ཡོངས་གྲགས་སུ་སྤྲུལ་སྐུ་སྐུ་མཆོག་ཟེར། ལོ་བཅུ་གྲངས་ལ་མཁན་པོ་གནང་། གཞོན་པ་རྣམས་ལ་འདུལ་བའི་སླབ་བྱ་གནང་། སྡེ་དགོན་སྤྱི་ལ་བཀའ་དྲིན་བླ་ན་མཐོ། རྣམ་ཐར་འོག་ནས་འབྱུང་།
༡༡མཁན་རབས་བཅུ་གཅིག་པ། མཁན་ཆེན་བསམ་པ་ལྷུན་གྲུབ། མཚན་གཞན་ཐུབ་བསྟན་འཕྲིན་ལས་རྒྱ་མཚོ་ཟེར། ཆུང་ངུའི་དུས་ནས་རབ་ཏུ་བྱུང་། གཞི་ཆེན་རཀ་བཀྲམ་བྱམས་པ་གླིང་དུ་ཕེབས་གཞི་ཆེན་མ་འདས་རིན་པོ་ཆེ་རྩ་བའི་བླ་མར་བཀུར། རྡོ་རྗེ་སློབ་དཔོན་དུ་མངའ་གསོལ། བསྟན་པ་ཡང་དར་སྐབས་སུ་མཁན་པོ་ལོ་བཅུ་ཕྲག་མཛད། །
༡༢མཁན་རབས་བཅུ་གཉིས་པ། མཁན་ཆེན་བསྟན་པ་རབ་རྒྱས། མུ་ར་དགོན་ནས་མཁན་པོར་མངའ་གསོལ། དགོན་པའི་རྒྱལ་ཚབས་ཡང་ཡིན་ནོ། །
༡༣མཁན་རབས་བཅུ་གསུམ་པ། མཁན་ཆེན་ཐུབ་བསྟན་རྒྱ་མཚོ། མུ་ར་དགོན་ནས་མཁན་པོར་མངའ་གསོལ། དམ་པའི་སྐྱེས་བུ་རྣམས་ལ་ཁམས་གཙང་རིན་པོ་ཆེའི་གཏེར་ཆོས་ཀྱིས་ལུང་རྒྱུན་སྤེལ། མཁན་ཆེན་ཕྱི་མ་ཁོང་རྣམ་གཉིས་རེས་མོས་ཀྱིས་ཡུན་རིང་བར་མཁན་པོ་གནང་ངོ་།།
༡༤མཁན་རབས་བཅུ་བཞི་པ། མཁན་ཆེན་ཀུན་གསལ་ལམ་ཐུབ་བསྟན་དཔལ་ལྡན་བཟང་པོ།     བླ་རུང་ནས་མཁན་ཐོབ་བཞེས། བཤད་གྲྭའིའ་མཁན་པོ་ཐོག་མ་དང་། ད་ལྟའི་ཚོགས་ཆེན་ལས་ཐོག་མཁན་པོ་ཡིན་ནོ། ། གནང་བའི་མཁན་པོ་རིམ་བྱོན་ལོ་རྒྱུས་སྔོན་གྱི་བྲིས་པ་དག་ལ་ཆད་པ་བྱུང་བ་(2014)་ལོར་མཁན་ཆེན་བསམ་པ་ལྷུན་གྲུབ་དང་མཁན་སྤྲུལ་བསྟན་འཛིན་བཟང་པོ་རྣམ་གཉིས་ཀྱིས་ཞིབ་དཔྱད་བྱས་ཏེ་ཤིན་ཏུ་དག་པར་བཀོད་པ་ཡིན་ནོ། །
16. མུ་ར་དགོན་པའི་སྔོན་བྱོན་མཁས་གྲུབ། གོང་འོག་ཀུན་ཏུ་བསྟན་པའི་མུ་རའི་ས་ཕྱོགས་སུ་བྱོན་པའི་མཁས་གྲུབ་རྣམས་དང་། ༡༽མུ་ར་ཆོས་མཛད་ཐོགས་མེད། ༢༽མུ་ར་ཆོས་མཛད་སྐལ་བཟང་བཀྲ་ཤིས། ༣༽འདུག་དགེ་རི་ཁྲོད་པའི་སྐབས་ཀྱི་སྒར་བ་ཁག་བརྒྱད་ནི། ༡འདུག་དགེ་ཚང། ༢བྱ་བླ་ཚང། ༣ཚ་བླ་ཚང། ༤དཔའ་བླ་ཚང་། ༥རྫུ་བླ་ཚང་། ༦ཐུ་ཐུ་ཚང་། ༧མུ་ར་བླ་མ་ཚང་། ༨མུ་ར་སྔགས་པ་ཚང་ངོ་། །བྱང་སེམས་བརྒྱད་བརྩི་སྐབས། གཞི་ཆེན་མ་འདས་ཚང་གིས་མུ་ར་བསོད་ལི་ཀུན་ཏུ་བཟང་པོའི་སྤྲུལ་བ་ཡིན་གསུངས་སོ། །༤༽གྲུབ་ཆེན་ཀུར་ནག་གཉིས། གྲུབ་ཐོབ་ཀུ་ཀུ་རུ་པའི་སྤྲུལ་བ་མུ་ར་སྔགས་རྒན་དང་། གྲུབ་ཆེན་ནག་པོ་པའི་སྤྲུལ་བ་ཀཿཐོག་རིག་འཛིན་ཆེན་པོ་འཇིགས་མེད་རབ་བརྟན་ནོ།། ༥༽གཞི་ཆེན་སྐྱབས་མགོན་དབོན་སྤྲུལ། ༦༽ རྒྱ་ཅུན་གར་མཁན་པོ་མཁན་སྤྲུལ་སྐལ་བཟང་རྣམ་རྒྱལ། ༧༽མུ་ར་ཤ་སྤྲུལ་ལམ་ཡེ་ཤེས་སྤྲུལ་སྐུ་བློ་བཟང་དཀོན་མཆོག། ༨༽ མུ་ར་སྤྲུལ་སྐུ་བསྟན་པ་རྒྱ་མཚོ། ༩༽ རོང་ཐའི་ལྷ་རམས་སྤྲུལ་སྐུ། ༡༠༽མུ་ར་སྣ་ཐུབ་བསྟན་སོགས་བྱོན་པ་ཡིན་ནོ། །
༈ བསྟན་པ་ཡང་དར་སྐབས་འདིར་བསྟན་ལ་ཕྱག་རྗེས་ཆེ་བ་བཞི་ནི། མུ་ར་བླ་མ་བསོད་ལི། རྟ་ལོ་(1906)་ནས་(1982)་བར་དགུང་ལོ་༧༧་བཞུགས། མཚན་དངོས་བསོད་ནམས་རྒྱལ་མཚན་ཞུ། གཞི་སྤྲུལ་མ་འདས་རིན་པོ་ཆེའི་ཐུགས་ཟིན་གྱི་སྐྱེས་བུ་ཆེན་པོ་ཡིན། ལམ་བསླབ་གསུམ་ཉམས་སུ་བླང་། ཉེས་སྤྱོད་ཀྱིས་མ་གོས་པའི་བཙུན་པ། རིམ་གཉིས་ཀྱི་ཉམས་ལེན་ལྡན་པའི་གྲུབ་ཐོབ། ལུགས་གཉིས་ལ་མཁྱེན་དཔྱོད་ལྷ་ལམ་ལྟར་ཡངས་པའི་མཁས་དབང་ཞིག་ཡིན། རྒྱུན་དུ་སྒྲུབ་པ་ཉམས་ལེན་གཙོར་འདོན་མཛད་ཅིང་བསྙེན་གནས་རྒྱུན་དུ་བསྲུང་བ་སོགས་ཆོས་སྤྱོད་ཀྱིས་དུས་འདའ་ཞིང་། རུ་དགོན་གཉིས་ཀྱི་དབུ་འདྲེན་བརྩེ་གཟིགས་མཁན་གཅིག་པུ་ཡིན་པས་བཀའ་དྲིན་བརྗོད་ལས་འདས་སོ། །
༈ ཚ་སྤྲུལ་དགེ་ལེགས་ནི། སྤྱི་ལོ་(1941)་རབ་བྱུང་བཅུ་དྲུག་པའི་ལྕགས་སྦྲུལ་ལོར་ཡབ་སྔགས་པའི་ཡོན་ཏན་རྒྱ་མཚོ་དང་མ་མུ་ར་བཟའ་ཀླུ་སྐྱིད་གཉིས་ཀྱི་སྲས་སུ་འཁྲུངས། སྦྱང་བ་མ་འདས་དང་གཞི་ཆེན་མ་འདས་བློ་བཟང་དྲི་མེད་བསྟན་འཛིན་རྣམ་གཉིས་ཀྱིས་ངོས་འཛིན་མཛད་ནས། མཚན་བཤད་གྲུབ་དགེ་ལེགས་རབ་གསལ་དཔལ་བཟང་པོ་གསོལ། རང་དགོན་དུ་ཁྲི་འདོན་གཟབ་རྒྱས་བྱས། དགུང་གྲངས་བརྒྱད་ལོན་ཚེ་ཨ་ལག་དགོན་རིན་པོ་ཆེ་ལས་རབ་ཏུ་བྱུང་། མཁན་པོ་དགའ་གྲོལ་རིན་པོ་ཆེ་དང་བླ་མ་རིན་པོ་ཆེ་མཁྱེན་རབ་འོད་ཟེར་སོགས་མཉེས་པ་གསུམ་གྱིས་བསྟེན་ནས་ཐོག་མར་གླིང་སྤྲུལ་སྐྱབས་འགྲོ་སོགས་སྔོན་འགྲོའི་ཆོས་ཀྱི་དབུ་བཙུགས་ཏེ་འབུམ་ལྔ་བསགས་སྦྱངས་ཚད་ལྡན་བགྱིས།  སྤྱོད་འཇུག་ཆེན་མོའི་གཞུང་བཤད་གསན་བསམ་དང་འབྲེལ་རྩ་འགྲེལ་ཡོངས་རྫོགས་ཐུགས་འཛིན་གནང་ཞིང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཕྱོགས་མཐའ་ཡས་པ་སློབ་པར་མཛད། གཞི་སྤྲུལ་ཀུན་བཟང་ཉི་མ་ལས་བདུད་ཀློང་བྱང་གཏེར་གསུམ་གྱི་དབང་ལུང་རྫོགས་པར་གསན་ཅིང་རྩ་གསུམ་བསྙེན་སྒྲུབ་དང་འབྲེལ་བའི་བསྐྱེད་རྫོགས་ཉམས་བཞེས་གནང་། གཞན་སྐྱེས་ཆེན་དམ་པའི་མདུན་ནས་དབང་ཁྲིད་གདམས་ངག་གི་རིམ་པ་མང་དུ་ཞུས་ཤིང་ལམ་ལྷག་པའི་བསླབ་པ་གསུམ་གྱིས་ཐུགས་རྒྱུད་ལེགས་པར་གཏམ་པས་མིང་དོན་མཚུངས་པའི་བསྟན་འཛིན་གྱི་སྐྱེས་བུའི་མཛད་པ་གསལ། དགོན་སྡེའི་འདུ་ཁང་དུ་སྨན་འདམ་ལས་གྲུབ་པའི་སྒྲོལ་མའི་སྐུ་ཁྲ་རྒྱབ་ཡོལ་དང་བཅས་པ་སྟོང་དང་ལྔ་བརྒྱ་ཟངས་གསེར་གྱི་སྟོང་སྐུ་སྐྱེས་རབས་དགུ་ཐང་དང་མཆོད་རྫས་མང་པོ་བཞེངས་པས་མཚོན་འགྲོ་བའི་བསོད་ནམས་ཀྱི་གསོས་སུ་རྒྱལ་བའི་སྐུ་གསུང་ཐུགས་རྟེན་བྱིན་རླབས་ཀྱི་གཟི་འོད་མཆོག་ཏུ་འབར་བ་སྣ་ཚོགས་གསལ་བར་བྱས་པའོ། ལྷག་པར་མུ་རའི་རུ་དགོན་གཉིས་ལ་ཐུགས་ཁུར་ཆེ་བཞེས་ཀྱིས་རི་རྒྱ་ཀླུང་རྒྱ་སྡོམ་པ་སོགས་འཁོར་ཡུག་སྲུང་སྐྱོབ་ཀྱི་བྱ་བ། ཚེ་ཐར་ཆོས་སྦྱིན་བྱེད་པ་སོགས་ཡང་དག་དགེ་བསྐུལ་གྱི་མཛད་པ། དུ་ཆང་རྐུ་ཇག་གཅོད་པ་སོགས་ལས་ངན་སྡིག་སྤང་གི་མཛད་པ། ཁ་མཆུ་འཁྲུགས་རྩོད་བཟླུམ་པ་སོགས་སྤྱི་ཚོགས་བདེ་འཇག་གི་བྱ་བ་སོགས་ལྷོད་པ་མེད་པར་རྟག་ཏུ་འབད་སྒྲུབ་མཛད། དེ་ལྟར་བསྟན་འགྲོའི་དོན་རྒྱ་ཆེན་པོ་མཛད་ནས་དགུང་གྲངས་༥༩་སྤྱི་ལོ་(1999) ་ས་ཡོས་ལོར་དཔལ་ལྡན་བཀྲ་ཤིས་འཁྱིལ་དུ་ཕེབས་ཏེ་དགོངས་པ་ཆོས་དབྱིངས་སུ་བསྡུས་སོ། །  
༈ མུ་ར་སྤྲུལ་སྐུ་མཆོག་གམ་བསྟན་འཛིན་བཟང་པོ་ནི། ཡབ་མུ་རའི་གདུང་རིགས་བསོད་འཕན་གྱི་བུ་ཕུན་རྣམ་མམ་ཁ་སྐད་དུ་ཧུན་ནེ་ཟེར་བ་དང་ཡུམ་འཇུ་བཟའ་དུང་པོ་གཉིས་ཀྱི་སྲས་སུ་(1940)་ལྕགས་འབྲུག་ལོར་འཁྲུངས། དགུང་ལོ་བཅུ་དྲུག་ལ་བབ་ཚེ་གཞི་སྤྲུལ་ཀུན་བཟང་ཉི་མས་བདུད་ཀློང་བྱང་གསུམ་གྱིས་དབང་ལུང་སྐབས། བུ་འདི་བྱ་བླ་མ་འཇིགས་དར་ཀྱི་སྐྱེ་བ་ཡིན་ནམ། གང་ལྟར་ནམ་ཞིག་དགོན་གནས་འདི་ལ་ཕན་ཐོག་རེ་འབྱུང་། ཞེས་གསུངས་པ་ལྟར་སྡོམ་པ་གསུམ་གྱིས་ཐུགས་རྒྱུད་ཕྱུག རང་ལུགས་ཀཿཐོག་གཞི་ཆེན་པའི་ཆོ་ག་ཆོས་སྤྱོད་གདངས་དབྱངས་རོལ་མོ་སོགས་ཀྱི་སྲོག་མཐུད། དངོས་རྫས་ཡོད་ཚད་བསྟན་དགོན་གྱི་ཆེད་དུ་བཏང་།  བླ་མ་དགའ་གྲོལ་ཚང་། ཁམས་གཙང་གཏེར་སྟོན། གཞི་ཆེན་དབོན་སྤྲུལ་སོགས་ཀྱིས་ཐུགས་དགྱེས་པ་ཆེན་པོའི་རྗེས་སུ་བཟུང་། གསུང་ཟག་པ་མེད་པའི་ཡེ་ཤེས་ཀྱི་བདུད་རྩི་ཕངས་མེད་དུ་གནང་། དབང་ལུང་མན་ངག་གི་རིམ་པ་རྒྱ་ཆེན་པོ་ཐོབ། བརྒྱུད་པ་གསེར་གྱི་ཉག་ཐག་ལ་དམ་སེལ་གྱིས་གཡའ་ཡིས་མ་གོས་པར་སྙན་བརྒྱུད་ཆུ་བོ་གཅིག་འདྲེས་སུ་འཛིན་པའི་སྐྱེས་བུ་མཆོག་ཏུ་གྲུབ། མུ་ར་རུ་དགོན་གཉིས་ཀྱི་བསྟན་སྲིད་སྙིམ་པའི་མཐིལ་དུ་བཟུང་། མུ་ར་སྐྱ་སེར་གཉིས་དབང་ལུང་མན་ངག་གིས་བསྐྱངས། ཕྱོགས་གཞན་དང་མུ་ར་སྡེ་བ་སོགས་ཀྱི་ཁ་མཆུ་བཟླུམས། ཉེ་འཁོར་ཀུན་གྱི་རི་རྒྱ་དང་ཀླུང་རྒྱ་བསྡམས།  དཀའ་བ་བརྒྱ་ཕྲག་གི་སྒོ་ནས་མུ་རའི་བླ་མ་སྔོན་གཤེགས་རྣམས་ཀྱི་ཡང་སྤྲུལ་ཁྲི་ལ་བཀོད་པ་སོགས་རྣམ་པར་ཐར་བ་རྒྱས་པ་གཞན་དུ་ཤེས་པར་བྱའོ།།
༈ འཇུ་སྤྲུལ་ཐུབ་བསྟན་སྙན་གྲགས་ནི། (1950)་ལྕགས་སྟག་ལོར་འཁྲུངས། གཞི་སྤྲུལ་ཀུན་བཟང་ཉི་མས་བྱ་བླ་མ་སྦྱིན་པ་རྒྱ་མཚོའི་སྐྱེ་སྲིད་དུ་ངོས་འཛིན་མཛད། ཀུན་བཟང་འོད་གསལ་བསྟན་པའི་ཉི་མ་ཞེས་མཚན་གྱི་ཅོད་པན་གསོལ། བླ་མ་དགའ་གྲོལ་ཚང་། ཁམས་གཙང་གཏེར་སྟོན། གཞི་ཆེན་དབོན་སྤྲུལ། དོམ་ཚ་གཏེར་སྟོན་སོགས་བླ་མ་དུ་མའི་མདུན་ནས་དབང་ལུང་མན་ངག་གི་རིམ་པ་གསན་སྦྱང་མཛད། སྔགས་རྡོ་རྗེ་ཐེག་པའི་རིམ་གཉིས་ཀྱི་རྣལ་འབྱོར་ཆེན་པོ་གདུལ་བྱ་སེམས་ཅན་རྣམས་ལ་འདོད་མོས་ཀྱིས་བྱིན་རླབས་མཛད། ལྷག་བསམ་དག་པས་རུ་དགོན་སྤྱི་དོན་བསྒྲུབས། ཁམས་གཙང་གཏེར་སྟོན་དང་དཔལ་ཡུལ་ཀརྨ་ཆགས་མེད་ཀྱི་ཆོས་བདག་ཏུ་གྱུར། རྫོང་སྲིད་གྲོས་ཀྱི་ཚོགས་མི་དང་། མུ་ར་དགོན་པའི་དོ་དམ་པ་ཡུན་རིང་བྱས། ལུང་བསྟན་ལྟར་རྟེན་དཀར་ཆས་སུ་བསྒྱུར་བ་ནས་བཟུང་གཏེར་ཆོས་ཡང་ཅི་རིགས་པ་ཕབ། གཏད་མནན་འཕང་བསྲེག་སོགས་མངོན་སྤྱོད་ཀྱི་ལས་ལ་བྱང་ཆུབ། གཤིན་པོའི་འཕོ་འདེབས། གསོན་པོའི་ཞབས་རིམ་སོགས་སྤྱི་ཚོགས་ལ་སྨན་པའི་བྱ་བ་བདག་གིར་བཞེས་པའོ།། གཞན་ཡང་སྒར་བ་ཁག་བརྒྱད་ཀྱི་ཡང་སྤྲུལ་རྣམས་ཀྱང་བསྟན་འགྲོའི་དོན་ཆེན་སྒྲུབ་པའི་ཆེད་དུ་ཞབས་པད་བསྐལ་བའི་བར་ཏུ་བརྟན་པར་བཞུགས་སུ་གསོལ་ལོ། ། 
17. མུ་རའི་སྔགས་རབས་རིམ་བྱོན། མུ་ར་ལ་ཁྱིམ་ན་གནས་ཀྱང་རིམ་གཉིས་ཀྱི་རྣལ་འབྱོར་ལ་མངའ་དབང་འབྱོར་བའི་སྔགས་པ་མང་དུ་བྱོན་པ་ལས། མཚོན་ཙམ་སྨྲས་ན། མུ་ར་ནོ་ནོ་རྡོ་རྗེ་གྲགས་ལྡན་ནམ་སྣ་ནག་ཅེས་ཇག་ལྷ་མགོན་པོ་སྣ་ནག་གི་སྤྲུལ་བ། མུ་ར་རྡོ་རྗེ་བློ་འཆང་གི་རྣམ་ཐར་དུ་གསལ་བའི་མུ་ར་སྔགས་འཆང་ཆེན་མོ་ཁེན་ཐར་འབུམ་དང་། རྡོ་གྲུབ་རྒན་གྱི་རྣམ་ཐར་དུ་གསལ་བའི་མུ་ར་སྣ་ནག་གི་བུ་ཀླུ་རྒྱལ་འབུམ་དང་། ཀུན་མཁྱེན་སྐུ་ཕྲེང་བཞི་བའི་རྣམ་ཐར་དུ་གསལ་བའི་མུ་རའི་བན་རྒན་བསྟན་རྒྱས། མུ་ར་དགེ་རྒན་ཞེས་གཟའ་བདུད་རཱ་ཧུ་ལ་བྲན་ལྟར་རྒྱུ་བ་ཞིག་དང་། མུ་ར་བླ་མ་ཨོ་རྒྱན་མཐུ་སྟོབས་ཞེས་གཞི་ཆེན་བླ་སྤྲུལ་ཡོངས་ཀྱི་བླ་མར་གྱུར་པ་དང་།  མུ་ར་གུ་རུ་ཞེས་དཔལ་མགོན་པོ་ནག་པོ་འགྲུབ་ཅིང་ཐ་འོག་ཆོས་རྒྱལ་ཆེན་མོ་གྲོགས་ལྟར་འཁོར་བ། མུ་ར་ཨུར་མགོན་ཞེས་མགོན་པོའི་བསྙེན་པ་དུང་ཕྱུར་ལྗགས་ཐོག་ནས་གསུངས་པས་བསྙེན་སྒྲུབ་ཚད་དུ་འཁྱོལ་བ། མུ་ར་བསོད་འཕན་ཞེས་དཔལ་མགོན་ཚོགས་ཀྱི་བདག་པོ་དངོས་སུ་གྲུབ་པ། མུ་ར་དྷི་ར་ཆོས་དཔལ་རྡོ་རྗེ་ཞེས་མ་ཎི་དུང་ཕྱུར་མང་པོ་བཏོན་ཞིང་འཕགས་མཆོག་སྤྱན་རས་གཟིགས་ཀྱིས་ཞལ་གཟིགས་པ། མུ་ར་གཉུག་མ་འོད་གསལ་ཞེས་རྫོགས་པ་ཆེན་པོའི་དགོངས་པ་ཀློང་དུ་གྱུར་བ།  མུ་ར་བླ་མ་ཨུར་ཆོས་ཞེས་གཟའ་བདུད་རཱ་ཧུ་ལ་མི་བཞིན་འགྲོགས་པ། མུ་ར་སྔགས་རྒན་བསོད་ནམས་ཆོས་འཕེལ་ཞེས་དངོས་མེད་དངོས་པོར་བསྒྱུར་ནུས་པས་རྣམ་བཞིའི་འཕྲིན་ལས་ལ་རང་དབང་འབྱོར་བའི་མཐུ་སྟོབས་ནུས་པའི་བདག་ཉིད་ཆེན་པོ་རྩལ་ལྡན་ཁྱུང་ཆེན་ཁྱུ་ཚོགས་མཁའ་ལ་ལྡིང་བ་ལྟ་བུ་བར་མ་ཆད་པར་བྱོན་པ་ཡིན་ནོ། །
18. མུ་རའི་ཡུལ་གྱི་བུད་མེད་གྲགས་ཅན། བེ་རུ་སྲས་མོ། བེ་རུ་རྒྱལ་པོའི་མངའ་འབངས་ལབ་སྟོན་ནམ་མཁའ་རིན་ཆེན་གྱི་གདུང་བརྒྱུད་དུ་འཁྲུངས་པས་བེ་རུ་སྲས་མོར་གྲགས། སྐུ་ཚེ་སྟོད་དུ་སོག་པོའི་རྒྱལ་པོའི་བཙུན་མོ་བྱས། སྲས་མུ་ར་ནོ་ནོ་སོགས་འཁྲུངས། བསྭོ་ཐོག་རྒྱལ་བའི་དབེན་གནས་ཀྱི་བདག་པོ་མཛད། སྐུ་ཚེའི་སྨད་དུ་སྒྲུབ་པ་ཁོ་ན་མཛད་དེ་གྲུབ་པའི་གོ་འཕང་མཐོན་པོར་བསྙེགས། གཞན་ཡང་། མུ་ར་ཇོ་མོ་ཚེ་གཟུངས་སྐྱིད་དང། ཇུན་གར་མཁན་སྤྲུལ་གྱི་མ་ཡུམ་གདུགས་ཟ་ཞེས་ལོ། གཞི་ཆེན་དབོན་སྤྲུལ་རིན་པོ་ཆེའི་མ་ཡུམ་ཕྱོགས་སྐྱོང་བཟའ་མཁའ་འགྲོ་མཚོ་སོགས་ཞིང་སྔགས་ལྷན་སྐྱེས་ཀྱི་མཁའ་འགྲོ་མང་པོའི་འཕྲིན་ལས་ཀྱང་མུ་རའི་ཡུལ་དུ་སྤྲོས་པ་ཡིན་ནོ། །
19. མུ་ར་དགོན་པའི་ད་ལྟའི་ཤེས་ཡོན་པ། ༡༽ དགེ་བཤེས་ལྷ་རམས་པ་འདུག་དགེ་བསྟན་འཛིན་ཉི་མ། སྤྱི་ལོ་(1967)་རབ་བྱུང་བཅུ་བདུན་པའི་མེ་ཕོ་ལུག་གི་ལོའི་དགུན་ཟླ་ར་བའི་ཡར་ངོའི་ཚེས་༡༠་ལ་ཡབ་མུ་ར་ནོར་བསམ་དང་ཡུམ་སོག་བཟའ་རི་ཁྲོད་སྐྱིད་གཉིས་ཀྱི་སྲས་སུ་སྐུ་བལྟམས། ཁོང་སྐུ་ན་ཆུང་དུས་ནས་ཁུ་བོ་ཨ་ཁུ་ཁུ་ལོའམ་བླ་མ་འཇམ་དབྱངས་བསོད་ནམས་རྒྱལ་མཚན་དང་། ཁུ་བོ་མཁན་པོ་བསམ་པ་ལྷུན་གྲུབ་རྣམ་གཉིས་ཀྱི་མདུན་ནས་ཀློག་བསླབས་ཤིང་། སྔོན་འགྲོ་ཆོས་བཅུ་ནས་གསན་སྦྱང་མཛད།  ཁམས་གཙང་གཏེར་ཆེན་གར་དབང་འགྲོ་འདུལ་གླིང་པའི་གཏེར་ལུང་དུ། རང་གནས་དབེན་ཚལ་བསམ་གཏན་ཆོས་གླིང་དུ། །འཕགས་པའི་ཐུགས་རྗེ་ཀུན་ཁྱབ་བསིལ་ཟེར་ལས། །མ་ཎིའི་ཐབས་དང་གནས་མིང་ཤེས་རབ་མིང་། །འཕགས་པའི་བྱིན་རླབས་ཐུགས་སྤྲུལ་ནིརྨ་ཀཱ། །བསྟན་པའི་གསལ་བྱེད་སུརྱའི་མིང་འཛིན་པའི། །ཚུལ་ཁྲིམས་མེ་ཏོག་རྣམ་མཛེས་བཀྲ་ལེགས་ཤིང་། །ཤེས་རབ་གསུམ་གྱི་ལང་ཚོའི་རྒྱན་འཆང་ནས། །བསམ་གཏན་ཆོས་གླིང་རྒྱལ་བསྟན་གོང་འཕེལ་རྒྱས།། ཞེས་སོགས་འཕགས་པ་སྤྱན་རས་གཟིགས་ཀྱི་བཀའ་ལུང་གིས་བསྔགས་བརྗོད་མཛད། དགུང་ལོ་བཅུ་གསུམ་པའི་སྟེང་བླ་བྲང་བཀྲ་ཤིས་འཁྱིལ་གྱི་མཁས་པའི་གཙུག་རྒྱན་ལ་མོའི་དགེ་འདུན་རྒྱ་མཚོའི་མདུན་ནས་དགེ་ཚུལ་གྱི་སྡོམ་པ་བཞེས་ཏེ་ལམ་བསླབ་པ་གསུམ་ཉམས་སུ་བླངས། སྤྱི་ལོ་(1987)་མེ་ཡོས་ལོར་དཔལ་ལྡན་འབྲས་སྤུངས་སྒོ་མང་གྲྭ་ཚང་དུ་ཕེབས། སྤྱི་ལོ་(1987)་ལོའི་ས་ག་ཟླ་བར་ཆོས་ཞུགས་དང་འབྲེལ་བླ་མ་ཁྲི་སྟོན་མཛད་སྒོ་སྤེལ། སྒོ་མང་མཁན་ཐོག་དོན་དགུ་པ་ཡོན་ཏན་དམ་ཆོས་མཆོག་དང། གཞི་ཆེན་དབོན་སྤྲུལ་རིན་པོ་ཆེ། སྒོ་མང་མཁན་ཟུར་ངག་དབང་ཉི་མ་སོགས་བསྟེན་ཏེ་བསྡུས་གྲྭ་ནས་བཟུང་གཞུང་ཆེན་བཀའ་པོད་ལྔ་ལ་ཐུགས་གཉེར་རྡོ་རུས་ཐུག་པ་གནང་། ལོ་ལྔའི་རིང་ཕར་ཕྱིན་གྱི་གཞུང་ཆེན་ཁག་ལ་སློབ་གཉེར་གནང་ཞིང་། སྒོ་མང་གྲྭ་ཚང་དུ་བྱམས་གཞུང་མཚན་འཕུད་དམ་བཅའ་དང། འབྲས་སྤུངས་ཚོགས་ཆེན་དུ་དགེ་འདུན་ཉི་ཤུ་དང་ཕར་ཕྱིན་སྐབས་བཞི་པའི་ཚོགས་ལངས་མཛད་པ་སོགས་ཐུགས་གཉེར་ཚུལ་བཞིན་གནང་སྟེ། སྤྱི་ལོ་(1995)་ཤིང་ཕག་ལོར་ཕར་ཕྱིན་དམ་བཅའ་མཛད་ནས། གནས་རིམ་དང་པོའི་ཕར་ཕྱིན་རབ་འབྱམས་པའི་མཚན་བཏགས་བཞེས། མུ་མཐུད་སྒོ་མང་གྲྭ་ཚང་གི་ཕྱག་སྲོལ་བཞིན་དབུ་མ་དང་། མཛོད། འདུལ་བ་བཅས་གཞུང་ཆེན་སློབ་གཉེར་དཔྱིས་ཕྱིན་པར་མཛད། སྤྱི་ལོ་(1997)་ལོ་འཛིན་གྲྭ་དབུ་མ་གསར་པར་ཕེབས་སྐབས་ཁོང་རིན་པོ་ཆེའི་མདུན་ནས་བསྙེན་རྫོགས་བཞེས། སྤྱི་ལོ་(2002)་རབ་བྱུང་བཅུ་བདུན་པའི་ཆུ་རྟ་ལོའི་ལྷ་ལྡན་སྨོན་ལམ་ཆེན་མོར་གྲྭ་སྐོར་དམ་བཅའ་དང་འབྲེལ་དགེ་བཤེས་ལྷ་རམས་པའི་མཚན་བཏགས་བཞེས། ཁོང་རིན་པོ་ཆེའི་མདུན་ནས་ལམ་རིམ་ཁྲིད་ཆེན་བཅོ་བརྒྱད་ཀྱིས་མཚོན་མདོ་ཕྱོགས་ཀྱི་ཆོས་སྐོར་མང་པོ་དང་། སྔགས་རིམ་ཆེན་མོ་དང་རིམ་ལྔ་གསལ་སྒྲོན་གྱིས་མཚོན་སྔགས་ཕྱོགས་ཀྱི་ཆོས་སྐོར་མང་པོའི་གསུང་གི་བདུད་རྩི་རྒྱ་ཆེར་བཞེས། ཁོང་རིན་པོ་ཆེའི་ཀློང་ཆེན་མཛོད་བདུན་དང་རྡོ་གྲུབ་འཇིགས་མེད་བསྟན་པའི་ཉི་མའི་གསུང་འབུམ་གྱི་ཕྱག་དཔེ་གནང་ནས་ཁྱོད་ཀྱི་དགོན་པ་རྙིང་མ་ཡིན་པས་འཁྲུལ་ཞིག་རིན་པོ་ཆེའི་མདུན་ནས་དབང་ལུང་མན་ངག་སོགས་ཞུས་ན་ལེགས་ཞེས་གསུངས་པ་ལྟར། འཁྲུལ་ཞིག་རིན་པོ་ཆེའི་མདུན་ནས་མཛོད་བདུན་གྱི་བཤད་ལུང་དང་། འདོད་འཇོའི་བུམ་བཟང། གདམས་ངག་མཛོད། སྙིང་ཐིག་རྩ་པོད་སོགས་དབང་ལུང་མན་ངག་མང་པོ་དང་། ཀཿཐོག་རྨོག་ཚ་རིན་པོ་ཆེའི་མདུན་ནས་རྙིང་མ་བཀའ་མ་དང་། རིན་ཆེན་གཏེར་མཛོད། བདུད་ཀློང་གཉིས་སོགས་དབང་ལུང་མན་ངག་མང་དུ་མནོས། གཞི་ཆེན་བཻ་རོ་རིན་པོ་ཆེའི་མདུན་ནས་བདུད་ཀློང་གཉིས་ཀྱི་དབང་གི་ཆོས་སྐོར་ཁ་ཤས་དང་། སྙིང་ཐིག་སྔོན་འགྲོ་ཀུན་བཟང་བླ་མའི་ཞལ་ལུང། ཀློང་གསལ་སྔོན་འགྲོའི་ཁྲིད་ལུང་སོགས་མནོས། དིལ་མགོ་མཁྱེན་བརྩེ་དང་གྲུབ་དབང་པདྨ་ནོར་བུ་ལས་ཀྱང་གསང་ཆེན་སྔགས་ཀྱི་གདམས་པ་མང་དུ་ཞུས། སྐྱབས་རྗེ་གཞི་ཆེན་རབ་འབྱམས་རིན་པོ་ཆེ་ལས་ཀུན་མཁྱེན་འཇིགས་མེད་གླིང་པའི་གསུང་འབུམ་དང་། དཔལ་སྤྲུལ་རིན་པོ་ཆེའི་གསུང་འབུམ་གྱི་ལྗགས་ལུང་། སྙིང་ཐིག་སྐོར་གྱི་དབང་དུ་མ་གསན། བདུད་འཇོམས་གདུང་སྲས་འཕྲིན་ལས་ནོར་བུ་ལས་བདུད་འཇོམས་ཆོས་སྐོར་གྱི་རྩ་གསུམ་དབང་ལུང་དུ་མ་དང་། མན་ངག་གི་སྐོར་དུ་མ་གསན། ལྡན་མ་བློ་ཆོས་རིན་པོ་ཆེ་ལས་མི་ཏྲ་བརྒྱ་རྩའི་དབང་ཆེན་གསན། ཀཿཐོག་མཁན་རྒན་བསོད་ནམས་བསྟན་པའི་མདུན་ནས་ཀཿཐོག་སྔོན་འགྲོ་དང་དངོས་གཞིའི་ཆོས་སྐོར་གྱི་མན་ངག་ཟབ་མོའི་བཀའ་ཁྲིད་ཞུས་པས་མཚོན། མདོར་ན་གསར་རྙིང་རིས་སུ་མ་མཆིས་པའི་ཆོས་རྒྱུན་མཐའ་ཡས་པ་གསན་བསམ་མཐིལ་ཕྱིན་པ་མཛད། གཞི་ཆེན་རྒྱས་སྲས་ཉི་ཟླ་བཟང་པོའི་སྤྲུལ་སྐུ་བཀྲ་རྒྱལ་རིན་པོ་ཆེས་ཀཿཐོག་ཚེས་བཅུ་ཆེན་མོའི་སྤྱི་པ་གནང་སྟེ། གཞི་ཆེན་དགོན་ཁག་གི་བླ་སྤྲུལ་རྣམས་སྔ་འགྱུར་རྙིང་མའི་གདན་ས་ཆེན་མོ་ཀཿཐོག་རྡོ་རྗེ་གདན་དུ་ཚེས་བཅུ་ཆེན་མོར་ཞལ་འཛོམས་སྐབས། ཀཿཐོག་གསེར་ཁྲིའི་བདག་པོ་སྐྱབས་རྗེ་དྲི་མེད་ཞིང་སྐྱོང་རིན་པོ་ཆེ་དང་། སྐྱབས་རྗེ་རྨོག་ཚ་རིན་པོ་ཆེ། ཀཿཐོག་མཁན་ཆེན་ངག་ཆུང་གི་ཡང་སྤྲུལ་སངས་རྒྱས་ཚེ་རིང་རིན་པོ་ཆེ། སྤྲུལ་སྐུ་འཇམ་དབྱངས་རིན་པོ་ཆེ། སྤྲུལ་སྐུ་བློ་དགའ་རིན་པོ་ཆེ་བཅས་ནས་བཀའ་བགྲོས་གནང་ཐོག་ཀཿཐོག་ཆོས་བརྒྱུད་ཀྱི་ཁྲོད་ནས་རི་བོ་དགེ་ལུགས་པའི་གདན་ས་ཆེན་པོ་དཔལ་ལྡན་འབྲས་དཀར་སྤུངས་པའི་ཆོས་སྡེ་ཆེན་པོར་ཕེབས་ནས་གཞུང་ཆེན་བཀའ་པོད་ལྔ་ལ་སློབ་གཉེར་མཐར་ཕྱིན་ཏེ་དགེ་བཤེས་ལྷ་རམས་པའི་མཚན་བཏགས་བཞེས་པའི་ཆེ་བསྟོད་དུ་སྐུ་གསུང་ཐུགས་རྟེན་དང་། གསང་སྔགས་ཀྱི་མཆོད་ཆས་ཆ་ཚང་། རལ་གྲི་དང་། པཎྜི་ཏའི་དབུ་ཞྭ། རབ་བྱུང་གི་ན་བཟའ་ཆ་ཚང་། བདོག་པ་གྱ་ནོམ་པའི་སྐྱེས་དང་ཆབས་ཅིག་པཎྜི་ཏའི་མཚན་གནས་སྩལ། ཁོང་མཁས་བཙུན་ཡོན་ཏན་གྱི་ཆེ་བ་མངོན་པར་གསལ་བས་འཛམ་གླིང་ཡུལ་གྲུ་དུ་མར་བསྟན་པ་རིན་པོ་ཆེ་སྤེལ་བཞིན་འཚོ་ཞིང་གཞེས་པའི་སྐབས་ལགས་སོ། །
༢༽སློབ་དཔོན་ཆེན་མོ་ཀཿཐོག་རིག་འཛིན་པདྨ་དབང་ཆེན་ནི། རང་དགོན་དང་སྐྱེས་ཆེན་དམ་པ་བརྒྱ་ལ་ཉེ་བའི་མདུན་ནས་མན་ངག་ཞུས། ཐེ་ཝན་དགེ་འོས་སློབ་གྲྭ་ཆེན་མོ་ནས་སློབ་སྦྱོང་བྱས། ཨོ་སི་ཀྲི་ལི་ཡའི་རྒྱལ་ཁབ་ཀྱི་བྷ་ལ་སི་སློབ་གྲྭ་ཆེན་མོའི་སྤྱི་ཚོགས་མཚན་ཉིད་རིག་པའི་སློབ་ཆེན་མཐར་ཕྱིན་གྱི་ཕྱག་ཁྱེར་བཞེས། གྲགས་ཅན་གྱི་སློབ་གྲྭ་ཆེན་མོ་དུ་མའི་གདན་ཞུས་དགེ་རྒན་གནང་། རྟེན་གསུམ་བཞེངས་པ་དང་བསྟན་དགོན་འཛུགས་པ་སོགས་ལ་ཕྱག་རྗེས་དུ་མ་བཞག གསུང་རྩོམ་གླེགས་བམ་དུ་གྱུར་པ་པོད་བཅུ་དྲུག་དང་། རྩོམ་འཕྲོར་གྱུར་པ་པོད་བཅུ་གྲངས་ཤིག་མཆིས་སོ། །
༣༽ཨ་སྐྱོང་གདུང་སྲས་དོན་ལེགས། རང་དགོན་ནས་ཚོགས་ཞུགས་གནང་། བླ་རུང་དང་སེར་ཤུལ་ནས་སློབ་གཉེར་གནང་། རྡོ་གཡུ་ཐོག་དགོན་པའི་བསྟན་བདག་གི་གྲས་དང་མུ་ར་དགོན་པའི་རྒྱལ་ཚབ་ཡིན། 
༤༽ནག་ཁེ་ཚང་བློ་བཟང་བསྟན་པའི་ཉི་མ། རང་དགོན་ནས་ཚོགས་ཞུགས་བྱས། བླ་རུང་དུ་སློབ་གཉེར་གནང་། ཨ་འདུས་ཡག་མགོ་དགོན་པའི་ཁྲི་བ་ཡིན།
༥༽དཀོན་མཆོག་རྒྱལ་མཚན། རང་དགོན་དང་ལུང་དཀར་དགོན། དབུས་ཀྱི་སེ་ར་དགོན། རོང་བོ་དགོན་ཆེན་སོགས་ནས་སློབ་གཉེར་གནང་། མུ་ར་དགོན་པའི་རྒྱལ་ཚབ་ཡིན། གསུང་རྩོམ་པོད་ཁ་ཤས་བཞུགས་སོ། །
༦༽རྒྱ་ཤོད་ཚུལ་ཁྲིམས་སངས་རྒྱས། རང་དགོན་ནས་ཚོགས་ཞུགས་བྱས། འབྲས་སྤུངས་སྒོ་མང་གྲྭ་ཚང་ནས་སློབ་གཉེར་གནང་། ཕར་ཕྱིན་རབ་འབྱམས་པའི་མཚན་བཏགས་བཞེས། བྱེས་ཀཿཐོག་དགོན་གྱི་དབུ་འཛིན་ཡིན།
༧༽དགེ་བཤེས་རྡོ་རམ་པ་འཇམ་དབྱངས་བསོད་ནམས། རང་དགོན་སློབ་གཉེར་གནང་། དཔལ་ལྡན་བཀྲ་ཤིས་འཁྱིལ་ནས་སློབ་སྦྱོང་ཕུལ་བྱུང་གིས་དགེ་བཤེས་རྡོ་རམས་པའི་མཚན་ཐོབ་བཞེས།
༨༽དགེ་བཤེས་དཀའ་བཅུ་པ་མཁྱེན་རབ་རྒྱ་མཚོ། རང་དགོན་ནས་ཚོགས་ཞུགས་བྱས། ཀན་སུ་ནང་བསྟན་སློབ་གྲྭ་ནས་མཐར་ཕྱིན། འབྲས་སྤུངས་སྒོ་མང་གྲྭ་ཚང་ནས་དགེ་བཤེས་དཀའ་བཅུ་པའི་མཚན་བཏགས་བླང་།
༩༽ བླ་རུང་མཁན་པོ་མུ་ར་ཀུན་བཟང་། བླ་རུང་སྒར་དང་རང་དགོན་དུ་མཁན་ཐོབ་བཞེས། དེང་དུས་བླ་རུང་ཆོས་སྒར་དུ་མདོ་སྔགས་རིག་གནས་དང་བཅས་པར་ངེས་པ་དོན་གྱི་མཁས་པའི་ཡང་རྩེའི་གྲས་སུ་གྱུར་ཅིང་། རྒྱུན་མ་ཆད་པར་དཔེ་ཁྲིད་གནང་བཞིན་པ་དང་། རང་དགོན་དུའང་དུས་དུས་སུ་ཕེབས་ཏེ་དཔེ་ཁྲིད་དང་། བླ་རུང་གི་སློབ་སྟོན་གཞོན་པ་དང་རང་དགོན་ནས་བཤད་གྲྭའི་སློབ་སྟོན་ཀྱི་ཐུགས་འགན་བཞེས་པ་སོགས་མཛད་རྗེས་འགྲན་ཟླ་བྲལ།  གསུང་རྩོམ་པོད་བཞི་བཞུགས་སོ། །
༡༠༽མུ་ར་མཁན་པོ་གནས་ཁོ། རང་དགོན་དང་བླ་རུང་ཆོས་ཀྱི་གྲོང་ཁྱེར་ནས་སློབ་གཉེར་གནང་། མུ་ར་དགོན་ནས་མཁན་པོའི་མཚན་བཏགས་སྩལ།
༡༡༽མུ་ར་ལྷ་རྗེ་ཐུབ་བསྟན་འོད་ཟེར། རང་དགོན་དང་དཔལ་ལྡན་བཀྲ་ཤིས་འཁྱིལ་ནས་སློབ་གཉེར་གནང་། སྨན་རྩིས་སྒྲ་ཚད་ཡོངས་ལ་སྦྱང་བ་ཕུལ་དུ་ཕྱིན།
༡༢༽རབ་འབྱམས་པ་བྱང་པེ་འམ་འཇིགས་མེད།  རང་དགོན་དང་། འབྲས་སྤུངས་སྒོ་མང་གྲྭ་ཚང་ནས་སློབ་གཉེར་གནང་། ཕར་ཕྱིན་རབ་འབྱམས་པའི་མཚན་བཏགས་བླངས། ད་ལྟ་ཀྲུང་གོའི་བོད་བརྒྱུད་མཐོ་རིམ་སློབ་གླིང་དུ་སློབ་གཉེར་མཛད་བཞིན་པའོ། །
༡༣༽ རབས་འབྱམས་པ་སངས་རྒྱས་མཚོ། དབུས་ཀྱི་སེ་ར་ཐེག་ཆེན་གླིང་དང་རེབ་གོང་རོང་བོ་དཔལ་གྱི་དགོན་ཆེན་ནས་སློབ་གཉེར་གནང་། ཕར་ཕྱིན་རབ་འབྱམས་པའི་མཚན་བཏགས་བླངས། ད་དུང་ཆོས་སྡེ་ཆེན་པོ་དེར་གཞུང་ཆེན་ལྷག་མ་དབུ་ཚད་མཛོད་འདུལ་སྔགས་དང་བཅས་པར་སྦྱོང་དང་སྦྱང་མུས་སུ་མཆིས་པ་ལགས་སོ།།
20. རི་ཁྲོད་སྒྲུབ་སྡེ་ཁག་གི་ལོ་རྒྱུས་ནི། སྒྲུབ་པ་ཉམས་བཞེས་གནང་སའི་རི་ཁྲོད་དང་སྒོམ་ཁང་གི་ཚུལ་དུ་ཡོད་པ། སྒྲུབ་པ་བྱེད་མཁན་ཡོད་ཚེ་ཆོས་དང་ཟང་ཟིང་གིས་མཐུན་རྐྱེན་སྦྱོར་བ་དང་། ཕྱོགས་གྲྭ་སུ་ཡིན་ཡང་དགོན་པར་སླེབས་ནས་བཞུགས་རིང་སྒྲིག་འོག་ཏུ་གནས་དགོས་པ་ཡིན་ནོ། །
༄། །ཆོས་ལུང་རི་ཁྲོད། ༡༽མཚན། དཀར་པོའི་ཆོས་ལུང་མཐོན་པོ། བདེ་མཆོག་ནོར་བུའི་ཕོ་བྲང་།
ཕྱི་ལོའི་དུས་རབས་བརྒྱད་པ་ནས་དབུ་བརྙེས། ཕྱི་ལོ་(1672)་སྐོར་ནས་སྒྲུབ་ཁང་ཡོད།
༢༽ཁྱད་ཆོས། ཐུགས་རྗེ་ཆེན་པོ་དང་། བདེ་མཆོག སྒྲུབ་པ་བཀའ་བརྒྱད་ཀྱི་གནས་ཡིན། གུ་རུ་རིན་པོ་ཆེ་དང་མཁའ་འགྲོ་ཡེ་ཤེས་མཚོ་རྒྱལ་བཞུགས་མྱོང་། རང་བྱོན་མང་། སྨན་སྣ་ཕྱུག གཟིགས་སྣང་སྣ་ཚོགས་འབྱུང་། བཅུད་ལེན་འགྲུབ། གནས་འདི་ནས་མཁའ་སྤྱོད་ཞིང་དུ་ཐོད་རྒལ་དུ་འཇུག་པའི་སྒོ་གཅིག་ཡིན་པར་གྲགས། །
༣༽གནས་སྐོར། སྤྲེལ་ལོའམ། དུས་ཚོད་ནམ་བྱུང་ལ་གནས་སྐོར་བྱེད་ཆོག ཐུགས་རྗེ་ཆེན་པོ། བཀའ་བརྒྱད། ཡང་དག བདེ་མཆོག མཁའ་སྤྱོད་མའི་བསྙེན་པ་དང་ཚོགས་མཆོད་བྱེད་སྲོལ་ཡོད། ཕེབས་མཁན་ཡོངས་ཀྱིས་དད་མོས་དག་སྣང་རྩེ་གཅིག་བྱས་ན་བྱིན་རླབས་འབྱུང་བར་ཐེ་ཚོམ་མེད་དོ། ། བྱ་བ་ལམ་འགྲོ། ལུས་པོ་བདེ་ཐང་། ཆོས་བྱ་ཀེག་མེད་དུ་འགྲུབ་པར་འགྱུར་རོ། །གུ་རུ་རིན་པོ་ཆེའི་མཁའ་འགྲོ་གསང་བའི་གནད་ཏིག་ལས། འདི་མཐོང་རྐྱེན་ངན་བར་ཆད་སེལ༔ འདིར་བསྒྲུབ་དངོས་སྒྲུབ་ཅི་འདོད་ཐོབ༔ དད་ལྡན་ཐར་ལམ་འཇུག་པའི་གནས༔ སྐལ་བཟང་བག་ཆགས་སད་པའི་གནས༔ དགེ་སྦྱོང་བསམ་གཏན་འགྲུབ་པའི་གནས༔ རྣལ་འབྱོར་གསང་སྤྱོད་བྱེད་པའི་གནས༔ རིག་འཛིན་གཤེགས་ཤུལ་ཟིན་པའི་གནས༔ ཚེ་གཅིག་སངས་འགྲུབ་པའི་གནས༔ ཞེས་དང་། གཞི་ཆེན་ཀུན་བཟང་ཉི་མས། །སྒྲུབ་པ་ལ་བརྩོན་ན་དངོས་གྲུབ་ཐོབ། །ཉམས་རྟོགས་པ་ཡར་ངོའི་ཟླ་ལྟར་འཕེལ། །ཕྱག་བསྐོར་བར་བརྩོན་ན་སྡིག་པ་འདག །གནས་འབྲེལ་གྱིས་རིག་འཛིན་ཞིང་དུ་འདྲེན། །ཚོགས་མཆོད་ཀྱིས་བསོད་ནམས་ཚོགས་ཆེན་རྫོགས། །གནས་གཞན་དུ་ཟླ་གཅིག་སྒྲུབ་པ་བས། །གནས་འདི་རུ་ཞག་གཅིག་སྒྲུབ་པ་མྱུར། །ཞེས་གསུངས་སོ། །
༤༽འཛེམ་བྱ། དུས་མིན་དུ་རི་རྩེར་འཛེགས་མི་རུང་། ལབ་རྩེ་དང་བསང་ཁྲི་ལ་རེག་མི་ཉན། སྐྲ་སེན་བྲེག་པ་གནས་འདིར་བསྐྱུར་མི་ཆོག བཀྲ་མི་ཤིས་པའི་ཚིག་མི་བརྗོད། རང་བྱོན་དང་ལྷ་སྐུ་ལ་གུས་པ་བྱེད་དགོས། འདུས་སྡེས་མ་གནང་བར་ས་རྡོ་གཞན་དུ་ཁུར་མི་ཆོག །
༥༽ལུང་བསྟན། ། མཁའ་འགྲོ་གསང་བའི་གནད་ཏིག་ལས། ཨོ་རྒྱན་ཆེན་པོས་བྱིན་རླབས་པའི༔ མདོ་སྨད་གནས་ཆེན་ཉེར་ལྔའི་གཙོ༔ སེང་གེ་འགྱིང་བ་ཤེལ་གྱི་རི༔ ཤར་ཕྱོགས་རྡོ་རྗེ་སེམས་དཔའི་གནས༔ ལྷོ་ན་འཇམ་དཔལ་སྐུ་ཡི་ལུང་༔ ནུབ་ན་རྟ་མགྲིན་དབང་གི་ཕུག༔  བྱང་ན་དྲེག་འདུལ་གཏུམ་པོའི་རི༔ ཕྱོགས་མཚམས་སྒྲུབ་པ་བཀའ་བརྒྱད་དང་༔ འདབས་ན་ཆོས་སྲུང་ནོར་ལྷའི་གནས༔ གུ་རུ་པདྨ་རྗེ་འབངས་ཀྱིས༔ བྱིན་རླབས་སྤྲུལ་བའི་གནས་ཆེན་འདུས༔  འགྲོ་བའི་དོན་དུ་གཏེར་མང་བཞུགས༔ རྨ་ཡུལ་ཆོས་ལུང་ཆོས་ཀྱི་ཞིང༌༔ ཨོ་རྒྱན་ཡུལ་དང་ཁྱད་པར་མེད༔ གནས་འབྲེལ་ཐོབ་ཚད་སྐལ་ལྡན་འགྱུར༔ སྒྲུབ་པ་བྱས་ན་སྨོས་ཅི་དགོས༔ ཕྱི་ལྟར་སྤྱན་རས་གཟིགས་ཀྱི་ཞིང༌༔ ནང་ལྟར་འཁོར་ལོ་བདེ་མཆོག་གནས༔ གསང་བ་ཡང་དག་ཐུགས་ཀྱི་དལ༔ ཡང་གསང་རྡོ་རྗེ་བཙུན་མོའི་མཁའ༔ ཞེས་སོ། །
༦༽ལོ་རྒྱུས། དུས་རབས་བརྒྱད་པར་གུ་རུ་རིན་པོ་ཆེ་དང་མཁའ་འགྲོ་ཡེ་ཤེས་མཚོ་རྒྱལ་འདིར་ཕེབས་ནས་བསྒྲུབ་པ་བྱས། རྡོ་གྲུབ་ཆེན་གྱི་ལུང་བསྟན་དུ། དཔལ་བདེ་མཆོག་གནས་ཀྱི་ཉེ་འགྲམ་དུ། །རྗེ་འཕགས་མཆོག་ཕྱག་ན་པདྨོ་དང༌། །ཉེ་སྲས་བརྒྱད་བཤེས་གཉེན་ཚུལ་བཟུང་ནས། །མདོ་སྔགས་ཀྱི་དར་ཆེན་དགུང་ལ་ཕྱར། །ཅེས་དང༌། སྒེའུ་གཏེར་བདུད་འཇོམས་གླིང་པས། དཔལ་ཡང་དག་གནས་མཆོག་ཆོས་ལུང་ལ། །མགོན་པདྨ་ཡབ་ཡུམ་བྱིན་རླབས་མཛད། །ཆོས་ནོར་གྱི་གཏེར་ཁ་མང་དུ་བཞུགས། །གནས་དེ་རུ་བསྒྲུབ་ན་དངོས་གྱུར་མྱུར། །ཞེས་སོ།
ཕྱི་ལོ་(1672)་ཡས་མས་སུ་མུ་ར་དགེ་རྒན་ཀུན་དགའ་ཕུན་ཚོགས་གནས་འདིར་ཕེབས་ནས་བསྒྲུབ་པ་བྱས།  
(1709)་ས་གླང་ལོར་ཀུན་མཁྱེན་འཇམ་དབྱངས་བཞད་པ་མདོ་སྨད་དུ་ཞལ་བསྒྱུར་སྐབས་དཔའ་མཁར་བསྟད། 
(1789)་ལོར་གཞི་ཆེན་སྐྱབས་མགོན་བསོད་ནམས་དཔལ་ལྡན་ཕེབས་ནས་གནས་གཟིགས་གནང་།
(1771)་རྡོ་གྲུབ་རྒན་དགུང་ལོ་ཉེར་ལྔའི་སྟེང་ལོ་གསུམ་བར་སྐུ་མཚམས་བཞུགས་ནས་འཕགས་པ་ཐུགས་རྗེ་ཆེན་སོགས་ཡི་དམ་རྒྱ་མཚོའི་ཞལ་གཟིགས། 
(1850)་ཡས་མས་སུ་ཕྱོགས་སྐྱོང་དགེ་བཤེས་བཞུགས་ནས་གནས་བསྟོད་མཛད། 
(1860)་སྐོར་རྒྱ་ཚང་རི་ཁྲོད་པ་ཆོས་ཀྱི་སེངྒེ་མཆོག་གནས་འདི་ནས་རིགས་སད། དག་སྣང་དུ་མཁའ་སྤྱོད་མའི་དཀྱིལ་འཁོར་དུ་གཟིགས་ཤིང་མཁའ་འགྲོའི་ཚོགས་གྲྭལ་དུ་ཕེབས། །
(1867)་མེ་ཡོས་ལོར་ཀིརྟི་བློ་བཟང་འཕྲིན་ལས་ཕེབས་ཤིང་གསོལ་མཆོད་མཛད།
(1955)་གཞི་ཆེན་ཀུན་བཟང་ཉི་མས་གནས་བསྟོད་མཛད། མཁའ་སྤྱོད་མའི་ཞལ་གཟིགས།
(2006)་མེ་ཁྱི་ལོར། ཡ་ཆེན་གྲུབ་དབང་ཨ་ཆུག་རིན་པོ་ཆེས་གནས་འདི་ཕྱི་ལྟར་ན་རིགས་གསུམ་མགོན་པོ། ནང་ལྟར་ན་བདེ་མཆོག་འཁོར་ལོ། གསང་བ་ལྟར་ན་སྒྲུབ་པ་བཀའ་བརྒྱད་ཀྱི་གནས་སུ་ངོས་འཛིན་གནང་། གནས་ཞལ་གསར་དུ་ཕྱེས་སོ། །
མངའ་བདག་ཉང་གི་བརྒྱུད་འཛིན་གཞི་ཆེན་ཚང་བླ་མ་ཕལ་མོ་ཆེ་གནས་འདིར་ཕེབས་ཤིང་བསྒྲུབ་པ་མཛད། ཇོ་ནང་སྦྱང་བ་མ་འདས། ཨ་མཆོག་མཁྱེན་རབ་རྒྱ་མཚོ། ༧ གྲུབ་ཐོབ་ཆེན་པོ་ཨ་ཁུ་ཐུ་ཐུ། བདུད་འཇོམས་གདུང་སྲས་རྡོ་རྗེ་དགྲ་འདུལ། ཇུན་དཀར་མཁན་པོ་སོགས་ཀྱིས་བསྒྲུབ་པ་མཛད། ཨ་སྐྱེས་མཁའ་སྤྱོད་གླིང་པ། མདོ་རིན་པོ་ཆེ་ཟིལ་གནོན་དགྱེས་པ་རྡོ་རྗེ། བདུད་འཇོམས་ཚ་བུ་བསོད་ནམས་ལྡེའུ་བཙན་སོགས་ཀྱིས་གཏེར་བཞེས། རང་ཡུལ་གྱི་བླ་སྤྲུལ་ཕལ་ཆེ་བ་གནས་འདིར་ཕེབས་ནས་བསྒྲུབ་པ་མཛད་པའོ། །  
༄། །འདུག་དགེའི་རི་ཁྲོད། ༡༽མཚན། འདུག་དགེའི་རི་ཁྲོད། ཤར་ཐུབ་བསྟན་འཕེལ་རྒྱས་གླིང་།
(1885) ཤིང་བྱ་ལོར་རི་ཁྲོད་དབུ་བརྙེས།
༢༽ཁྱད་ཆོས། ༧ སྐྱབས་མཆོག་འདུག་དགེ་རི་ཁྲོད་པ་བློ་བཟང་རབ་རྒྱས་སྐུ་ཚེ་དེ་ཉིད་དུ་སྒྲུབ་པ་གནང་བའི་གདན་ས་གཙོ་བོ་ཡིན། ཁོང་གིས་སྨྱུང་གནས་ཁྲི་ལྷག་གནང་བ་དང་ སྐུ་དངོས་ཀྱིས་སྐུ་འབུམ་དང་ས་ཙྪ་བྱེ་བ་བཏབ་པའི་གནས་ཡིན། མུ་རའི་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་བརྒྱད་ཀྱིས་བསྒྲུབ་པ་གནང་ས་ཡང་ཡིན། གཙང་པ་གྲུབ་ཆེན་དང་། གྲུབ་ཐོབ་ཆེན་པོ་རྫོགས་ཆེན་རས་པ་སོགས་ཀྱིས་སྤྱན་རས་གཟིགས་ཀྱི་ཞིང་ཁམས་རི་བོ་པོ་ཊ་ཡིན་པར་གསུངས། གཞི་ཆེན་དབོན་སྤྲུལ་ཐུབ་བསྟན་ལུང་རྟོགས་རྒྱ་མཚོ། སྤྲུལ་སྐུ་མཆོག་རིན་པོ་ཆེ། ལྷོ་བྲག་གྲུབ་ཆེན་སྤྲུལ་སྐུ། རོང་ཐའི་ལྷ་རམས་སྤྲུལ་སྐུ་སོགས་འཁྲུངས་ས་ཡིན། །
༣༽གནས་སྐོར། ཐུགས་རྗེ་ཆེན་པོའི་ལྷ་ཁང་། ཨ་ཁུ་ཚང་ངམ་འདུག་དགེ་ཚང་གི་ཆུ་གཏོར་གནང་སའི་སྒྲུབ་ཆུ་བྱིན་རླབས་ཅན་སོགས་བཞུགས། གྲུབ་ཆུ་འཐུང་ན་ལུས་བདེ་ཞིང་སྙིང་རླུང་སོགས་སེམས་ཀྱི་ན་ཚ་ལ་ཕན། མཆོད་རྟེན་དཀར་རིལ་ལ་བསྐོར་བ་བྱས་ན་གཟའ་ཀླུ་རྒྱལ་གདོན་སོགས་ཀྱི་གནོད་པ་ཞི་བར་འགྱུར་རོ། །
༤༽འཛེམ་བྱ། གནས་འདིར་དམར་ཟས་རིགས་དང་། དུ་ཆང་སོགས་ཁུར་མི་རུང་། གནས་སྡོད་བྱེད་མཁན་ཀུན་གྱིས་སྨྱུང་གནས་ཡན་ལག་བརྒྱད་ཀྱི་ཁྲིམས་ངེས་པར་སྲུང་དགོས། །
༥༽ལུང་བསྟན། རྡོ་གྲུབ་ཆེན(1745-1821)་གྱི་ལུང་བསྟན་དུ། དཔལ་བདེ་མཆོག་གནས་ཀྱི་ཉེ་འགྲམ་དུ། །རྗེ་འཕགས་མཆོག་ཕྱག་ན་པདྨོ་དང༌། །ཉེ་སྲས་བརྒྱད་བཤེས་གཉེན་ཚུལ་བཟུང་ནས། །མདོ་སྔགས་ཀྱི་དར་ཆེན་དགུང་ལ་ཕྱར། །ཞེས་བྱང་ཆུབ་སེམས་དཔའ་བརྒྱད་ཀྱི་སྤྲུལ་བ་མུ་རའི་བླ་ཁག་རྣམས་ཀྱིས་གཞན་དོན་འཕྲིན་ལས་ཀྱི་སྒོ་ཆེན་ཕྱེ་བའི་ཞིང་ཡིན་ནོ། །གཙང་པ་གྲུབ་ཆེན་བྱམས་པ་ཆོས་འཛིན་གྱིས་སྤྱན་རས་གཟིགས་ཀྱི་གནས་སུ་བསྔགས། །
༦༽ལོ་རྒྱུས། (1653)་ལོའི་ཧོར་ཟླ་(08)་པའི་ནང་(07)གོང་ས་ལྔ་བ་ཆེན་པོ་རྒྱ་ནག་ནས་དབུས་ཕེབས་སྐབས་གནས་འདི་བརྒྱུད་ཅིང་། ས་གནོན་དུ་རི་ཁྲོད་མཆོད་རྟེན་དཀར་རིལ་བཞེངས་པར་གྲགས། 
(1771)་རྡོ་གྲུབ་རྒན་དགུང་ལོ་ཉེར་ལྔའི་སྟེང་ཆོས་ལུང་དུ་ཕེབས་སྐབས་འདིར་བཞུགས་ཤིང་སྒྲུབ་པ་མཛད་པའི་རྡོ་ཁང་ཞིག་ཀྱང་ཡོད།  
(1885)་རབ་བྱུང་བཅོ་ལྔ་བའི་ཤིང་བྱ་ལོར་འདུག་དགེ་རི་ཁྲོད་པ་སོགས་ཕེབས་ནས་ཅུང་ཟད་བཞུགས་ཏེ་གནས་ངེས་མེད་དུ་ཕེབས།
སླར་ཡང་མུ་ར་འཇམ་བསྟན་གྱིས་དབེན་ས་སྙན་རྒྱུད་ཀྱི་མངའ་བདག་༧སྐྱབས་མཆོག་འདུག་དགེ་རིན་པོ་ཆེ་བློ་བཟང་རབ་རྒྱས་གདན་འདྲེན་བྱས་ཤིང་རི་ཁྲོད་བཏབ། ས་གླང་(1897)་ལོར་མུ་ར་ལ་ཆོས་རྒྱུན་ཁ་ཤས་ཡོད་པ་གཅིག་ཏུ་བསྡུས་ཏེ་མུ་ར་སྤྱིའི་དགོན་པར་གྱུར། ཕྱོགས་ནས་ཡོང་བའི་བླ་སྤྲུལ་དགེ་འདུན་ཤིན་ཏུ་མང་བས་མུ་རའི་བླ་མ་དགོན་ཞེས་པའི་མིང་ཐོགས། མུ་རའི་བྱང་སེམས་བརྒྱད་དང༌། གྲུབ་ཆེན་ཀུར་ནག་གཉིས་ཞེས་གྲགས་པས་བསྟན་པ་བསྐྱངས་སོ། །
ཕྱི་ལོ་(1922)་ཆུ་ཕོ་ཁྱི་ལོར་གཞི་ཆེན་༧སྐྱབས་མགོན་སྐུ་འཕྲེང་བཞི་བ་དབོན་སྤྲུལ་རྡོ་རྗེ་འཆང་རིག་འཛིན་དགའ་རབ་རྡོ་རྗེ་འམ་པདྨ་དབང་དྲག་ནོར་བུ། ཐུབ་བསྟན་ལུང་རྟོགས་རྒྱ་མཚོ་དཔལ་བཟང་པོ་གནས་འདིར་འཁྲུངས། ཐོག་མར་མནབ་བཟའ་གསོལ་ཞིང་མཚན་སྟོན་བྱེད་ས་ཡང་ཡིན། །
(1980)་ལོར་དགོན་པའི་ཆོས་སྒོ་སྐྱར་ཕྱེ་དང་། བོད་ལྕགས་བྱ་(1981)་ཚེས་བཅུ་ཐེངས་དང་པོ་འཚོགས་ཤིང་ཚ་སྤྲུལ་དགེ་ལེགས་རབ་གསལ་གྱིས་དབུ་བཞུགས་མཛད། མུ་རའི་ཕྱོགས་ལ་ཆོས་དད་རང་དབང་གི་གཏམ་སྙན་སྒྲོགས་པའི་གནས་མཆོག་ཏུ་གྱུར་པའོ། །
༄། །ཀོ་བླའི་སྒོམ་ཁང་། ༡༽མཚན། དུང་དཀར་རི་ཁྲོད། ཀོ་བླའི་སྒོམ་ཁང་། སེངྒེའི་སྒྲའི་ཕོ་བྲང་།
(1771)་རྡོ་གྲུབ་རྒན་ཕེབས་སྐབས་ནས་སྒྲུབ་པ་པོ་ཡོད།
༢༽ཁྱད་ཆོས། དབྱར་བསིལ། དགུན་དྲོ། སྤྱན་རས་གཟིགས་སེངྒེ་སྒྲས་བྱིན་གྱིས་བརླབས་པའི་གནས་ཡིན་པས། ཀླུ་ནད་རིགས་ཅན་ཤིན་ཏུ་ཕན། མཛེ་ནད་ཅན་ཡང་མང་པོ་གནས་འདིར་བསྒྲུབ་པ་བྱས་ཏེ་ནད་ལས་གྲོལ་བ་ཡིན་ནོ། །
༣༽གནས་སྐོར། མཇལ་ཕྱག་དང་། ཉིན་ཞག་གཅིག་ནས་བདུན་མཚམས་སོགས་གནས་འབྲེལ་བཞག་ན་བཅོས་སྡུག་པའི་ནད་ལས་གྲོལ་བའི་ལོ་རྒྱུས་མང་། གནས་ས་བཟའ་བྱུགས་བྱས་པས་ཀྱང་ཤིན་ཏུ་ཕན།
༤༽འཛེམ་བྱ། གནས་འདིར་ཀླུ་རིགས་གནས་པས་དམར་ཟས་སྤྱོད་མི་རུང་། ཐབ་གཞོབ་ལ་འཛེམ། སྦྲུལ་མང་པས་གཟབ་གཟབ་བྱེད་དགོས། ས་གནས་སྲོག་ཆགས་ལ་གནོད་པའི་ལས་སྤང་བར་བྱའོ། །
༥༽ལུང་བསྟན། ཨ་ཁུ་ཐུ་ཐུ་རིན་པོ་ཆེ་ལ་སྤྱན་རས་གཟིགས་སེངྒེ་སྒྲས་ཞལ་གཟིགས་ཚེ་ས་ཕྱོགས་ཐམས་ཅད་ཐུགས་རྗེ་ཆེན་པོའི་ཞིང་དུ་གྱུར། བྲག་ཕུག་སྟེང་ནས་བདུད་རྩིའི་རྒྱུན་འཛགས། གནས་འབྲེལ་ཐོབ་ཚད་སྤྱན་རས་གཟིགས་ཀྱིས་རྗེས་སུ་འཛིན་པར་གསུངས།
༦༽ལོ་རྒྱུས། (1885)་སྐོར་ལ། ཨ་ཁུ་ཐུ་ཐུ་རིན་པོ་ཆེ་མཛེ་ནད་ཀྱིས་གདུང་བར་ཧེ་གྲགས་པ་བཀྲ་ཤིས་རྒྱལ་མཚན་གྱིས་ལུང་བསྟན་ཏེ། སྔར་རྡོ་གྲུབ་ཆེན་རིན་པོ་ཆེ་སོགས་ཀྱིས་བྱིན་གྱིས་བརླབས་ཤིང་མཛེ་བོ་མང་པོ་ནད་ལས་གྲོལ་བའི་གནས་ཞིག་མུ་ར་ལ་ཡོད་པས་དེར་སྒྲུབ་ཀྱིས་གསུངས། ཁོང་གིས་བླ་མའི་ལུང་བསྟན་ལྟར་གནས་བཙལ་བས་རྙེད། ལོ་བཅུ་གཉིས་བར་ཏུ་སྤྱན་རས་གཟིགས་སེངྒེ་སྒྲ་བསྒྲུབས་པས་ཞལ་གཟིགས། ས་ཕྱོགས་དེ་ཐུགས་རྗེ་ཆེན་པོའི་ཞིང་དང་སྒྲུབ་ཁང་གཞལ་ཡས་ཁང་དུ་མཇལ། བྲག་ཕུག་སྟེང་ན་ཐུགས་རྗེ་ཆེན་པོ་སེངྒེ་སྒྲ་བཞུགས་པའི་ཕྱག་ནས་བདུད་རྩིའི་རྒྱུན་འཛགས། ཁོང་གི་སྤྱི་བོར་བསིལ་དུང་ངེར་གྱུར་ནས་ལུས་ཐམས་ཅད་བདེ་བས་གང་། ཕྱི་ཉིན་ནས་ལུས་ཀྱི་སྐྲང་ཞི། གཞོན་ཤ་ཆགས། ནད་ལས་གྲོལ་ལོ། །སླར་ཡང་སེངྒེའི་སྒྲ་བསྙེན་པའི་ཚེ་ཞལ་གཟིགས་ཤིང་། ངས་ཁྱོད་ལ་ཐུན་མོང་གི་དངོས་གྲུབ་སྦྱིན་པ་ཡིན། ཁྱོད་ཀྱི་ཚེ་རབས་ལས་ཀྱི་བླ་མ་ཁྲ་དགེ་སློང་ཚང་ལས་ཡི་དམ་མཁའ་སྤྱོད་མའི་དབང་ལུང་ཞུས་དང་ཚེ་འདིར་མཆོག་གི་དངོས་གྲུབ་ཐོབ་པར་འགྱུར། ཁྱོད་ཀྱིས་འགྲོ་བ་མཛེ་ནད་ཀྱིས་གདུང་བ་མང་པོ་སྐྱོབ་པ་དང་། གནས་འདིར་ཡང་འབྲེལ་བ་ཐོབ་ཚད་སྤྱན་རས་གཟིགས་ཀྱིས་རྗེས་སུ་འཛིན་ནོ་ཞེས་ལུང་བསྟན། ཨ་ཁུ་ཐུ་ཐུ་རིན་པོ་ཆེས་དེ་བཞིན་གནང་ཞིང་ཟུང་འཇུག་གི་སྐུ་གྲུབ་པ་ཡིན་ནོ། །དེ་རྗེས་སུ་ཀོ་བླ་མ་ཟེར་བ་ཞིག་ཀྱང་མཛེ་ནད་ཀྱིས་མནར་ནས་གནས་འདིར་སྐུ་ཚེ་གང་བོར་བསྒྲུབ་པ་མཛད་པས་ནད་ལས་གྲོལ། སྒྲུབ་ཕུག་གི་མིང་ལའང་ཀོ་བླའི་མཚམས་ཁང་ཞེས་ཐོགས་སོ།
༄། །རྟ་རྔོག་སྒོམ་ཁང་། ༡༽མཚན། གེ་སར་རྟ་རྔོག་བྲག་དམར། ས་བཙན་དཀར་བོའི་རྟ་རྔོག བཙན་རི་དབང་ཆེན་རོལ་བ།
ཕྱི་ལོའི་དུས་རབས་བརྒྱད་པ་ནས་དབུ་བརྙེས། ཕྱི་ལོ་(1672)་སྐོར་ནས་སྒྲུབ་ཁང་ཡོད།
༢༽ཁྱད་ཆོས། གནས་འདིར་སྒྲུབ་ཕུག་ཤིན་ཏུ་མང་། མཁའ་འགྲོ་ཡེ་ཤེས་མཚོ་རྒྱལ། ཆོས་རྒྱལ་ཁྲི་སྲོང་ལྡེའུ་བཙན། གུ་རུ་པདྨ་འབྱུང་གནས། ངན་ལམ་རྒྱལ་བ་མཆོག་དབྱངས་སོགས་ཀྱི་སྒྲུབ་ཕུག་ཡོད། མཁའ་འགྲོ་ཡེ་ཤེས་མཚོ་རྒྱལ་གྱིས་ཐོད་རྒལ་སྒོམ་པའི་གནས། དབུ་དང་། ཕྱག་དང་། སྐུ་རྒྱབ་ཀྱི་རྗེས་གསལ་བོ་ཡོད། གླིང་གེ་སར་རྒྱལ་པོའི་ལྷ་རྟ་རྐྱང་བུ་ཁ་དཀར་བཟུང་སྟེ་རྔ་རྔོག་གི་ཕུད་རྟ་ལྷ་ཨརྱཱ་ཏེ་མནྟ་ལ་མཆོད་པ་ཕུལ་བའི་གནས་ཡིན། བདུད་འཇོམས་རྒྱལ་སྲས་བསོད་ནམས་ལྡེའུ་བཙན་གྱི་ཁ་བྱང་པདྨའི་རྒྱ་ཅན་ལས། ནུབ་ཏུ་རྟ་རྔོག་བྲག་དམར་ཞེས་གྲགས་པ་དབང་ཆེན་རྟ་མཆོག་རོལ་བའི་ཕོ་བྲང་སྟེ་དབང་ཆེན་གྱི་རྒྱུད་དུང་ཕྱུར་བཞུགས་པའི་གནས་སོ༔ དེར་གུ་རུ་ཡབ་ཡུམ་གྱི་སྒྲུབ་ཕུག༔ སྐུ་རྗེས༔ ཕྱག་རྗེས༔ ངན་ལམ་རྒྱལ་བ་མཆོག་དབྱངས་ཀྱི་སྒྲུབ་ཕུག༔ བྲག་རིའི་རྩེར་རྡོ་མཁར་ཏུ་ཆོས་རྒྱལ་ཁྲི་སྲོང་སྡེ་བཙན་གྱིས་རྟ་མགྲིན་གྱི་སྒོ་ནས་རྟ་སྐད་འཛམ་གླིང་དུ་སྒྲོགས་པའི་གནས་ཡོད་དོ༔  འོག་ཏུ་གནོད་སྦྱིན་ཙིའུ་དམར་པོ་སོགས་བཙན་གྱི་ཕོ་བྲང་ཏུ་སྲུང་མ་རྟག་པར་གནས་ཤིང་བཙན་དམག་འབུམ་སྡེ་འགྱེད་པ་བཞུགས་སོ༔ ཞེས་གསུངས་སོ། །
༣༽གནས་སྐོར། བྲག་ཕུག་གོང་འོག་བར་གསུམ་དུ་མཆོད་འབུལ། ཕྱག་སྐོར་བྱས་ན་ཕན་ཡོན་ཆེ། ལྷག་པར་ཏུ་པདྨ་གསུང་གི་རིགས། ཐུགས་རྗེ་ཆེན་པོ་འཁོར་བ་དོང་སྤྲུགས། རྟ་མགྲིན། སྒྲོལ་མ་དམར་པོ། རིག་བྱེད་མ་སོགས་བསྙེན་པ་དང་། གནོད་སྦྱིན་ཙིའུ་དམར་པོ་སོགས་བཙན་གྱིས་རིགས་ལ་གསོལ་མཆོད་བྱས་ན་ལེགས་སོ། །
༤༽འཛེམ་བྱ། གནས་འདིར་ས་གཉན་པར་གྲགས་ཆེ་བས། རྒྱ་ལམ་འཕྲེད་དུ་བཅད་ཏེ་མི་འདུག ལམ་ཕྲན་ནང་ནས་ངལ་མི་གསོ། ཤ་ཁྲག་སོགས་ཐབ་གཞོབ་མི་བྱ། གནས་ལ་ཁ་གཏད་དེ་གཙོག་པ་མི་འདོར། སྦྲ་གུར་སྒོ་གནས་ལ་མི་བརྟེན། ལམ་ཡོད་སར་གུར་མི་ཕུབ། གསོལ་མཆོད་མ་བྱས་པར་ས་མི་བརྐོ། རྡོ་མི་གཅོག ཤིང་མི་བཅད། ཆུ་མིག་གར་ཡོད་དུ་བཙོག་པ་མི་འདོར། ཁ་ངན་དང་འཐབ་མོ་མི་བྱ། ཐོག་མར་གནས་ལ་ཁ་ཕྱོགས་ཏེ་རྟ་མགྲིན་གྱི་བསྙེན་པ་འདོན། གནས་སྐོར་ལ་བར་ཆད་མེད་པའི་སྨོན་ལམ་བཏབ། གནས་དང་ཁ་བྲལ་ཚེ་སྨོན་ལམ་བཏབ་མ་ཚར་བར་རྒྱབ་མི་སྟོན་པ་བཅས་སོ། །
༥༽ལུང་བསྟན། རྒྱལ་སྲས་བསོད་ནམས་ལྡེའུ་བཙན་གྱིས། པདྨ་གསུང་གི་གནས་ཡིན་པས། གནས་འབྲེལ་བྱས་ཚད་ཀྱིས་དབང་གི་དངོས་གྲུབ་སྣ་རེ་འགྲུབ་གསུངས། མ་འོངས་པར་གཏེར་གྲུབ་རིམ་བྱོན་གྱིས་པདྨ་གསུང་གི་གཏེར་ཁ་ཕྱེས་ཤིང་འགྲོ་དོན་འཛམ་གླིང་ཁྱབ་པར་འབྱུང་བ་དང་། གནས་འདིར་སླེབས་ནས་བཟང་འབྲེལ་འཇོག་མཁན་མ་ལུས་པ་ནམ་ཞིག་པདྨ་འོད་ཀྱི་ཞིང་དུ་སྐྱེ་བར་ཐག་ཆོད་ཅེས་བཀའ་གནང་།
༦༽ལོ་རྒྱུས།  དུས་རབས་བརྒྱད་པར་གུ་རུ་པདྨ་འབྱུང་གནས། མཁའ་འགྲོ་ཡེ་ཤེས་མཚོ་རྒྱལ། ཆོས་རྒྱལ་ཁྲི་སྲོང་ལྡེའུ་བཙན། ངན་ལམ་རྒྱལ་བ་མཆོག་དབྱངས་སོགས་ཀྱིས་པདྨ་དབང་ཆེན་རྟ་མཆོག་རོལ་བ་འཆད་ཉན་སྒོམ་སྒྲུབ་མཛད།
དེ་རྗེས་གླིང་རྗེ་གེ་སར་ནོར་བུ་དགྲ་འདུལ་གནས་འདིར་ཕེབས་ནས་ཐོག་མར་ལྷ་རྟ་རྐྱང་བུ་ཁ་དཀར་བཟུང་། རྟ་མཆོག་རོལ་བའི་སྒྲུབ་པ་མཛད། 
(1771)་སྐོར་ལ་རྡོ་གྲུབ་རྒན་གནས་དེར་བཞུགས་པའི་སྒྲུབ་པོ་རྣམས་ཀྱིས་གདན་དྲངས་ཤིང་སྒྲུབ་པ་གནང་།
(1885)་སྐོར་ལ་ཛ་མགོ་ཚ་སྤྲུལ་རིན་པོ་ཆེ་ཀུན་དགའ་ལེགས་བཟང་ཕེབས་ནས་རྟ་མགྲིན་གྱི་སྒྲུབ་པ་མཛད་དེ་གྲུབ་པ་ཐོབ། གྲུབ་ཆེན་ནག་པོ་བའི་སྐྱེ་སྤྲུལ་རིག་འཛིན་འཇིགས་མེད་རབ་བརྟན་གྱིས་རྟ་མགྲིན་བསྒྲུབས་ཏེ་གྲུབ་རྟགས་ཐོན། སོག་པོ་མགོ་ལེབ་བླ་མ་བློ་འཕེལ་མཚོ་རྒྱལ་ཕུག་ཏུ་བཞུགས་ཤིང་ཡུན་རིང་པོར་ཏིང་ངེ་འཛིན་གྱི་བཅུད་ལེན་ལ་བཞུགས་པ་སོགས་ངོ་མཚར་བའི་ལོ་རྒྱུས་ཤིན་ཏུ་མང་ངོ་། །
(2006)་མེ་ཁྱི་ལོར། ཡ་ཆེན་གྲུབ་དབང་ཨ་ཆུག་རིན་པོ་ཆེས་གུ་རུ་རིན་པོའི་གནས་སུ་ངོས་འཛིན་གནང་ཤིང་གནས་སྒོ་ཕྱེས་སོ། །
༄། །ཆུ་དཀར་སྒོམ་ཁང་། ༡༽མཚན། ཆུ་དཀར་བྲག་ཕུག ནོར་བདག་བྲག འཛམ་དཀར་གནས། གེ་སར་ཆུ་ཚན་སོགས་སུ་གྲགས།
༢༽ཁྱད་ཆོས། གནས་འདིར་ཅོང་ཞི་སོགས་གཏེར་སྨན་རིགས། གླིང་གེ་སར་གྱི་ཚུ་ཚན་སོགས་ནད་བརྒྱ་སེལ་བའི་སྨན་ཆབ་ཡོད། གནས་འདིར་བསང་མཆོད་འབུལ་བ་དང་། གཏེར་སྦས་ན་ལོངས་སྤྱོད་འཕེལ་བ་དང་། ཚུ་ཚན་གྱིས་ཁྲུས་བྱས་པས་པགས་ནད་སེལ།  སྔོན་བྱོན་དམ་པ་རྣམས་བཞུགས་པའི་སྒྲུབ་ཕུག་མང་པོ་མཆིས་སོ། །
༣༽གནས་སྐོར། སྨན་བླ་སྒྲུབ་པ་དང་། འཛམ་ལྷ་སོགས་ནོར་ལྷའི་རིགས་བསྒྲུབ་ན་དངོས་གྲུབ་མྱུར།
༤༽འཛེམ་བྱ། རང་དགར་བསང་ཁྲི་ལ་རེག་པ་དང་། ས་རྐོ་རྡོ་སློག་དང་། སྲོག་ཆགས་དང་སྐྱེ་དངོས་ལ་གནོད་པ་བྱེད་མི་རུང་། ཤ་ཆང་སོགས་དམར་ཟས་སྤངས། དགོན་པའི་བཀའ་གནང་མེད་པར་གཏེར་རྡོ་ཁུར་མི་རུང་།
༥༽ལུང་བསྟན། གུ་རུའི་ལུང་བསྟན་པདྨའི་རྒྱ་ཅན་ལས། ཨོ་རྒྱན་སྨན་བླས་བྱིན་གྱིས་བརླབས་པའི་ཆུ་ཚན་དང་༔  བྲག་རི་རིན་ཆེན་སྤུང་བར་གནོད་སྦྱིན་ནོར་ལྷ་རྒྱ་མཚོའི་ཕོ་བྲང་དང་༔ རྒྱས་པའི་ལས་ཚོགས་དུང་ཕྱུར་གཅིག་བཞུགས་སོ༔ ཅེས་གསུངས་སོ། །
༦༽ལོ་རྒྱུས། གླིང་གེ་སར་གྱི་ཆུ་ཚན་དུ་གྲགས་པའི་ཆུ་ཚན་ཉལ་ཁྲི་མང་པོ་རང་བྱུང་དུ་གྲུབ་པའི་རྒྱབ་རི་ནོར་བུ་སུམ་བརྩེགས་ཀྱི་དབྱིབས་སུ་བཞུགས་པར་ནོར་ལྷའི་སྒྲུབ་གནས་ཁྱད་པར་དུ་འཕགས་པ་བཞུགས། 
(1771)་སྐོར་ལ་རྡོ་གྲུབ་རྒན་གནས་དེར་བཞུགས་པའི་སྒྲུབ་པོ་རྣམས་ཀྱིས་གདན་དྲངས་ཤིང་སྒྲུབ་པ་གནང་། 
(1885)་སྐོར་ལ་ཛ་མགོ་ཚ་སྤྲུལ་རིན་པོ་ཀུན་དགའ་ལེགས་བཟང་ཕེབས་ནས་ལོ་རེ་བཞིན་ཚུ་ཚན་དུ་བཞུགས་པས་སྙུན་ཞི་ནས་སྐུ་ཁམས་གསལ་དྭངས་བྱུང་། གྲུབ་ཆེན་ནག་པོ་བའི་སྐྱེ་སྤྲུལ་རིག་འཛིན་འཇིགས་མེད་རབ་བརྟན་གྱིས་ཁྲོས་མ་ནག་མོ་སྒྲུབ་པའི་སྐབས་ཡེ་ཤེས་ཀྱི་མཁའ་འགྲོ་མའི་ཞལ་གཟིགས། མུ་ར་ཁ་ལོའི་ཡར་འཕེལ་གནས་འདི་ནས་གཉན་ཁྲོད་གཅོད་ཚེ་ཕྱི་ནང་གི་འཚུབས་སློང་སྣ་ཚོགས་བྱུང་བ་རོ་སྙོམ་ཀྱི་ལྟ་བས་གཟིར་པས་བདུད་ལས་རྣམ་པར་རྒྱལ་བའི་རྟགས་ཐོན། །
མེ་བྱ་(1957)་ལོར་གཞི་ཆེན་ཀུན་བཟང་ཉི་མ་དང་ཨ་ལགས་དགོན་ཚང་ཟུང་གིས་གནས་སྒོ་ཕྱེས།  ལབ་རྩེ་གསར་ཏུ་བཙུགས། སྣོད་བཅུད་ཀྱི་རྒུད་པ་ཞི་བའི་གཏེར་མང་དུ་སྦས་སོ། །
(2006)་མེ་ཁྱི་ལོར། ཡ་ཆེན་གྲུབ་དབང་ཨ་ཆུག་རིན་པོ་ཆེས་སྨན་བླ་མཆེད་བརྒྱད་ཀྱི་གནས་སུ་ངོས་འཛིན་གནང་ཤིང་གནས་སྒོ་ཕྱེས་སོ། །
༄། །མདའ་རའི་སྒོམ་ཁང་།  ༡༽མཚན། མདའ་རའི་སྒོམ་ཁང་། གེ་སར་སྒྲུབ་ཁང་། གཡེར་ཁའི་བྲག་ཕུག གནས་འདབས་སྒྲུབ་ཁང་། བློ་གསལ་མཚམས་ཁང་སོགས་ཟེར།
༢༽ཁྱད་ཆོས། གཡར་བསིལ། དགུན་དྲོ། མཐུན་རྐྱེན་འཛོམས་སླ། སྒྲུབ་པ་པོར་བར་ཆད་ཉུང་། ཁ་དགེ་བཀྲ་ཤིས་པའི་གནས་ཡིན་པར་གྲགས། །
༣༽གནས་སྐོར། གནས་འདི་རང་བྱུང་རྒྱལ་མོའམ་དཔལ་ལྡན་རེ་མ་ཏིའི་གནས་རིའི་ཉེ་འདབས། བསྟན་པ་སྲུང་བའི་དགེ་བསྙེན་རོལ་པ་སྐྱ་བརྒྱད་བཞུགས་པའི་གནས་ཡིན། སྒྲོལ་མ། དབྱངས་ཅན་མ། དཔལ་ལྡན་ལྷ་མོ་སོགས་མཁའ་འགྲོ་ལ་མཆོད་འབུལ་དང་བསྙེན་པ་གནང་ན་ལེགས།
༤༽འཛེམ་བྱ། འཁོར་ཡུག་ལ་གཙང་སྦྲ་དང་། རི་གནས་ཀྱི་སྐྱེ་དངོས་སྲུང་སྐྱོབས། ཁྱད་པར་ཏུ་སྦྲུལ་དང་བྱ་རིགས་ལྷ་མོའི་སྤྱན་གཟིགས་ཡིན་པས་གནོད་པ་བྱེད་མི་རུང་།
༥༽ལུང་བསྟན། གུ་རུའི་ལུང་བསྟན་པདྨའི་རྒྱ་ཅན་ལས། བརྟན་མ་རྡོ་རྗེ་དྲག་རྒྱལ་མའམ་རང་བྱུང་རྒྱལ་མོའི་ཕོ་བྲང་གསོན་སྙིང་གྱེན་ཏུ་བསླངས་པ་ལྟ་བུ་བརྗིད་ཆེ་བ་ཡོད་དོ༔ འདབས་རོལ་ཏུ་དྲེགས་པ་སྡེ་བརྒྱད་དང་བཅས་པ༔ གླིང་གི་མདའ་མཛོད༔ གཞུ་མཛོད༔ གོ་ཆའི་མཛོད་སོགས་ཡོད་དོ༔
༦༽ལོ་རྒྱུས། གནས་འདིའི་གཡས་གཡོན་ལུང་པར་གླིང་གི་མདའ་ར་གཞུ་ར་ཟེར། རི་ཁྲོད་རྒྱབ་རིར་གླིང་གི་གོ་ཆའི་གཏེར་མཛོད་དང་། རྩེ་མོར་གླིང་གི་སོ་དིལ་མཐོན་པོ་སོགས་དཔའ་བོ་གླིང་དང་འབྲེལ་བའི་མཚན་ཐོགས་པ་པ་མང་པོ་ཡོད། གནས་ཀྱི་གཡས་གཡོན་དུ་ལུང་པ་མདོ་དོག་པ་ཁོངས་ཡངས་པ་སྦས་སྐུང་བྱེད་པའི་གནས་སུ་རང་བཞིན་གྱིས་གྲུབ་པ་ཞིག་ཡོད་པ་ནི་གླིང་གི་དུས་སུ་གོ་མཚོན་གྱི་མཛོད་ཁང་ཆེན་པོ་ཞིག་ཡིན་པར་གྲགས། གླིང་གེ་སར་གྱི་ཆུ་ཚན་དུ་གྲགས་པའི་ཆུ་ཚན་ཉལ་ཁྲི་མང་པོ་རང་བྱུང་དུ་གྲུབ་པའི་རྒྱབ་རི་ནོར་བུ་སུམ་བརྩེགས་ཀྱི་དབྱིབས་སུ་བཞུགས་པར་ནོར་ལྷའི་སྒྲུབ་གནས་ཁྱད་པར་དུ་འཕགས་པ་བཞུགས། བྲག་ཕུག་འདི་ཉིད་གླིང་གེ་སར་གྱི་སྒྲུབ་ཁང་དུ་གྲགས། 
(1771)་སྐོར་ལ་རྡོ་གྲུབ་རྒན་ཀུན་བཟང་གཞན་ཕན་བཞུགས། 
(1880)་སྐོར་ལ་གྲུབ་ཆེན་ཀུ་ཀུ་རུ་པའི་སྤྲུལ་བ་སྔགས་རྒན་བསོད་ནམས་ཆོས་འཕེལ་དང་། གྲུབ་ཆེན་ནག་པོ་པའི་སྐྱེ་སྤྲུལ་རིག་འཛིན་འཇིགས་མེད་རབ་བརྟན་ཏེ། མུ་རའི་གྲུབ་ཆེན་ཀུར་ནག་གཉིས་ལྷན་གཅིག་ཏུ་བསྟན་པ་སྤྱིའི་སྐུ་རིམ་དུ་རྡོ་རྗེ་ཕུར་བའི་སྒྲུབ་པ་མཛད་པར་གྲགས། མུ་ར་བླ་མ་བློ་གསལ་ཡང་ལོ་ཉེར་ལྔ་ཙམ་དུ་སྒྲུབ་པ་མཛད་ཅིང་མུ་རའི་དགོན་པའི་མགོན་ཁང་གི་སྲུང་མའི་ཞལ་ཐང་གཉན་པོའང་གནས་འདི་ཉིད་དུ་བཞེངས། བླ་མ་བློ་གསལ་གྱིས། འདི་ངས་ཆུ་ཐིགས་རེ་ལ་སྔགས་རེ་བཏབ། ཚོན་ཐིགས་རེ་ལ་སྒོམ་རེ་བརྒྱབ་ནས་བཞེངས་དུས། ལྷ་ཐམས་ཅད་རེ་རེ་བཞིན་ཐིམ་སོང་བས། སུ་ཞིག་གིས་མཆོད་ན་གསུང་འབྱོན་ཐག་ཆོད་ཡིན་ཅེས་ཞལ་བཞེས་གནང་པའི་ཡེ་ཤེས་པ་དངོས་སུ་བཞུགས་པ་ཡིན། །
གྲི་བོ་ཞིག་གི་གའུ་གནས་འདི་ལ་སྦས་པས་གཙོག་ཤོར་ཚུལ་གྱི་སྒྲོས་བྱུང་སྟེ། མེ་བྱ་(1957)་ལོར་གཞི་ཆེན་ཀུན་བཟང་ཉི་མ་ཕེབས་ནས་མནོལ་བསང་རི་ཁྲུས་རྒྱས་པར་བྱས། གཏེར་མང་དུ་སྦས། གནས་ཉམས་གསོས་ཤིང་གནས་སྒོ་ཕྱེས་པ་ཡིན་ཞེས་གསུངས། །
(2006)་མེ་ཁྱི་ལོར། ཡ་ཆེན་གྲུབ་དབང་ཨ་ཆུག་རིན་པོ་ཆེས་རང་བྱུང་རྒྱལ་མོའི་གནས་སུ་ངོས་འཛིན་གནང་ཤིང་གནས་སྒོ་ཕྱེས་སོ། །
སྨྲས་པ། །ལམ་གྱི་རྩ་བ་བཤེས་གཉེན་བསྟེན་ཚུལ་ལེགས། །ཆོས་ཀྱི་སྙིང་པོ་དྲན་ཤེས་བག་ཡོད་ལྡན། །བསྟན་པའི་རྩ་བ་དགེ་འདུན་སྡེ་གཉིས་མཐུན། །ཐུབ་བསྟན་འཕེལ་ཤིང་རྒྱས་པའི་རྟེན་འབྲེལ་ལེགས། །ཕྱི་རུ་ཚུལ་ཁྲིམས་གསུམ་གྱི་གོས་བཟང་མཛེས། །ནང་དུ་རིམ་གཉིས་ཏིང་འཛིན་ཚད་དུ་འཁྱོལ། །གསང་བ་རང་རིག་གདོད་མའི་རྒྱལ་སར་བསྙེགས། །བསམ་གཏན་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་གླིང་། །མཐོང་པས་རྣམ་པར་གྲོལ་བའི་ཆོས་ཀྱི་སྒོ། །སྙིང་གི་བཅུད་དུ་ལྷུང་བའི་རྩེ་དགའི་གར། །བཤད་སྒྲུབ་སྐྱེ་བ་ལྔ་བའི་དབྱངས་སྙན་གྱིས། །ཉི་ཟླས་ཁྱབ་ཚད་མ་ལུས་ཕན་བདེར་སྦྱོར། །ཐེག་པའི་རྩེ་རྒྱལ་བསམ་མི་ཁྱབ་པའི་དོན། །ཀ་དག་འོད་གསལ་རྫོགས་པ་ཆེན་པོའི་དབྱིངས། །ཟགས་བཅས་སྒྱུ་ལུས་རྡུལ་བྲལ་འོད་སྐུ་རུ། །འཕོ་བའི་ཟབ་རྒྱས་གདམས་པའི་ནོར་བུ་འཛིན། །ས་སྤྱོད་ཞིང་དུ་བཞུགས་པའི་སྐྱེ་བོ་ཅོག །མཁའ་སྤྱོད་གསང་ལམ་བསྙེགས་པའི་ལམ་སྣ་ཟིན། །མཐོང་ཐོས་དྲན་པའི་སྐྱེ་འགྲོ་རྡུལ་གྱི་གྲངས། །བདེ་ཆེན་ས་ལ་དབུགས་ཆེན་འབྱིན་པར་ཤོག །
།ཅེས་པའང་གོང་རིམ་ནས་ལོ་རྒྱུས་རྒྱས་བསྡུས་གཉིས་ཀྱི་མཐའ་ལ་མ་ལྷུང་པ་ཞིག་དགོས་ཞེས་བསྐུལ་མ་གནང་བ་ལྟར་དགོས་དབང་དང་བསྟུན་ཏེ། ཕྱི་ལོ་ (2020) ་ལོའི་ཟླ་(08)་ཚེས་(08)་ཉིན་མུ་ར་དགོན་གཞུང་ནས་བཀོད་པ་ཛ་ཡནྟུ། །

 
















མུ་རའི་སྒྲུབ་གྲྭ།
★木拉寺关房

	











མུ་རའི་སྒྲུབ་གྲྭ།
★木拉寺关房
 
木拉寺简史
〈帝释天王顶宝〉

南无 咕如威
冲拌二种资粮乳海中 身语意德圆满映白辉 显灭二执热恼之威德
所知遍智释迦狮前礼 绽耀二教利乐千毫光 颠倒祈愿毒害口气者
炽燃威力法轮行伐戮 献供贝玛嘎啦第二佛 一切三世诸佛事业舞
显现夺意嬉女相度母 受如来教具德怙兄妹 三根护法海会赐善妙
揭示十万教证光辉之 帝释天王顶严妙宝珠 转动禅定法轮之教言
献予南瞻部洲大地众
念诵供养为先行，木拉寺史将稍述。
1.	寺名乃，今公许曰“木拉寺”，全名“玛隅禅定法轮洲”。“木拉”意指“漠尔汗”，蒙古语谓“马背王”，示其木拉宗亲之源流，玛隅”谓居黄河岸，“禅定法轮洲”系指转动隐遁修禅为主之教证法轮处。寺名尝曰“果多修院”、“木拉黑账营”、“诺丹法帐营”、“法谷帐营”、“佛塔黑账营”、“督格山居寺”、“东方广弘释教洲”、“木拉喇嘛寺” 诸名处所随宜而易。
2.	伽蓝始年乃，公元1477藏历火鸡年。共同而言，牧区黑账由一转一，经徙多次，于黄河岸建立闭关房，以此认定为寺院之主要开端根据，从此延续不绝出现众多持传承者、学者和成就者。然若以血统法脉而言，亦有以噶陀派大成就自在者喇敦南开仁钦之宗嗣，木拉诺诺之母白乐公主，为当时驻锡康区梭托僻静处(公元八世纪毘庐遮那大师创立)之领主，以其立寺年份计为始年。
 
3.	地区乃，如古史中记载，称为玛隅八草原，《宁氏战神穰解法》中叙述：

地域玛隅八草原 玛王父系一妹母 姓氏为年玛萨穆 北方丁丁女皇后

以及，萨迦阿旺根嘎罗珠所造〈十二安宁地母供养文〉中云：

多康玛沁奔日圣山中 玛瑞遍主金刚猛王母

如是藏区十二护地母之一，玛瑞遍主金刚猛王母，俗称交宗日秀神山脚下，黄河流向以划分，果洛三区下边界，外牧三区之上端，现甘肃省甘南州玛曲县木西合乡木拉大队之内，于尕(ga)波大山谷和交宗大山谷中间，尕若崖口与交宗崖口中，处于上、下平原之下平原，位于秋隆小山谷与尕隆小山谷中间。
















བརྟན་མ་རྡོ་རྗེ་དྲག་རྒྱལ་མའོ།
★金刚猛王母
4.	法脉乃
(1)佛教共同传承：吉祥胜者释迦能仁教，尽诸显密之教规。
(2)莲师不共传承：主依威压现有莲师为自宗，兼学不分宗派之寺庙。
(3)家族血脉传承：木拉家族为大成就者喇敦巴后代，以吉祥胜者噶陀巴喇敦南开仁钦宗嗣所流传之传规为不共传承 。
(4)宁氏西青传承：宁‧尼玛沃瑟后代西青寺大德索南华滇之传规，督格上师洛桑饶吉所传下温萨耳传，此三(喇敦血脉、宁氏西青、督格温萨)为主要三大传承。
(5)相关宁玛巴传规中，北岩藏多杰札、敦都多杰、龙萨宁波、龙钦心要、康仓大师之法脉为此寺主修传承法。
5.	寺院之建室乃，建有寺院大经堂、观音殿、护法殿、斋堂、八上师府营各自之佛堂，以及十八僧舍百七十僧人居住，寺院周围尚有五十三大转经轮、二千五百多个小转经轮。
分区部门乃，寺院大众、佛学院、禅修院、藏医院、咒士院共五部。




	




            ཚོགས་ཆེན་འདུ་ཁང་། 		  མུ་རའི་སྒྲུབ་གྲྭ་ཆོས་དབྱིངས་འགྱུར་མེད་བསམ་གཏན་འོད་གསལ་གླིང་།
                    ★木拉寺主殿	   	      ★木拉寺禅修院法界不变禅定光明洲
 










མུ་རུའི་བཤད་གྲྭ་མདོ་སྔགས་བཤད་སྒྲུབ་གླིང་། 					བཤད་གྲྭའི་འདུ་ཁང་།
 ★木拉佛学院经咒讲修林					★佛学院大殿











        དགོན་པའི་སྐོར་མཐའི་འཁོར་ཆུང་ཡོད། 				      སྨན་ཁང་ཚེ་རིག་ཀུན་ཕན་གླིང་།
    ★寺院周围转经轮				               ★藏医药院长寿利生洲
         

全寺管理者乃，寺庙活佛与地方官员，司管寺众整体、传统季节性法事与活动、日课、经忏、财务等职务。
佛学院授基本文法、显宗五部大论、密宗四续法门。
禅修院授龙钦心滴前行五加行，循至大悲观音苦难自解脱闭关。往昔木拉寺有木拉观音法会，延革为督格活佛八关斋戒法会，禅修院沿袭此统观音法脉。
藏医院授藏医药术历算相命，饶益社会成办利乐。
咒士院内男女居士修前行法，举办观音法会、度母法会、极乐法会，诸结缘者恪遵善法。
6.	寺院镇殿之宝乃，六米铜金所制千手千眼观音圣像、五米寂静莲师像、五米忿怒莲师像、释迦牟尼佛一千尊、度母两千尊、雅砻琉璃洞圣地所迎取之萨霍尔莲花生大师伏藏像、灭除轮回观音像、桑耶寺莲师加持而由宁‧尼玛沃瑟所取出之伏藏天铁金刚杵、嘉木样协巴二世遍智究美旺波所予释迦牟尼佛金刚座佛像、西青翁珠活佛等所予天竺、汉地、尼泊尔、藏地等处所得诸多古老铜合金佛像、法器及伏藏品，另还有特别信物护法神旗为主之众多器物。
 
7.	主修法门：大悲观音、八大法行、多罗度母、众会怙主玛哈嘎啦、玛哈嘎莉护法、孜玛入护法、狮面护剎、安宁地母金刚猛王母。
          			 
ཐུགས་རྗེ་ཆེན་པོ་ཕྱག་སྟོང་སྤྱན་སྟོང་།			   	 གནོད་སྦྱིན་ཙེའུ་དམར་པོ།
  ★千手千眼观音 				  ★孜玛入护法
          		 
ཨརྱཱ་ཏཱ་ར།				        དཔལ་མགོན་ཚོགས་ཀྱི་བདག་པོ།
★多罗度母			 		    ★众会主玛哈嘎啦
 
(1) 循如诸寺，不断奉持三毗奈耶(夏住、长净、解制)之常规。
(2) 出家入此，恒持八大法行身坛城，乃宁‧尼玛沃瑟后嗣西青寺传轨。。
(3) 祭祀祈祷普巴金刚并与护法未尝断绝，木拉僧团其良规焉。
(4) 历年不断八关斋法，其数有八(16天)，乃督格僻静处无误传轨。
三大重要法门：自木拉诺诺迁移黄河岸，观音、普巴金刚、众会主玛哈嘎啦此三法门未曾间断，此等法门中木拉观音六字真言法会尤为著名，公元1789第十三遶炯土鸡年，始建北岩藏观音菩萨解脱众生之大法会。
8.	寺规：本寺系戒律道场，恪遵三止三行之矩，三止曰：止女众住寺、止烟酒进寺、止法会开荤。三行曰：行闻思修、循行寺规、主行公利。
 
ཞིང་སྐྱོང་སེངྒེའི་གདོང་པ་ཅན།
★兴炯狮面护刹
9.	法行乃，新年初一祀祷护剎护法为噶陀西青派传规。
10.	藏历翼宿月(正月十六至二月十五)初一至十三间十日大法会为噶陀大活佛西青传规，藏历四月氐宿月断食八关斋戒为格鲁传规，六月之悉地宝瓶大成就法会为康区伏藏传规，结夏安居为佐钦寺传规，八月大悲观音苦难自解脱七日修法为北岩藏传规，十月普巴七日修法为噶陀传规，马月大供养(藏历十月廿五日)为黄教格鲁派传规，年尾三日献供普巴金刚、或狮面母、或马头明王任宜之除夕廿九朵玛为噶陀传规，木拉村庄共同举办之大法会为“祈愿任运”、“多罗度母”、“众会怙主玛哈嘎啦”，有如此之祀祷传规。
11.	历史乃，本地原居民称作木拉，木拉先辈祖师蒙古处琥尔汗或称绰克图台吉(又称却图和、蒙肯朝克图台吉，为达延汗玄孙、格哷桑札札宾尔曾孙、诺诺和孙子、巴赖和硕齐诺颜之子)，其父祖之亲戚木拉根嘎巴桑从噶陀来此树立密咒旧译宁玛派，复于公元1477火鸡年，根嘎巴桑于觉囊派法王迦哇桑座下修习吉祥时轮六支，并建置修行禅房为木拉僧团之创始。其亲族木拉前辈根嘎朋措依止仁珍敦都多杰(1615-1672)座下学习，劝请敦都多杰大师写下《敦都玛沁山神祭祀仪轨》。金龙年(1640)木拉祖父木拉诺诺，尊称为札利南迦，提议迁至黄河流域，抵遂定居，逐渐发展出僧俗二部。其后近两百年由木拉肯本咒士血脉家族诸咒士、新木拉给根、荣誉格西木拉秋则、木拉喇嘛、木拉诺丹等办理法事。
一旦发愿成熟时，将由色达区宁氏宗嗣，与岭夏‧邬金伦珠结上法缘，其上师噶陀菩萨索南坚赞生殁于1679-1723年之间。
由史书纪年，岭夏‧邬金伦珠之著作《寂忿降魔》中记载：“金虎年(1770)孟夏时日，年迈上师邬金伦珠于自龄77岁时，于卡钦密咒洲禅房中，上座念修时所编述。” 如是云云。以此为计算根据故，其应当诞生于1693水鸡或1694木狗任一年，殁岁乃金马年。
自传中述：

马年马月初十日出时 阿阇黎莲师噶陀尊前 无别大胜坛城融法界

有如是记述。
岭夏‧邬金伦珠第二转世西青寺依怙主索南华滇赐予噶陀之上师慕楚秋样多杰之秘文(《安多东方祭祀仪轨》)中授记曰：“卿往南行，于称名交宗巴颜神山拉则山脉建立供神台，若能启建大悲观音解脱众生之修供，将能饶益有缘，并且必出法嗣。”又噶陀金刚座红印公文指出，木拉多钦上师迎请青年依怙主索南华滇，于公元1789第十三遶炯土鸡年，在上部拉则修筑木拉果多八大法行大塔。于昔有之黑营大帐篷中设立大悲观音解脱众生九日修供法会之传规，因而与西青寺上师诸位师传，缔结甚深法缘与誓言。
公元1784年前后，木拉老僧丹吉担任安多遍智嘉木样协巴二世究美旺波之大知客将木拉家族加入拉卜楞祈愿团，嘉木样二世赐予木拉公文以及释迦能仁金刚座佛像，木拉村成为拉卜楞寺举办大神变节法会团员之一，于十五吉日作为功德主。
公元1818土虎年，西青毘庐贤哲桑阿丹增莅访，修筑嘎龙山谷菩提塔，并启建悉地宝瓶修法，由木拉上师索南确佩等办理法事。
公元1884第十五遶炯木鸡年，木拉蒋滇迎请温萨耳传之传人怙主督格活佛一世，设立“督格僻静处(斗盖日朝)”，木拉若干法流汇合为一，成为木拉主寺，各方上师、转世者、僧伽众涌而至，得名“木拉喇嘛寺”，由木拉八大菩萨以及称为咕、那(咕咕日巴、那波巴)两位大成就者办理法事。
1980金猴年，在党中央和县政府领导下，批准复兴佛法。木拉僧团分为三组，于各地举办莲师猴年猴月初十法会。
1981金鸡年，为复兴佛法之缘起，于木拉僻静处举办广大莲师初十法会，重建菩提塔。
1983水亥年，依照康仓大师和贡塘仓大师滇必旺秋指示，将寺院迁回过去木拉僧团所在处秋隆，由木拉喇嘛索南旺迦、木拉查祖格列活佛、贡秋乎活佛、土年活佛等所有寺庙活佛们带领僧俗二众，于政府支持下，重建成现今寺庙。
12.	历代木拉上师乃，过去所有木拉家族宗嗣分为二次第瑜伽咒师，其中稍述僧俗二众为法教众生广大利益之承许，木拉根嘎巴桑、木拉根嘎朋措、木拉诺诺多杰札滇、木拉路迦本、木拉咒师肯他本、木拉帖本、木拉多钦上师、木拉万甘丹吉、木拉给根邬金诺布、木拉上师邬金图多、木拉阿甘索秋、木拉邬秋上师、木拉查祖、木拉活佛、木拉邬金松饶桑波、木拉丹增尼玛，其间众位善师宛如珍宝鬘般历世，于此仅略述若干要士云耳。  
13.	西青依怙主翁珠活佛第四世‧依怙主翁珠图登龙德迦措，父为木氏木如旺之宗嗣，木拉噶贡为当时木拉家族首领，母为西合雄村村官之女，名卡卓措。藏历水狗阳年 (1922)生于木拉山中，于督格大师尊前献发搭衣，符合众多新旧不分宗派之转世授记，尤其第五世佐钦法王的预言中记载：

玛隅帝青蓝宝大地上 父乃马头化身噶为名
母乃亥母化身措为名 汤东嘉波化身狗年生

以及蒋扬钦哲确吉罗珠之授记曰：

玛原平川大河岸 东方富庶人家中 父名为贡母名措 善种幼孩狗年生
毗底达拉(意为持明)大菩萨 持有经咒法命要 结缘安置解脱地


                 
        ༧ གཞི་ཆེན་སྐྱབས་མགོན་དབོན་སྤྲུལ།			         	དབོན་སྤྲུལ་ཞབས་རྗེས།
 ★翁珠活佛                                                	         ★翁珠活佛足印
如二种授记中，于父母名号、出生地、生肖、“毗底达拉”谓其幼时小名“仁波(意为明觉)”，全名仁珍嘎饶多杰(藏语“仁珍”意为持明)，如是清楚预言般，从西青寺尼达桑波菩萨与毘庐玛德化身转世智美丹增二人受沐浴搭衣，得到邬金智美多昂确吉坚参之名号冠冕，举行隆重座床仪式，被交付噶陀西青三大母寺、廿一子寺之法幢。
翁珠活佛之亲教师──迦绒巴老上师嘎桑迦措，为前代翁珠活佛之亲弟子，三年中惟持师名即迁转意义传承开悟，于密意界中流露，故老上师受封为太师。
翁珠活佛依循共同旧译教藏之传规、不共西青依怙主一世净相法之噶陀宗规，具诸多超圣别法等视传承之传规修习时，仅示表法即入心中。
翁珠活佛依止西青寺根桑尼玛、翁波刚夏让卓、迦瑟尼达、西青玛德、堪钦阿嘎旺波、旺达蒋珠等上师，又先后依止诸多大依怙主，包括敦珠法王、顶果钦哲法王等上师，并敬奉修琼珠古慈诚桑波为其不共上师。抵达卫藏后住于哲蚌寺，听受五部大论，获得吉祥哲蚌寺措钦珠古之头衔，并获持果芒札仓珠古名号，享有拉让巴格西荣誉。二次归乡，第二次决意定居，建立新西青本则寺，涵盖原西青寺体系，保存法教和资产。1997火牛阴年，藏历牛月下弦第二善日(初七)，尊者以76岁高龄，示现胜者涅盘坐姿中狮子卧式，伴随啥声，粗大色身剧缩、心意消融光明法界中。遗体火化时，长达数日天乐悠扬悦耳，光辉宛如丝索照映各方，良久不歇，骨化舍利、佛像等稀有事迹成为诸位具信目餍意足之甘露。
弟子乃，殊胜迦旺珠钦十二世、西青寺之转世上师迦瑟永佐、珠图丹秋林之大堪布、西青寺各部会转世上师，其余无数萨迦、格鲁、噶举、宁玛之堪布、转世珠古、善知识，彷佛金鬘般遍及瞻洲各方。
讲述著作有《密集金刚释难解疑》完整一卷、《米滂仁波切之法教解疑类详理讲规》篇长廿一纸、《不共秘密藏释》一卷、《大圆满显示赤裸见地之口诀》一卷、若干书信、《木拉寺规略说》、各种笔录等。
14.	历代殊胜依怙督格山居大师(德格仓)乃：
木拉僧团诸位转世上师不以地位分大小，而以年龄分老少，以戒腊区别长幼，大金刚阿阇黎之重责落于谁人，尊其为首。阿里班禅贝玛旺迦尝云：“注重真传与智慧。”有如是相应经续之教规而尊重先师之优良道统。督格大师接掌要任已，合一统筹木拉僧院与修院，持有所有寺院、修院之教法幢，逐渐演增成历代督格珠古。
§ 第一世督格活佛(德格仓)：名为洛桑饶吉。公元1853第十四遶炯下半年，生于谢琼村，为父亲督玛威坚、母亲玛萨屋督二人之子，大成就者强巴秋珍等金刚预言认定为三世间之怙主──圣者观世音菩萨化现之游舞，乃由养育化机、护教利生发心极净之力诞生，绰有令誉“圣怙人中之狮洛桑饶吉”其啸吼犹如夏鼓雷音响彻十方。殊胜大士本身传记彷佛汪洋般超越思诠，为提起虔信仅略述一二，其于18岁时醒悟轮回万法无毫许实义、惟观无常故舍离轮回诸事，离家前往下阿坝县贺明大师座下，闻受般若波罗蜜多施身法灌顶、引导、口诀次第，往诣一千处泉水、尸陀林不定处修持深义施身断法窍诀。
20岁时，于第八世格尔德洛桑称列(1849-1904)座下受近圆戒，以正知正念不放逸严谨持戒、清净不染失堕，恒时以出离、厌离心策励心续，舍世耽着。其相续盈满菩提心而于所有优劣化机，宛若慈母怜子般大慈大悲欣乐授予法施，出离世间八法之贪恋并截断四魔之傲慢，入于离戏般若佛母之密意界中，获证原始佛位冠冕。复于胜道三学处、般若六度、四摄事等如海般佛子菩萨之景行，夙夜奋发、恒恭精进，不稍解其身束带，昼间不懈惟行法度日，夜间三段亦废寝不寐，惟行善业与修持，毕生如一日，未尝逾越。为所有寻求庇护者随其意愿赐予加持等，承担诸佛菩萨德行大海之重任。
公元1885年，督给山居大师岁32，应木拉蒋丹等师兄之邀往木拉，至尕、交两处之交界称为“羊圈”处，其地灵杰，实帮助善法与禅定之宝土，加持已始筑一山中伽蓝，辟建山林、架屋筑室，首发安顿、次育法行，彼时以师纯净发心倂其业愿力故，逐时成熟化机，木拉八大府营等遍方众多上师、活佛、善知识厥如蜂聚莲苑般纷至沓来。
木拉黑账营若许人亦迁居此地，众筑己所。于中央建立观音殿，新制寺规，寺名曰“督格山居寺(督格僻静处)”。凡入寺者，修行为主，终生持断食斋戒，一日餐语，一日断食禁语，二日一轮，反复行之，禁酒、肉、五辛。每朝寅时(3-5点)受戒、修法；辰时过半(8点)早斋，禁食日则行长拜；巳时修法毕用膳，未申(2-5点)修法，酉时过半(6点)制擦擦或水供，戌时(7-9点)修法毕寐。寺有年迈比丘、行者几人，日寐三小时，余咸致力佛法，习禅修法等，堪为楷模。
大善知识恰上师吉美达吉、恰上师金巴迦措二昆仲莅此，二者系智德兼备之圣士，恒致力于讲修学三轮(自学、自修、利他弘法三者)之业，不分宗派受持、守护、弘扬教法珍宝，着重教法根基毗奈耶律藏。堪布吉美达杰华桑波为十多位沙弥比丘剃度传戒，金巴迦措上师承接夏居负责人之担，打下结夏安居与布萨斋戒等毗奈耶之基础。徒众随各需求讲闻修显密教法等弘扬教证二法。
督格大师不染丝毫世间诸事、俗家经忏等喧嚣，无有传讲、受法时，终生闭关，惟积资念修度日。
大班禅第九世莅此时，夏沃山居大师、督格山居大师(督格活佛)耳聆其美誉故，广施断食斋戒经函语所依物，二师等人复为其常转法轮、莲足坚稳，献上十万次断食八关斋戒之曼荼罗(200多人进行三年，合109500次)，大班禅嘉许彼等无垢严持温萨耳传 之宗风，札什伦波寺与班禅大师府授予夏沃慈南仓、督格山居大师二者等同札什伦波寺密续院金刚阿阇黎资格，颁赐手谕与黄色披衣。公元1935年83岁时，督格大师告众曰：“二位喇嘛(金巴和吉达)已归逝，吾当欲与子等同住些时，然犹疑至今，今查珠仁波切等住世尚久，但死且欢。”语毕示疾，受持断食八关斋戒、供养、顶礼、制作佛像擦擦等无余依旧，时值西青寺果瑟氏喇嘛札西迦措适此，师予一锭五十两大元宝、净白哈达，曰：“今伽蓝无主，尔等西青诸师须助，管理此木拉僧团关房。” 如此交代。督格活佛在世时，主张木拉僧院与僻静关房合并。约莫其时，阿琼康萨村首领康万清委员长兄弟(康万清、康克明兄弟)殷勤劝请故，督格活佛传下大悲观音苦难自解脱大灌顶，此灌顶俱为大师毕生首次与末次灌顶，黄河之山阴山阳二处拥聚求法者，为众圆满传竟，同年箕宿月六月上弦初四吉日，受八关斋戒禁语，当日晨间课诵如昔、圆满陈设供养、顶礼百余次，外出施水食子时，虚空满溢虹光，虹光毫端直射至房顶，众咸目睹。归返寮房时以手示意掩扉，示现色身归摄法界之相，入定三日，出定已荼毘。其后，诸方所至外地求法者、寻庇佑者悉各归乡。查珠活佛领僧俗二众商议，木拉僧团与木拉关房(斗盖日朝)并为木拉总寺。
§ 第二世督格活佛(德格仓)：名为强巴确札。公元1936年生于谢琼村，为父亲琼迦、母亲嘎准二人之子，于普布觉大师强巴本洛仁波切座下，三次金瓶掣签观察而认定，赐名强巴确札。7岁时于木拉寺举行坐床典礼，堪钦强秋坚参与木拉喇嘛索根二人为其亲教师，乃俱生悲智特法之圣者，学习基本课诵、书写通达易晓。11岁出家学习戒定慧三学，于诸多上师座下闻受灌顶、口传、窍诀。18岁时往拉卜楞寺习经论。20岁返木拉寺为众传授长寿灌顶与诸多教言引导后，复往拉卜楞寺。21岁习般若时期，富辩论之美名。公元1958年23岁时，密意归于法界示寂。
 
§ 第三世督格活佛(德格仓)：
འདུག་དགེ་སྤྲུལ་སྐུ་ཨོ་རྒྱན་གསུང་རབ་བཟང་པོ།
★督格活佛邬金松饶桑波
名为邬金松饶桑波。公元1973第十六遶炯水牛年，生为父亲索波诺布、母亲慕尔萨炯波之子，自幼本俱慈悲等纯净善行，任何行止循善从良故，小名唤“桑波(贤善)”。授记中云：“此转世系身语意三化现所生。”督格二世强巴确札授予此世化身之授记乃：“父亲索波诺布，前格尔德寺之僧人，素擅长念诵，乃住于谢琼村之经忏师。”发此授记函，督格二世召三世之父诺布曰：“子前来。”诺布遂适之。师告曰：“尔为寺僧，深谙寺风，欲寻征问。”语毕，详尽商议，旋系自念珠于其身曰：“吾此珠授汝，俟有需时。”言毕欣然。此念珠今存复化身松饶嘎滇手中，盖前世以来缘起相合而致。康仓大师噶旺卓德林巴伏藏授记云：

自处近郊尕波山脉中 贤敏诺布庄严之缘起 堪为群英具足悲智者
依于多罗悲意之凉荫 备五色邬巴拉花韶龄 黄袍饰身为僧利教生

如是乃圣观世音之授记。循此，公元2010年藏历09月01日遍智六世嘉木样活佛洛桑吉美图登确吉尼玛尊者亦认定尊者为第二世德格仓真实化身，颁赐邬金松饶桑波为名号冠冕。六世嘉木样活佛及中央宗教指导批准为转世活佛。
公元1983年，11岁于木拉活佛丹增桑波座下学习念诵时，尊者为圣者转世故轻易通达，复广闻前行积资净障按持明之传轨修持，并诸视传承、科判、仪轨、念诵、旋律等，以及所有康仓大师伏藏法之灌顶、口传、引导等。于诸多圣者座下进行闻思。14岁时于翁珠活佛座下获受沙弥戒，取名松饶嘎滇，并于座前闻受《入菩萨行论广释》等。于西青寺毘庐蒋样滇贝坚参座下闻受敦都多杰、龙萨宁波二者之灌顶。
20岁往诣吉祥拉卜楞寺，于大善知识蒋样尼玛上师、赤巴根敦迦措、阿克札西迦措、赤钦贡塘六世滇贝旺秋等座下闻受诸多灌顶教法，于六世贡塘仓活佛座前获三次时轮金刚灌顶，并修习若干年。公元2002年30岁往喇荣佛学院，承侍法王如意宝堪布晋美朋措炯内与众多善知识，进行闻思学习，循次获得广大灌顶、口传、窍诀。公元2019年03月22日于遍主佐钦白玛格桑法王座下闻受大圆满上师心滴、大圆满耳传广释。法王意极欣乐，随而摄受成为法王心子之一，其心秉正知正念、不放逸而严谨持戒，饱具胜道三学处之功德，恒勤于舍离、念诵三轮之事业，不逾越胜士之禀性，于世出世间法具广大远见。木拉寺大恩传承上师贡秋上师以慈悲授予督格仓所有康仓藏大师之不共法传承。今为甘肃省甘南州玛曲县木西合乡木拉寺(禅定法轮)主持上师，兼木拉寺寺务管理主要负责人，活佛委之往汉地各大城市都邑，并马来西亚、新加坡等国家地区弘法布道，凡此期间，凡结缘众均获暂久利益。尊者如同众多高僧大德，以闻、思、修，讲、辩、着等勤护、广弘如来教、证二法。
15.	木拉历任堪布乃：
木拉僧团虽成立已久，因僧侣与咒师共住故，无法举行三毗奈耶仪轨(夏住、长净、解制) 之常规。督格山居院始为僻静处，虽有僧众然前期无法结夏安居。自佐钦寺二位恰伏藏大师之子和查喇两兄弟来诣，僧众由此期间始行若干年布萨。往昔结夏安居时，须赴他处接受，今诸上师密意一致故，于木拉本地殷重实行结夏安居法。
首次举行结夏安居之缘起乃，祈请众所敬戴之上师西青玛德、珠古、堪布安住，令彼欢喜而允。
时名华措之成就者，倾荡资产，尽供寺院，为数有三也。初次供养，支应木拉夏居，清算资财时，供养了牛毛帐篷并诸财物，乃至私畜犬狗，咸作清净供养，复供养寺院喇嘛必需装束，其余尚有：十匹马、二匹骡、二只犬、三十匹牝牦牛、百只牦牛、百余只绵羊、大笔银钱、若干匹绸缎，据云有大小诸多牛毛帐篷。
给予诸位结夏安居者大殿帐、黑牛毛厨帐、法衣、祖衣、敷具，并提供斋供基金。于此初次结夏安居受供之堪布、阿阇黎、连同施主檀越极其圆满之故，时人称为“最富有之结夏安居”时期，遂成一词。
其后，督格山居大师等圆寂，尔后，诸山僧生计转艰，然为护教利生能舍身命之清风亮节至高无上，彼等勇猛精勤不断，严持木拉夏居布萨之稀有传记辈出繁多。
 
1) 首任堪布：西青毘庐玛德珠古洛桑智美丹增。其同为西青寺之堪布与金刚阿阇黎，乃索甲仁波切之传人，依彼发心故，索甲仁波切于岁59木虎年(1914)春受邀造访木拉。仁波切首立木拉寺玛哈嘎啦怙主与普巴橛修法，复为木拉寺取出〈怙主略祀〉之密意伏藏，该年毘庐玛德亲任结夏安居戒律堪布，设置木拉夏居，自购善种良质合规之钵盂、犍椎、净瓶等毗奈耶资具，供养木拉寺作为公产，木拉寺与西青寺当时有八十位僧众接受结夏安居律仪，遂有“木拉八十僧众之称”(木拉僧团当时有数百位在家咒师和出家沙弥，然未行结夏安居)。
2) 第二任堪布：堪钦吉达。生为恰伏藏大师之子，年幼出家，精通一切显密明处，于佐钦寺与多竹钦寺求学成为堪布，现舍事沙门相安住。
3) 第三任堪布：堪钦珍巴。生为恰伏藏大师之子，年幼出家，精通一切显密明处，于佐钦寺与多竹钦寺求学成为堪布，乃至圆寂之间，于木拉僻静处安住、受持大乘断食律仪，现舍事沙门相，于此其间，两兄弟轮值担任木拉寺堪布至于圆寂。
4) 第四任堪布：堪钦根嘎列桑。即杂果查祖活佛二世，于杂果寺从根嘎日秋受出家戒，于觉囊囊塘寺等闻思经论大海，担任若干年木拉寺堪布，其传记已于前述。
5) 第五任堪布：堪钦图巴。即西青措果仓，任西青红堡洲之寺院上师，西青喇章寺之结夏安居管理人等职，极为尊贵，曾任一、二年木拉夏居之堪布。
6) 第六任堪布：堪钦嘎卓仁波切。年幼出家，于西青寺与噶陀寺修学，成为安臧珠巴之心子，毕生舍弃坐骑与肉食，财食献予僧众，自不谋取，为木拉寺诸位转世活佛之上师以及夏居之堪布。
7) 第七任堪布：堪钦蒋秋坚参。年幼出家，终生修行，长时担任木拉寺之堪布。
8) 第八任堪布：堪钦贡秋慈诚。年幼出家，入拉加寺僧团，向夏沃慈南求受近圆戒，于木拉寺诸位堪布不能亲临时代理堪布，并长时担任现职堪布，往后世代更迭之时，木拉僧团仍不间断结夏安居、受持布萨律仪，全为其功绩。
9) 第九任堪布：堪钦根嘎确佩。为一圆备贤、正、良三者之士夫，与堪钦贡秋慈诚二人轮替而长时任职。
10) 第十任堪布：堪钦丹增桑波。共许为殊胜化身，于年10岁任职堪布，为诸青年授予戒律学处，于总体寺院之恩德极深，其传记已于前述。
11) 第十一任堪布：堪钦桑巴伦珠，又名图登钦列迦措。年幼出家，诣西青拉章香巴林中，尊奉西青玛德仁波切为根本上师，获授权为金刚阿阇黎，于教法兴隆时期担任堪布长达十年。
12) 第十二任堪布：堪钦丹巴饶吉。西青翁珠活佛与康仓大师之弟子，持戒清净、精通寺院各种仪式，为僧俗二众所尊敬。
13) 第十三任堪布：堪钦图登迦措。为木拉宗嗣，西青翁珠活佛与康仓大师乃其主要上师，通晓律藏，此二位堪布轮替长达近二十年。
14) 第十四任堪布：堪钦根瑟或称图登华滇桑波，于喇荣佛学院获得堪布学位。
往昔堪布年史有阙漏故，2014年堪钦桑巴伦珠与堪珠丹增桑波二人进行详究并正确编述。
 
16.	木拉寺古代大德乃，前后所述之木拉地方贤哲成就者，以及

	











མུ་ར་དགོན་པའི་བླ་མ་རྣམས། འདུག་དགེ་སྤྲུལ་སྐུལ་བཟང་པོ། འདུག་དགེ་བསྟན་འཛིན་ཉི་མ། མུ་ར་སྤྲུལ་སྐུ་མཆོག 
རིག་འཛིན་ཆེན་པོ་པདྨ་དབང་ཆེན། ནག་ཥེ་བློ་བཟང་བསྟན་པའི་ཉི་མ། འཇུ་སྤྲུལ་ཐུབ་སྙན། ཨ་སྐྱོང་དོན་ལེགས་དང་ཨ་ཁུ་ལགས།
★木拉大德众，由右至左1. 督格桑波活佛2. 丹增尼玛3. 贡秋活佛
4.仁珍千宝活佛5. 图年活佛6. 安度纳克7. 阿琼敦列8.阿克喇
1) 木拉秋则透美 
2) 木拉秋则格桑札西 
3) 督格山居大师时期八大府营上师乃
① 督格仓 (德格山居大师)      	② 恰喇仓 (恰喇二位堪布)
③ 查喇仓 (杂果查祖二兄弟)	④ 华喇仓 (华措珠钦上师)
⑤ 祖喇仓 (噶陀仁珍千宝)  	⑥ 特特仓 (大成就者阿克特特)
⑦ 喇嘛仓 (木拉喇嘛家族) 		⑧ 阿巴仓 (木拉咒士家族)
木拉八大菩萨当中，木拉索勒为西青玛德认定为普贤菩萨之化身(因此八大府营上师与八大菩萨有别，古代八大府营上师有各自本营、佛堂、僧团、信众、牧场)。 
4) 大成就者咕、那：大成就者咕咕日巴之转世木拉阿甘，
以及大成就者那波巴(黑行者)之转世噶陀仁珍千宝‧究美饶殿 
5) 西青寺依怙主翁珠活佛 
6) 准噶尔堪布活佛格桑南迦
7) 木拉夏珠或称智慧活佛洛桑贡秋
8) 木拉活佛丹巴迦措 
9) 荣塔喇让巴活佛
10) 木拉那图登 等于地方有贡献、有名诸学者。
于此佛法兴盛之时期，四位重要教法代表乃：
§ 木拉喇嘛梭勒：马年1906-1982年，享寿77岁。本名索南坚参，为西青寺活佛玛德仁波切之心子大士，修持三学处之道，为不染过失之高僧、修持二次第之成就者，智慧于二实相宛如虚空般完全了达自在者，终生恒以修行为主并作念诵，常受断食斋戒等法行，惟以慈悲带领僧俗二众，深德难以述说。
 
§ 查祖格列活佛：
 
ཛ་མགོ་ཚ་སྤྲུལ་བཤད་སྒྲུབ་དགེ་ལེགས་རབ་གསལ།
★杂果查祖谢珠格列饶瑟活佛
公元1941第十六遶炯之金蛇年，生为父亲咒师云滇迦措、母亲木拉萨路吉之子，由蒋哇玛德与西青玛德洛桑智美丹增二人认证，取名为谢珠格列饶瑟华桑波，于本寺举行隆重坐床仪式，年满8岁，从阿喇贡仁波切处求受出家，以三欢喜依止堪布嘎卓仁波切、上师钦饶沃瑟仁波切等，开始进行林珠大师所造之皈依解释等前行法并圆满累积五十万次，圆满《入行论》本颂之闻思传讲以及相关根本颂、注释，复能忆持，修学无量无边菩萨之行止。从西青寺活佛根桑尼玛圆满闻受敦都多杰、龙萨宁波、北岩藏三者之灌顶教诫，进行三根本念修与相关生圆次第。复于其他圣者大士座下求受众多灌顶、引导、窍诀之次第，心续充满胜道三学处，其行显然为名符其实之持教大士。为寺院大殿建造一千五百尊药泥塑背亮度母像、铜合金千佛像、释迦牟尼佛本生传九幅唐卡，并制诸多供养物，表示长养众生之福德、诸佛之身语意所依加持光辉耀洒等众多含意。尤其背负木拉僧俗二众重任，包括封山薮泽禁止渔猎等环保之行，提倡放生布施等清净善法，戒断烟酒盗匪等弃恶之行，调解口舌纷争等安定社会之行等恒常精勤匪懈，如是广大护教利生，一生中担任寺院住持直至圆寂，亦任政协会委员与寺管会主任，末后公元1999土兔年，岁59于吉祥拉卜楞寺示寂，密意归摄法界。

 
§ 木拉贡秋乎活佛丹增桑波：
 
   སྤྲུལ་སྐུ་མཆོག་བསྟན་འཛིན་བཟང་པོ།
★木拉贡秋乎活佛丹增桑波
父亲木拉宗嗣梭朋之子，名为朋南，或作口语 “浑涅”，以及母亲究萨东波，于1940金龙年生为二人之子，年方16，西青寺珠古根桑尼玛进行敦都多杰、龙萨宁波、北岩藏灌顶口传时，尝谓曰：“斯子乃恰喇嘛吉达之转世，不论如何，有朝一日必饶益此寺。”如是言般，以三律仪长养心续，连接自宗噶陀西青派之仪轨法行唱诵乐器传规，复为法教寺院故供施所有物资，嘎卓仓上师、康仓取藏师、西青翁珠活佛等心意甚欢而作摄受，不吝施予无漏语甘露，获得广大灌顶、口传、窍诀之次第。乃黄金传承之秤毫不染违誓垢秽，耳传水流汇一而持有之大士，将僧俗二众之教政掬于掌中，以灌顶、口传、窍诀养育木拉僧俗二众，并调解他处与木拉等部落之口舌纠纷，颁令所有边郊封山薮泽禁止渔猎，历尽艰难为木拉诸位先逝上师大德之转世设立法床，其广传当于他处了知。担任寺院金刚上师，亦任政协会委员与寺管会主任。
§图年活佛根桑沃瑟：
 
སྤྲུལ་ཐུབ་སྙན་ཀུན་བཟང་འོད་གསལ། 
★图年活佛根桑沃瑟
1950金虎年诞生，由西青寺活佛根桑尼玛认定为恰喇嘛金巴迦措之转世，授予根桑沃瑟滇贝尼玛之名号冠冕，于上师嘎卓仓、康仓伏藏大师、西青翁珠活佛、董查伏藏大师等诸多上师座下闻受灌顶、口传、窍诀之次第，以密咒金刚乘门二次第殊胜瑜伽，随化机有情众之愿望赐予加持，以纯净意乐圆满僧俗二众之共同利益，成为康仓伏藏大师与白玉噶玛洽美仁波切之传人，长期担任县政协会委员、宗教局木拉寺管委会主人。如授记般，返回白衣咒士身分后应机取出伏藏，谙熟瞄压引焚等现行猛渡之业，乃至迁渡亡者、助佑生者等为社会祈福作为己任。其余八大府营诸位转世活佛，亦成办广大护教利生事业故，祈祷诸尊莲足经劫坚稳安住！
 
17.	历代木拉咒师乃，木拉家族诸多二次第自在之咒师中，稍许讲述为木拉诺诺多杰札丹又称为怙主战神黑鼻之转世；木拉多杰洛强之传记中记述之大咒士肯他本；多竹钦法王传记中所记载木拉诺诺之子禄嘉本；嘉木样协巴第四世传记中记述木拉万甘丹吉；曜魔罗睺罗护法服侍如仆之木拉给根；木拉喇嘛邬金图多为所有西青转世活佛之亲教师；木拉咕噜成就吉祥怙主大黑天玛哈嘎啦，令护法天王如亲友般护持；木拉邬金贡波念诵众会怙主咒语数亿遍成就念修之量；木拉梭朋被公认为吉祥怙主众会主玛哈嘎啦之转世；木拉德拉曲华多杰念诵观音心咒数亿遍亲谒圣尊观世音成就；木拉纽玛沃瑟证悟大圆满密意；木拉邬秋喇嘛与曜魔罗睺罗护法如同人与人般相伴；木拉老咒师索南确佩为能转换有形无形等自在成就四事业之大力咒师，宛如大鹏鸟群翔空般转世不断降临。
                          
  	ཡེ་ཤེས་མགོན་པོ་ཕྱག་བཞི་པ།   			      དཔལ་ལྡན་ལྷ་མོ་རེ་མ་ཏི།
    ★智慧怙主四臂玛哈嘎啦		         	        ★吉祥天女瑞玛德
 
18.	木拉名媛仕女：
白乐公主：诞生为白乐王臣喇敦南开仁钦之宗嗣，称白乐公主。上半生为蒙古王妃，生下木拉诺诺等子嗣，为梭托僻静处之领主。下半生惟修持佛法，成就卓越。此外，木拉觉嫫才娀姬、准噶尔活佛之母督萨希萝、西青翁珠活佛之母谢琼萨康卓措等诸多剎生、俱生空行母之事业亦发展于木拉家族中。
19.	木拉寺现今学者乃：
1) 拉让巴格西督格丹增尼玛：公元1967第十七遶炯之火羊阳年孟冬(藏历十月)上弦初十，生为父亲木拉诺桑、母亲梭萨日朝吉二人之子，幼时于其叔公阿克克洛或称蒋扬索南坚参上师，以及伯父堪布桑巴伦珠二人座下学习念诵、闻习前行十法。康仓大伏藏师嘎旺卓督林巴之伏藏预言中记载

自处寂林禅定法洲中 圣者悲意周遍清凉光 牟尼方便圣地名智慧
圣者加持意化化身者 教法光辉名为瑟惹雅 清丽戒律芳英绽其华
运握三慧韶华之庄严 禅定法洲胜教趋益上

以如是等圣者观世音之授记预言称颂之。年13于吉祥拉卜楞寺大学者顶严拉墨根敦迦措跟前求受沙弥戒，修持三学处之道。公元1987火兔年，往诣哲蚌寺果芒札仓僧院，公元1988年氐宿月，举办入寺仪式，依止果芒第79任堪布云滇当确尊者、西青翁珠活佛、果芒前任堪布阿旺尼玛等，彻骨穿石般衷心求习摄类学乃至五部大论，长达五年求习般若大经部。
于果芒札仓僧院中进行慈氏大论彻夜辩论，于哲蚌寺大会中，精进努力进行二十种僧伽比喻与四品般若之起座对辩等。公元1995木亥年进行般若立宗对辩，受颁第一级之般若燃江巴学士学位。依循木吞果芒札仓僧院之传规，彻底学习中观、俱舍、毗奈耶之完整论颂。
公元1997年新季中观班始时，于法王座下求受近圆戒。
公元2002第十七遶炯水马年于拉萨祈愿大法会中，通过寺院认可，受颁拉让巴格西学位。于法王座下闻受十八部菩提道次第相关注释，学习许多经部法门，又闻受诸多密续法门，如《密宗道次第》、《五次第明灯》，广受法语甘霖。法王授其《龙钦七宝藏》、《多珠钦滇贝尼玛全集》之书籍曰：“尔寺系属旧译宁玛，尔往楚西仁波切座下求受灌顶、口传、窍诀等，为善焉。”厥循其言，于楚西仁波切座下获受《七宝藏之言教》、《满愿妙瓶》、《窍诀宝藏论》、《心滴根本颂》等诸多灌顶教言与口诀。
复于噶陀墨查仁波切座下获受《宁玛教言》、《大宝伏藏》，以及敦都多杰与龙萨宁波二者等诸多灌顶口传与窍诀。于西青寺毘庐仁波切座下获受敦都多杰与龙萨宁波二者若干法类、心滴前行《普贤上师言教》、龙萨前行之注释言教等。于顶果钦哲法王、成就自在贝玛诺布法王座下求受诸多大密咒之窍诀。于圣怙西青饶将仁波切座下闻受《根钦吉美林巴全集》以及《巴珠仁波切全集》之口传，闻受诸多心滴法类。于敦珠法王子听列诺布座下闻受诸多敦珠法类之三根本灌顶口传，以及诸多口诀部法要。于滇玛洛确仁波切座下闻受《穆札百法》灌顶。于噶陀老堪布索南滇巴座下求受噶陀前行与西青法类之甚深口诀教授引导等。总之，彻底闻受无分新旧宗派浩汤无际之法流。
西青尼达桑波活佛札迦仁波切为噶陀莲师初十法会之功德主，西青各寺院(西青有廿一分寺)诸位上师活佛当时于旧译宁玛之祖庭噶陀寺初十大法会中会晤时，噶陀黄金宝座之持有者──圣怙香炯活佛、圣怙墨查活佛、噶陀堪钦阿琼仁波切之转世桑杰茨让活佛、蒋扬活佛、洛嘎活佛等通过商议之结果──噶陀法脉中仅有督格一人往诣山居格鲁派之要寺吉祥哲蚌寺，完整求习五部大论，受颁拉让巴格西学位。如是倍赞嘉许，因而噶陀寺颁赐身口意所依物、密乘完整供养法器、宝剑、班智达帽、完整僧衣连同丰厚供养，封其班禅之位。其人本身持戒清净、广学经论，于世界各地弘扬教法。
2) 大阿阇黎噶陀仁珍千宝‧贝玛旺晴：于本寺与近百位大德座下学习诀窍，在台湾师范大学学习中文，澳大利亚巴拉特大学哲学学士，多所大学客座教授，建立三宝所依物与佛寺等贡献，有十六本着作以及十几本未完稿。
3) 阿炯东瑟敦列：入木拉寺学习，于喇荣和瑟修寺进修，成为多玉妥寺住持之一，是木拉寺上师。
4) 那开罗桑滇贝尼玛：入木拉寺学习，於喇荣和瑟修寺进修，为安度寺住持宝座。
5) 贡秋坚参：入木拉寺学习，于龙卡尔寺、色拉寺、隆务寺等处进修，为木拉寺上师。
6) 贾修慈诚桑杰：入木拉寺学习，于哲蚌寺果芒札仓僧院进修，受颁般若燃江巴之学位，成为后来噶陀寺首座。
7) 多让巴格西蒋样索南：入木拉寺学习，于吉祥拉卜楞寺进修，受颁最优秀多让巴格西学位。
8) 钦饶迦措噶久格西：入木拉寺学习，于甘肃佛学院毕业，哲蚌寺果芒学院学习五部经论，受颁噶久格西学位。
9) 喇荣堪布木拉根桑：入木拉寺学习，喇荣佛学院与木拉寺授予堪布学位，为喇荣佛学院最精通显密教法之堪布。长期于喇荣等各寺讲经说法，著作四本，现任木拉佛学院教务主任。
10) 木拉堪布尼可：入木拉寺学习，于喇荣佛学院进修，受颁木拉寺堪布学位。
11) 木拉医生图登威瑟：入木拉寺学习，于拉卜楞寺学习经论、医学、算命、梵文。
12) 木拉般若格西强贝究美：入木拉寺学习，于哲蚌寺果芒学院进修，受颁般若燃江巴学位，现正就读中国北京高级佛学院。
13) 般若格西桑杰迦措：入木拉寺学习，于西藏色拉寺和隆务寺进修，受颁般若燃江巴学位，正于寺院就读中观、释量、律藏、密续。
20.	木拉各部禅修院纪年：主要有山中或禅洞各自修行闭关处，有闭关者进行闭关时，木拉寺供其学习和生活资源。任何外寺来访者，居住期间，从属本寺管辖，当守寺规。
◎秋隆禅修院：
   
　　　དཀར་པའི་ཆོས་ལུང་མཐོན་པོ། བདེ་མཆོག་ནོར་བུའི་ཕོ་བྲང་།		      གྲོགས་འཛོམ་རི་ཕྱོར་མཐོན་པོ།
★秋隆高峰、胜乐珍宝宫殿			   ★日秀山神(金刚猛王母)
1) 院名：尕地高法原、胜乐珍宝宫殿。始于公元八世纪，公元1672年前后有关房。
2) 特色：系大悲观音、胜乐金刚、八大法行之圣地，莲花生大士与伊喜措嘉空行母曾居住。内有诸多天然佛像、经文、掌印等，富产药物、净相殊异、成就摄生术(辟谷术、金丹术)，此处享有“跃入空行净土之门”美誉。 
3) 朝圣：值猴月或胜生土龙年时，随时可朝圣。修持观音、八大法行、真实意、胜乐金刚瑜伽女，荟供、闭关之惯例，朝圣者若专一于坚信与清净心，必获加持。事业顺遂、身体健康、无碍成就。
 
《莲师空行秘密要点》记载：

见此逆缘障碍消 修持获所欲成就 具信入于解脱道 善缘唤醒觉悟土
比丘养成禅定地 瑜伽施展密行境 持明履及先德迹 即生成佛之圣地

以及，西青寺根桑尼玛曰：

修 行持精进获成就 觉 证德增若上弦月 礼 转绕勤勉净业障
处 结缘引入持明土 荟 供养圆满大资粮 处 他方一月之修持
境 此域一日尤迅疾	

如是说。
4) 禁忌：非时勿登山顶，勿碰山上神坛、供神台，发甲不许落此处，勿说不吉利语，应敬自生像，非寺方允许，不得携走土石草木(必须寺办仪式)
5) 授记预言：

空行秘密之要点 邬金大师加持之 安多廿五圣地首 狮子倨傲琉璃山
东方金刚萨埵处 南方文殊身之谷 西方马头大怀窟 北方降傲暴虐山
周边八大法行教 近区护法财神处 咕如莲师王臣众 加持化身汇集处
为利生故埋众藏 玛隅秋隆正法土 邬金境域无差别 结缘此处成俱福
进行修持何须言 外为观世音剎土 内为法轮胜乐处 密为真实意坛城
极密金刚妃婆伽 云云
 
6) 历史：八世纪咕如莲师与伊喜措嘉空行莅此修持，多珠钦法王授记预言曰：

吉 胜乐地之近处中 主 圣者观音莲花手
近 八子示现善识相 经 密咒法器举高空

以及，给勒敦珠林巴大师曰：

吉 真实胜处秋隆地 怙 莲师父母赐加持
法 财宝伏藏富孕育 处 于此修持速成就

如是云。

公元1672年前后，木拉给根根嘎朋措适此处修持。
1709土牛年，遍智嘉木样协巴一世返回安多时，于此立神坛供养。
1771年多珠钦法王一世廿五岁时，据云在此前后闭关三年，亲谒圣者大悲观音等无数本尊海会。
1789年西青寺依怙主索南华滇(翁珠活佛二世)来此朝圣。
1850年前后，谢琼格西居此作礼赞文。
1860年前后，迦仓上师确吉僧给尊者于此开悟，净相中亲谒金刚瑜伽母坛城，参与空行聚会，作礼赞文。
1867火兔年格尔德洛桑称列诣此，作供神礼赞文。
1955年西青寺根桑尼玛于此闭关作礼赞文，亲谒金刚瑜伽母。
 
2006火狗年亚青寺成就自在阿秋喇嘛重新开启圣地之门而认定曰：

外为三怙主圣地 内为胜乐金刚土 密为八法行坛城

总之，宁‧尼玛沃瑟之传承法嗣，西青寺历代诸师咸至此闭关清修。觉囊派蒋哇玛德活佛、安曲大师钦饶迦措、大成就者阿克特特、敦珠伏藏大师么子多杰札都、准噶尔堪布等于此修持闭关。阿吉伏藏大师卡确林巴、多仁波切瑟诺吉巴多杰、敦珠伏藏大师孙子索南德赞等于此取出伏藏。木拉本地所有上师活佛咸来此修持闭关素为惯例。




	
							


	



མུ་ར་ཚང་གི་མེ་ཏོག་འཚལ།
★木拉家族花园
 
◎督格禅修院：
 
ཐུགས་ཆེན་སྨྱུང་གནས་ཁང་།					   སེངྒེ་སྒྲའི་སྒོམ་ཁང་།
★观音斋戒殿					     ★狮吼观音洞
1) 院名：督格禅修院、东方广弘释教洲。始于公元1885木鸡年。
2) 特色：系殊胜依怙督格山居大师洛桑饶吉毕生当中进行修持之主要据地，为其受持万余次断食八关斋戒，以及亲自制作十万佛像、千万擦擦处。此地亦为木拉八大菩萨修持处，臧巴大师、大成就者佐钦日巴等言此地为观音菩陀洛山净土。此地复为西青翁珠图登龙德迦措、根秋活佛、南岩大成就者、荣塔喇让巴活佛等诞生地。
3) 朝圣：此地有观音殿、阿克仓与德格仓供施水食子之加持成就水，饮用成就水能强身益体、疗养心风等心疾。若转绕白色佛塔能息曜魔祸障等害损。
4) 禁忌：此地禁携荤食、烟酒等，所有居住此处者，一律必持断食八关斋戒。
 
5) 授记预言：
多珠钦法王(1745-1821)之授记曰：

吉 胜乐地之近处中 主 圣者观音莲花手
近 八子示现善识相 经 密咒法器举高空

如是八大菩萨化身以及木拉诸营上师广开利他事业大门。臧巴大师强巴确增誉为观音菩萨之圣地。
6) 历史：
1653年藏历08月五世达赖喇嘛往北京中原时经过此处，据云为镇地故筑白色佛塔。
1771年多珠钦法王一世25岁前后至秋隆岩时，于此安居修持，筑迭石屋，其迹仍存。
1885第十五遶炯木鸡年，督格活佛等诣此修持一段时日，便云游四方。
尔后，木拉蒋丹等迎温萨耳传大师──圣怙督格活佛一世洛桑饶吉，辟筑山居。
1897土牛年木拉若干师传汇合为一，成木拉主寺。外地参学之上师、活佛、僧伽众涌云集，众多上师缘故，得名“木拉喇嘛寺”。木拉八大菩萨，以及咕、那(咕咕日巴、那波巴)两位大成就者建立关房弘扬佛法。
公元1922水狗阳年，西青寺依怙主四世──大成就者翁珠活佛，本名仁珍嘎饶多杰，密名白玛旺札诺布、比丘名图登龙德迦措华桑波，于此诞生，认定后首搭法衣、封活佛名、设宴款待处。
1980年开放寺庙。
1981藏历金鸡年，为查祖格列饶瑟仁波切首度领办莲师初十法会，于木拉区宣布信仰自由之地。
◎果喇禅修院：
1) 院名：法螺岩洞、果喇禅房、狮吼宫殿。1771年多珠钦法王来时已有修行人。
2) 特色：冬暖夏凉，狮吼观音加持处，恶龙病所害者悉获良益，早期诸多痲疯病患赴此修持康复。
3) 朝圣：顶礼朝拜、潜心修佛一至七日等，于此结缘苦病得瘳者，史多记述，服抹圣土于防重疾具殊效。
4) 禁忌：据云此处多居龙族故，禁食荤腥，不能焚焦污灶，多蛇当谨慎，勿伤生灵。
5) 授记预言：阿克特特仁波切于此亲谒狮吼观音时，遍方悉成大悲观音净土，岩洞长期流出甘露，结缘者悉得观音加持摄受。
6) 历史：
1885年前后，阿克特特仁波切为痲疯病所苦，上师黑札巴札西坚参告曰：“据云木拉系往昔多竹钦法王等赐予加持，令众多痲疯病患痊愈之地，尔当往该处修持。”彼旋遵师令寻往其处，于十二年间修持亲谒狮吼观音，见处所成为观音净土、禅修洞成为观音圣殿，圣殿上安住狮吼观音，右手流降甘露入其顶中，身盈清凉喜乐，翌日身体消肿、肌肤稚嫩，病乃瘳。再度修持时，复谒圣容，狮吼观音如是授记：吾予子共同成就，尔具业缘之不共本尊为金刚瑜伽女，生世具宿业缘之根本上师为查格隆(察给弄)大师，由之求受灌顶口传可即生获证殊胜成就。汝当救护诸痲疯病患，于此圣地结缘亦获观音摄受。阿克特特仁波切如是修持即生获得双运之果位。
其后，一位果喇嘛亦为痲疯病所迫，终生于此修持痊愈，故此岩洞亦称果喇修行洞。
 
◎达悟禅修院：	
           
ས་བཙན་དཀར་བོའི་རྟ་རྔོག 				     བཙན་རི་དབང་ཆེན་རོལ་བ།
★马头洞窟尕若危神达悟		           ★马头洞窟危神大怀游戏
1) 院名： 格萨尔马鬃红岩山、尕若危神达悟、危神大怀游戏。
始于公元八世纪，公元1672年前后有关房。
2) 特色：
此处禅修洞极多，具有咕噜莲花生大士、空行伊喜措嘉、法王赤松德赞、安朗迦哇秋样等之禅修洞，系空行伊喜措嘉佛母观修顿超之处，其顶印、手印、背印等清晰可见。岭‧格萨尔王之赤色白嘴神驹之新鬃毛献予护马神圣日曼达处。
敦珠法王子索南德赞之《莲师预言莲花印》记载：“西方称作马鬃红岩山处，乃为大怀殊胜马头游戏宫，藏有一亿大怀续部处，此为莲师父母之修洞，莲师父母留下身印、手印。亦为安朗嘉华秋扬之修洞，岩山之顶石堡中，具有法王赤松德赞显现为马头明王，马嘶鸣响瞻部洲之处。下方孜玛入药叉等危神宫殿中，护法恒常安住，化遣十万部危神兵旅。”如是云。
3) 朝圣：于岩洞上、中、下三处内献供、顶礼、转绕有巨益，尤其念修莲花语之种姓：拔除轮回大悲观音、马头明王、红度母、作明佛母等，祀祷危神种姓孜玛入药叉等，极善。
4) 禁忌：此处多事故，成为危神之地，勿横卧路间、小路中不许休憩，血肉腥膻等不许焚焦污灶、面向圣地不许排解、大帐篷门不向圣地、小路处勿搭帐篷、未经供神不开掘土地、不许撬坏石头、禁伐木、泉水处不排解、勿说不吉利语、禁恶语争讼，行抵该处，最初面向圣地念马头明王咒祈祷除障，朝圣毕未回向不能背山离去。
5) 授记预言：
索南德赞授记曰：“此乃莲花语之处，结缘成就怀业始。后世取藏大师成就者次第降临，开启莲花语伏藏，利生遍布瞻部洲，诣此结下善缘者，有朝投生莲花光剎土。”如此授记。
6) 历史：
公元八世纪，咕噜莲花生大士、空行伊喜措嘉、法王赤松德赞、安朗嘉华秋扬等于此观修莲花大怀胜马头游戏尊之法门。尔后，岭‧格萨尔王诺布札德来此，乘赤色白嘴神驹，修持胜马头游戏。
1771年前后，诸在地关中行者迎请多珠钦法王莅此修持。
1885年前后，杂果查祖根嘎列桑活佛诣此，修持马头明王成就。
大成就者黑行者转世仁珍究美饶殿，修持马头明王显现成就验相。
蒙古果列喇嘛洛佩措迦以摄生辟谷术长住洞中等极多稀有史事。
2006年火狗年亚青成就者阿秋喇嘛认定为咕噜莲师圣地而重启圣地。
 
◎秋尕禅修院：








                                          	
 
      ཆུ་དཀར་བྲག་ཕུག ནོར་བདག་བྲག འཛམ་དཀར་གནས།		        སྐུ་ལུང་འཇའ་ཚོན་ཕུག།
   ★秋尕财神岩洞、白臧巴拉圣地	                 ★文殊閰魔敌彩虹洞
1) 院名：秋尕岩洞、财神岩洞、白臧巴拉圣地、格萨尔温泉等。
2) 特色：此处有诸多往昔大德修持岩洞，具多种寒水石矿物，格萨尔温泉等疗治百病泉水，于此净供、埋藏宝瓶将增财受用，温泉沐浴亦可净治皮肤病。
3) 朝圣：于此修药师佛、臧巴拉等财神法速获成就。
4) 禁忌：不可随意触摸供神台、勿掘土、不能伤害生灵与植株、舍酒肉等荤食，未经寺允不可携离矿物水石。
5) 授记预言：
《莲师预言莲花印》记载：“莲师药师佛加持之温水，珍宝岩山堆聚药叉财神海会殿，其内蕴藏增业法门一亿部。”如是云。
 
6) 历史：
岭‧格萨尔王温泉中含多座古代矿化石床，后山为三堆如意宝堆起之山形，其上乃修财神最胜宝地。
1771年前后，诸在地关中行者迎请多珠钦法王莅此修持。
1885年前后，杂果查祖仁波切根嘎列桑，每岁适此浴泡温泉，病痛息灭、容光焕发。
大成就者黑行者转世仁珍究美饶殿于此修持黑金刚忿怒母时，亲谒智慧空行母。
木拉施身法成就者卡洛雅佩于此修施身法期间，出现各种魔障时，不忘清净见地而于诸魔中胜利。
1957火鸡年，西青寺根桑尼玛和阿喇贡仁波切重启伏藏圣地之门，安上神坛与供神台，为息灭情器各种衰败而埋下伏藏宝瓶。
2006年火狗年亚青成就者阿秋喇嘛认定为药师八如来圣地而重启圣地。
 
◎达日禅修院：
          
	         མདའ་རའི་སྒོམ་ཁང་། གེ་སར་སྒྲུབ་ཁང་།			  དགེ་བསྙེན་རོལ་བ་སྐྱ་བརྒྱད།
★箭库山洞、格萨尔禅房		      ★居士骑士八神护法游戏
 1) 院名：箭库禅房、格萨尔禅房、花椒口岩洞、圣地山基禅房、洛萨师关房等。
2) 特色：冬暖夏凉、易具生活顺缘、修持人较少障碍、顺遂吉祥之圣地。
3) 朝圣：此圣地于自生圣母或瑞玛德(吉祥天女)圣地山脚下，亦为居士骑士八神护法游戏安住之圣地，合适修供度母、妙音天女、吉祥天女等诸空行母。
4) 禁忌：注意环境卫生，保护此山上生物，尤其蛇与鸟类系护法观物，不可伤害。
5) 授记预言：
《莲师预言莲花印》记载：“安宁护法金刚猛烈王母或自生王母之宫殿，彷佛心脏竖起之巍峨圣山，周边有傲神八部，格萨尔王箭库、弓库、武器库等等。”
 
6) 历史：
 
གླིང་གི་སོ་དིལ་མཐོན་པོ།
★格萨尔侦察台
此岩洞左侧与右侧山谷各称格萨尔王箭库、弓库，僻静处后山称格萨尔王武器宝藏库，山顶称格萨尔王侦察台(羌人烽火台)等，具诸多与勇士岭‧格萨尔王有关连之名称处，左右山脚山谷入口极窄、内部宽敞，天然形成一易隐蔽之处，乃岭‧格萨尔王时代之武器大宝库，跨越此山，另一处为格萨尔温泉，具有多座古代矿化石床，珍宝堆栈之殊胜财神圣地，此岩洞即称岭‧格萨尔王修行洞。
1771年前后，多珠钦法王一世根桑贤潘于此修行。
1880年前后，木拉两位大成就者，咕咕日巴转世大咒师索南确佩、那波巴(黑行者)转世仁珍究美饶殿，咕、那二人为佛法长久住世，在此修持普巴金刚。
木拉喇嘛洛萨雅洛于此居住修行廿五年，绘制木拉寺护法殿最胜、严峻、加被广大之玛哈嘎拉唐卡。喇嘛洛萨曰：“吾每一滴水诵一咒语、一滴颜料观一本尊，如此而绘时，各个本尊悉融入此唐卡，由是之故，何人虔信供养，此必与之言语。”得如是允诺具真实智慧尊安住之殊胜唐卡亦成于斯。
昔时此处埋有横死魂附体之嘎屋盒染污圣地之骇闻，1957火鸡年，西青寺根桑尼玛大师适此净化圣山、埋下诸多宝瓶、修复重启圣地。
2006年火狗年亚青成就者阿秋喇嘛认定为自生圣母(吉祥天女)之圣地而重启圣地。
       
གཉན་ཆེན་ཐང་ལྷ་རྡོ་རྗེ་འབར།			 རི་ཕྱོར་རྡོ་རྗེ་དྲག་མོ་རྒྱལ།
           ★唐拉山神		             ★安宁地母金刚猛烈王母
 
མུ་རའི་འདུས་སྡེ་གུར་སྒར་དུ་བཞུགས་པ།
★木拉集会帐营

 
མུ་རའི་གུ་རུ་སྟོང་སྐུ་ལྷ་ཁང་དང་འདུ་ཁང་།
★木拉莲师千尊佛殿与大殿
 
跋文
道之根本依止善知识 法之精要具足正知念 教之根本僧俗二部合
佛法兴盛缘起实善妙 于外三种戒律服庄严 于内二次第定达准量
秘密亲谒本初佛果位 禅定佛法之轮转动洲 见即获得解脱正法门
意之精要畅踏欢喜舞 传播讲修五生 之妙音 日月辉及之处咸利乐
乘门顶王不可思议意 本净光明大圆满境界 有漏幻躯离尘光明身
迁移深广宝诀已拥有 清净刹土所在众含识 已入空行密道之开端
见闻想触尘数之众生 愿于大乐净土中解脱
此乃上级干部要求广略合宜之木拉寺简史，故于2020年08月08日木拉寺管会 汇整
寺院印章						木拉行政区党支部印

