[
  {
    "id": "guruyoga_001",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": [
      "迴向"
    ],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": {
      "words": "藏 1 音節 | 中 9 字",
      "pages": "1 頁 (估算)",
      "readTime": "閱讀約 1 分鐘",
      "preview": "此祈願文之藏文內容..."
    },
    "availableLanguages": [
      "bo",
      "zh",
      "en"
    ],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "letter_001",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": [
      "迴向"
    ],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": {
      "words": "藏 1 音節 | 中 9 字",
      "pages": "1 頁 (估算)",
      "readTime": "閱讀約 1 分鐘",
      "preview": "此祈願文之藏文內容..."
    },
    "availableLanguages": [
      "bo",
      "zh",
      "en"
    ],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "biography_001",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": [
      "迴向"
    ],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": {
      "words": "藏 1 音節 | 中 9 字",
      "pages": "1 頁 (估算)",
      "readTime": "閱讀約 1 分鐘",
      "preview": "此祈願文之藏文內容..."
    },
    "availableLanguages": [
      "bo",
      "zh",
      "en"
    ],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "sadhana_001",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": [
      "迴向"
    ],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": {
      "words": "藏 1 音節 | 中 9 字",
      "pages": "1 頁 (估算)",
      "readTime": "閱讀約 1 分鐘",
      "preview": "此祈願文之藏文內容..."
    },
    "availableLanguages": [
      "bo",
      "zh",
      "en"
    ],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "勝樂註解_001",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": [
      "迴向"
    ],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": {
      "words": "藏 1 音節 | 中 9 字",
      "pages": "1 頁 (估算)",
      "readTime": "閱讀約 1 分鐘",
      "preview": "此祈願文之藏文內容..."
    },
    "availableLanguages": [
      "bo",
      "zh",
      "en"
    ],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "comlete stage_002",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": [
      "迴向"
    ],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": {
      "words": "藏 1 音節 | 中 9 字",
      "pages": "1 頁 (估算)",
      "readTime": "閱讀約 1 分鐘",
      "preview": "此祈願文之藏文內容..."
    },
    "availableLanguages": [
      "bo",
      "zh",
      "en"
    ],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "dzougchen_001",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": [
      "迴向"
    ],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": {
      "words": "藏 1 音節 | 中 9 字",
      "pages": "1 頁 (估算)",
      "readTime": "閱讀約 1 分鐘",
      "preview": "此祈願文之藏文內容..."
    },
    "availableLanguages": [
      "bo",
      "zh",
      "en"
    ],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "天相算命_001",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": [
      "迴向"
    ],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": {
      "words": "藏 1 音節 | 中 9 字",
      "pages": "1 頁 (估算)",
      "readTime": "閱讀約 1 分鐘",
      "preview": "此祈願文之藏文內容..."
    },
    "availableLanguages": [
      "bo",
      "zh",
      "en"
    ],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "密慧佛母_001",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": [
      "迴向"
    ],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": {
      "words": "藏 1 音節 | 中 9 字",
      "pages": "1 頁 (估算)",
      "readTime": "閱讀約 1 分鐘",
      "preview": "此祈願文之藏文內容..."
    },
    "availableLanguages": [
      "bo",
      "zh",
      "en"
    ],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "instruction_001",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": [
      "迴向"
    ],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": {
      "words": "藏 1 音節 | 中 9 字",
      "pages": "1 頁 (估算)",
      "readTime": "閱讀約 1 分鐘",
      "preview": "此祈願文之藏文內容..."
    },
    "availableLanguages": [
      "bo",
      "zh",
      "en"
    ],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "tara_001",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": [
      "迴向"
    ],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": {
      "words": "藏 1 音節 | 中 9 字",
      "pages": "1 頁 (估算)",
      "readTime": "閱讀約 1 分鐘",
      "preview": "此祈願文之藏文內容..."
    },
    "availableLanguages": [
      "bo",
      "zh",
      "en"
    ],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "recitation_001",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": [
      "迴向"
    ],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": {
      "words": "藏 1 音節 | 中 9 字",
      "pages": "1 頁 (估算)",
      "readTime": "閱讀約 1 分鐘",
      "preview": "此祈願文之藏文內容..."
    },
    "availableLanguages": [
      "bo",
      "zh",
      "en"
    ],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "vajrakilaya_001",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": [
      "迴向"
    ],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": {
      "words": "藏 1 音節 | 中 9 字",
      "pages": "1 頁 (估算)",
      "readTime": "閱讀約 1 分鐘",
      "preview": "此祈願文之藏文內容..."
    },
    "availableLanguages": [
      "bo",
      "zh",
      "en"
    ],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "sanscrit_001",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": [
      "迴向"
    ],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": {
      "words": "藏 1 音節 | 中 9 字",
      "pages": "1 頁 (估算)",
      "readTime": "閱讀約 1 分鐘",
      "preview": "此祈願文之藏文內容..."
    },
    "availableLanguages": [
      "bo",
      "zh",
      "en"
    ],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "history_005",
    "tibetanTitle": "༄༅། །བུ་སྟོན་ཁ་ཆེས་མཛད་པའི་ཆོས་འབྱུང་རིན་པོ་ཆེའི་མཛོད་ལས། ག་པ་འཛིན་པ་ཚེ་དབང་ནོར་བུས་ཉེ་བར་བཏུས་པ་བཞུགས་སོ། །",
    "chineseTitle": "布敦大師所撰佛法源流寶藏錄之持明才旺諾布節錄文",
    "englishTitle": "From the Treasury of Religious History by Buton Rinchen Drub Compiled by the Vidyādhara Tsewang Norbu",
    "author": "才旺諾布",
    "category": "歷史",
    "tags": [
      "佛法源流",
      "布敦大師",
      "Buton"
    ],
    "ContentTibetan": "<p class=\"tibetan-text\">༈ ཨོཾ་སྭཱསྟི། རྒྱལ་བའི་བསྟན་པ་ལ་མཁས་པའི་ཁྱུ་མཆོག་བུ་སྟོན་རིན་ཆེན་གྲུབ་ཀྱི་ཞལ་སྔ་ནས་བོད་ཀྱི་རྒྱལ་རབས་ཇི་ལྟར་བཞེད་ནི་དེས་མཛད་པའི་ཆོས་འབྱུང་གསུང་རབ་རིན་པོ་ཆེའི་མཛོད་ལས་འབྱུང་བ། མདོར་བསྡུ་ན། རྒྱ་གར་གྱི་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོའམ་གསལ་རྒྱལ་འཆར་བྱེད་གང་རིམ་ཞིག་གི་སྲས་མཚན་དང་ལྡན་པ་ཞིག་བོད་ཡུལ་ལྷ་རིའི་ཡོལ་བའི་ཁར་བྱུང་སྟེ་བཙན་ཐང་སྒོ་བཞིར་བྱོན་པ་བོད་ཀྱི་རྒྱལ་པོ་གཉན་ཁྲི་བཙན་པོར་གྱུར་ལ། དེ་ནས་རིམ་པར་གནམ་ལ་ཁྲི་བདུན་གྲགས་པ་བྱུང་ཞིང་། ཁྲི་བདུན་གྱི་ཐ་མ་སྲིབ་གྲི་བཙན་པོའི་སྐབས་གདོན་བོན་གཤེན་ཚ་མི་བོ་ཆེ་ཞེས་པ་བྱུང་། དེ་ནས་བར་གྱི་ལྟང་ཅིག་པ་ཡི་ལེགས་དྲུག དེ་ནས་ལྡེ་བརྒྱད་དང་བཙན་བཞི་སྟེ་དེ་རྣམས་ཀྱི་གཉའ་ཁྲི་བཙན་པོ་ནས་རྒྱལ་རབས་ཉི་ཤུ་རྩ་དྲུག་སོང་བ་ལས་རྒྱལ་པོ་ཉི་ཤུའི་རང་ཆབ་སྲིད་བོན་གྱིས་སྐྱོང་བར་གྲགས་སོ། །དེའི་མཐར་གསང་བའི་བདག་པོས་བྱིན་གྱིས་བརླབ་པའི་རྒྱལ་པོ་ཐོ་ཐོ་རི་གཉན་བཙན་བྱོན། དེ་ཡི་དགོང་ལོ་དྲུག་ཅུ་བར་ཕོ་བྲང་ཡུམ་བུ་བླ་སྒང་གི་རྩེ་ན་བཞུགས་པར་ནམ་མཁའ་ནས་ཟ་མ་ཏོག་བཀོད་པ་དང་སྤང་ཀོང་ཕྱག་རྒྱའི་གླེགས་བམ་གསེར་གྱི་མཆོད་རྟེན་རྣམས་བབས་པས་དམ་པའི་ཆོས་ཀྱི་དབུ་དེ་ནས་བརྙེས། དེ་ལ་རྒྱལ་པོས་གཉན་པོ་གསང་བར་བཏགས་ཤིང་མཆོད་པའི་བྱིན་རླབས་ཀྱིས་དགུང་ལོ་བརྒྱ་དང་ཉི་ཤུ་ཐུབ། དེ་ནས་རྒྱལ་རབས་བཞི་པ་གནམ་རི་སྲོང་བཙན་དང་དེ་ཡི་བཙུན་མོ་འབྲི་བཟའ་ཐོད་དཀར་ལ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྤྲུལ་པའི་སྐུ་དབུ་ལ་འོད་དཔག་མེད་པ་མངོན་སུམ་དུ་བཞུགས་པའི་རྒྱལ་བུ་གཅིག་མེ་མོ་གླང་གི་ལོ་ལ་འཁྲུངས་ཏེ་མཚན་ལ། ཁྲི་སྲོང་བཙན་བཏགས་དགུང་ལོ་བཅུ་གཉིས་སར་རྒྱལ་ཐབས་མཛད་དེ་མཐའ་ཡི་རྒྱལ་ཕྲན་ཐམས་ཅད་དབང་དུ་འདུས་པས་སྐྱེས་འབུལ་གྱི་འཕྲིན་ཡིག་བཀླགས། དེས་བོད་ལ་ཡི་གེ་དགོས་པར་གཟིགས་ཏེ་ཐོན་མི་སཾ་བྷོ་ཊ་རྒྱ་གར་དུ་བཏང་ནས་པཎྜི་ཏ་ལྷ་རིག་སེང་གེ་ལ་སྒྲ་བསླབ་སྟེ་བོད་ཀྱི་སྐད་དང་བསྟུན་པའི་དབྱངས་གསལ་སུམ་ཅུ་གཟུགས་ཁ་ཆེའི་ཡི་གེ་ལ་དཔེ་བླངས་ཏེ་ལྷ་སའི་སྐུ་མཁར་དམར་རུར་བཀོད་ཅིང་དེ་ཡི་ཆ་རྐྱེན་སྒྲ་ཡི་བསྟན་བཅོས་བརྒྱད་མཛད། དེར་རྒྱལ་པོས་ཀྱང་ལོ་བཞི་ཡི་བར་མཚམས་བཅད་དེ་སྒྲ་ལ་སྦྱངས་བའི་ཚུལ་མཛད་དེ་མདོ་ཟ་མ་ཏོག་དང་དཀོན་མཆོག་སྤྲིན་རྣམས་བོད་སྐད་དུ་བསྒྱུར། དེ་ཚེ་བོད་འབངས་རྣམས་ཀྱིས་རྒྱལ་པོ་ལ་གཤེ་བ་གསན་ནས་མི་དགེ་བ་ལས་ལྡོག་པའི་དགེ་བཅུའི་ཁྲིམས་བཅོས་པས་མཚན་ལ། སྲོང་བཙན་སྒམ་པོར་གྲགས། <b>དེ་ནས་རྒྱ་གར་ཤར་ཕྱོགས་ནས་ཙནྡན་སྦྲུལ་གྱི་སྙིང་པོ་ལས་རང་བྱུང་དུ་བྱོན་པའི་སྤྱན་རས་གཟིགས་བཅུ་གཅིག་ཞལ་སྤྲུལ་པས་སྤྱན་དྲངས་བལ་པོའི་རྒྱལ་པོ་འོད་ཟེར་གོ་ཆའི་སྲས་མོ་ཁབ་ཏུ་བཞེས་པས་དེས་ལྷ་མི་བསྐྱོད་རྡོ་རྗེ། བྱམས་པ། ཙན་དན་གྱི་སྒྲོལ་མ་རྣམས་སྤྱན་དྲངས། རྒྱ་ཡི་རྒྱལ་པོ་སེང་གེ་བཙན་པོ་ཞེས་ཐང་གི་རྒྱལ་རབས་གཉིས་པའི་སྲས་མོ་ཀོང་ཇོ་ཁབ་ཏུ་བཞེས་ཏེ་དེས་འཕྲུལ་སྣང་གི་ཇོ་བོ་གདན་དྲངས་སོ། །དེ་ནས་ཁྲི་བཙུན་གྱི་གཙུག་ལག་ཁང་བཞེངས་འདོད་ཀྱང་བཞེངས་སུ་མ་བཏུབ་པར་བོད་ཀྱི་ས་གཞི་སྲིན་མོ་གན་རྐྱལ་དུ་འགྱེལ་བ་འདི་གནས་དགོས་པར་གཟིགས་ནས་དཔུང་པ་གཡས་པ་ཀ་ཚལ། གཡོན་པ་ཁྲ་འབྲུག ཀོང་པ་གཡས་པ་གཙང་འབྲམ། གཡོན་པ་གྲཾ་པ་རྒྱང་སྟེ་གཙུག་ལག་ཁང་བཞི། གྲུ་མོ་གཡས་ལ་ཀོང་པོ་བུ་ཆུ། གཡོན་ལ་ལྷོ་བྲག་ཁོ་མཐིང་། སྤུས་མོ་གཡས་ལ་ཀ་བྲག གཡོན་ལ་པྲ་བདུན་རྩེ་སྟེ་མཐའ་འདུལ་བཞི། ལག་མཐིལ་གཡས་ལ་བྱང་འཚལ་གྱི་རླུང་གནོན། གཡོན་ལ་ཁམས་ཀྱི་འདན་ཀློང་ཐང་སྒྲོན་མ། རྐང་མཐིལ་གཡས་ལ་མང་ཡུལ་བྱམས་སྤྲིན། གཡོན་ལ་མོན་ཡུལ་བུམ་ཐང་། སྤ་གྲོ་སྐྱེར་ཆུ་ལ་སོགས་པ་གཙུག་ལག་ཁང་མང་པོ་བཞེང་ནས་གདོད་འོ་ཐང་མཚོ་ལ་རྡོ་མཁར་རྩིགས། ཤིང་གིས་ཕུབ། ཀླུའི་འདམ་པས་ཞ་ལ་བྱས་ཏེ་ར་ལ་ས་བཀལ་ནས་བཏབ་སྟེ་ལྷ་སའི་གཙུག་ལག་ཁང་ར་ས་འཕྲུལ་སྣང་བཞེངས། བློ་འབུར་བྱང་མར་བཟོ་རྒྱུ་སྤུང་བ་ལ་རང་བྱོན་དུ་བྱུང་བའི་ངོ་བོ་ཐུགས་རྗེ་ཆེན་པོ་བཅུ་གཅིག་ཞལ་བཞུགས་གསུངས་སོ། །དེ་ནས་རྒྱལ་པོས་རྒྱ་ནག་རི་བོ་རྩེ་ལྔ། བྱོན་ནས་ལྷ་ཁང་བརྒྱ་རྩ་བརྒྱད་བཞེངས་སོ། །རྒྱ་མོ་ཀོང་ཇོས་ར་མོ་ཆེའི་གཙུག་ལག་ཁང་བཞེངས། དེའི་ཚེ་རྒྱ་གར་གྱི་སློབ་དཔོན་ཀུ་མ་ར་དང་། བྲམ་ཟེ་ཤམ་ཀ་ར་དང་། བལ་པོ་སློབ་དཔོན་ཤཱི་ལ་མཉྫུ་དང་། རྒྱ་ནག་གི་སློབ་དཔོན་ཧ་ཤང་མ་ཧཱ་དེ་ཚེ་དང་། ལོ་ཙཱ་བ་ཐོན་མོ་སཾ་བྷོ་ཊ་དང་། དེའི་མཆན་བུའི་དྷརྨ་ཀོ་ཤ་དང་། ལྷ་ལུང་རྡོ་རྗེ་དཔལ་རྣམས་ཀྱི་ཆོས་ཅི་རིགས་བསྒྱུར་ཅིང་གཏན་ལ་ཕབ་བོ། །རྒྱལ་པོ་དེས་ཐུགས་རྗེ་ཆེན་པོའི་སྤྲུལ་པར་གྲགས་ཤིང་ལིའི་བཙུན་པ་གཉིས་ཀྱི་ལོ་རྒྱུས་ཀྱང་ཡོད་དོ། །རྒྱལ་པོ་དེས་ལོ་དྲུག་ཅུ་རྩ་དགུ་རྒྱལ་སྲིད་བཟུང་སྟེ་བརྒྱད་ཅུ་རྩ་གཉིས་ལ་གཤེགས་སོ། །<b>དེ་དང་མཉམ་དུ་ཀོང་ཇོའི་ཞལ་ནས་ཤཱཀྱ་མུ་ནེ་ར་མོ་ཆེ་ནས་གདན་དྲོངས་ལ་འཕྲུལ་སྣང་གི་བློ་འབུར་དུ་སྦོས་སྒོ་ལ་ཞ་ལ་གྱིས་ལ་འཇམ་དབྱངས་བྲིས་ཤིག་གསུངས་ཏེ་ཁྲི་བཙུན་དང་མཉམ་དུ་གསུམ་ཀ་ཐུགས་རྗེ་ཆེན་པོ་ལ་ཐིམ་པའམ་འདས་སོ། །བློན་པོ་རྣམས་ཀྱིས་ཀྱང་ལྷ་གཉིས་བརྗེས་ཏེ་ཞལ་ཆེམས་ལྟར་བྱས་སོ། །རྒྱལ་པོ་དེའི་སྲས་མང་སྲོང་མང་བཙན། དེའི་སྲས་གུང་སྲོང་གུང་བཙན། དེའི་སྲས་འདུས་སྲོང་མང་པོ་རྗེ་དེའི་སྲས་རླུང་ནམ་འཕྲུལ་གྱི་རྒྱལ་པོ། དེ་ཡི་སྲས་ཁྲི་ལྡེ་བཙུག་བརྟན་ཏེ་དེ་ལྷ་ས་མཁར་བྲག་སོགས་བཙུག་ལག་ཁང་བརྒྱད་བཞེངས། བྲན་ཀ་མུ་ལ་ཀོ་ཎ། མྱག་ཛྙཱ་ན་ཀུ་མ་ལ་རས་མདོ་སྡེ་ལས་བརྒྱ་པ་དང་གསེར་འོད་དམ་པ་བསྒྱུར། རྩིས་དང་སྨན་དཔྱད་ཅི་རིགས་ཡང་དར་བར་བྱས། དེའི་སྲས་འཇང་ཚ་ལྷ་དབོན་ལ་རྒྱ་ཡི་རྒྱལ་པོའི་སྲས་མོ་གྱིམ་ཤང་ཀོང་ཇོ་བླང་བར་རྒྱལ་པོའི་སྲས་གཤེགས་པས་མེས་དང་ལྷག་ཏུ་འདུས་པ་ལས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་རྣམ་འཕྲུལ་ཁྲི་སྲོང་ལྡེ་བཙན་ས་ཕོ་རྟ་ལ་བལྟམས། དེ་ཆུང་ངུའི་དུས་སུ་རྒྱ་ཡི་ཡུལ་དུ་སང་ཤིང་སོགས་མི་བཞི་ཆོས་ཚོལ་བར་བཏང་བས་ཆོས་དང་ཧ་ཤང་གཅིག་བཅས་བོད་ཡུལ་དུ་སླེབས་ཀྱང་ཤུལ་དུ་རྒྱལ་པོ་གཤེགས་ཤིང་རྒྱལ་བུ་ནར་མ་སོན་པས་བོན་བློན་རྣམས་ཀྱིས་ཆོས་བྱེད་དུ་མི་སྟེར་བའི་ཁྲིམས་བུ་ཆུང་བཅས་པས་སང་ཤིའི་ཆོས་རྣམས་རེ་ཞིག་བྲག་ལ་སྦས། སླར་རྒྱལ་བུའི་ན་ཆུང་ཟད་སོན་ཏེ་རྒྱལ་སྲིད་མཛད་པའི་སྐབས་སང་ཤིའི་རྒྱལ་བུའི་སྙན་དུ་ཆོས་གསོལ་བར་དགྱེས། དེ་དང་མཐུན་པར་རྦ་གསལ་སྣང་མང་ཡུལ་གྱི་སོ་ཁར་ཡོད་པ་ཡང་འཁོར་ཏེ་རྒྱལ་པོ་ལ་ཆོས་བགྱིད་པར་གསོལ་བའི་འགོས་ཀྱི་བློ་གྲོས་ཀྱི་མ་ཞང་མཆད་དུ་ལོ་གསུམ་བཅུག་སྟེ་དེའི་རིང་གསལ་སྣང་ཨ་ཙཱརྱ་བོ་དྷེ་ས་ཏྭ་སྤྱན་འདྲེན་བཏང་ནས་མང་ཡུལ་དུ་ཕེབས་པ་ན་བློན་པོ་གསུམ་བསུ་བར་བརྫངས་ནས་རིམ་པས་བོད་དུ་བྱོན། ཕོ་བྲང་བྲག་དམར་དུ་རྒྱལ་པོ་མཇལ་འཕྲད་མཛད། ཕོ་བྲང་རླུང་འཚུབ་དུ་ཟླ་བ་བཞི་ཡི་བར་མཁན་པོས་ཆོས་བཤད་པས་བོད་ཀྱི་ནག་ཕྱོགས་ལྷ་འདྲེའི་ཆོ་འཕྲུལ་དང་བློན་པོ་བོན་ལ་དགའ་བ་རྣམས་ཀྱིས་ཆོས་བཤད་དུ་མ་སྟེར་བས་རེ་ཞིག་མཁན་པོ་བལ་ཡུལ་དུ་བསྐྱལ། <b>དེ་ནས་རི་ས་ཤིག་ལོན་པ་ན་གསལ་སྣང་རྒྱ་ཡི་ཡུལ་ཆོས་འཚོལ་བ་དང་། སང་ཤིང་མཁན་པོ་སྤྱན་དྲངས་བར་བརྫངས་ཤིང་། སླར་ཡང་གསལ་སྣང་རྒྱ་ནས་འཁོར་ཏེ་མཁན་པོ་སྤྱན་འདྲེན་ཆེད་དུ་བསྐྱར་དུ་བརྫངས་པས་མཁན་པོ་བོད་དུ་ཕེབས། བསམ་ཡས་ཀྱི་ས་འདུལ་མཛད་པས་ལ་ཉེ་རྟེན་འབྲེལ་ཤིན་ཏུ་ལེགས། འོན་ཀྱང་བོད་ཡུལ་གྱི་ལྷ་འདྲེ་གདུག་པ་ཆེ་བས་དེ་དག་ཇི་བཞིན་འདུལ་བར་མ་བཟོད་པས་ཨོ་རྒྱན་གྱི་མཁན་པོ་པདྨ་སཾ་བྷ་ཝ་སྤྱན་དྲོངས་ཤིག་པར་ལུང་བསྟན་རྒྱལ་པོས་དེ་སྤྱན་འདྲེན་པར་ཕོ་ཉ་བདུན་བཏང་ནས་སློབ་དཔོན་གྱིས་མཁྱེན་ཏེ། མང་ཡུལ་དུ་བྱོན་པ་དང་མཇལ་ནས་རིམ་པས་ལྷ་སྲིན་དམ་ལ་བཏགས་ཀྱིན་བསམ་ཡས་སུ་ཕེབས། སློབ་དཔོན་གྱི་ས་ཕྱོགས་སུ་མཁན་པོས་ས་བཅད་མཛད་ཨོ་ཏནྟ་པུ་རིའི་གཙུག་ལག་ཁང་ལ་དཔེ་མཛད་དེ་མེ་མོ་ཡོས་བུའི་ལོ་ལ་རྨང་བཏིང་སྔོན་དུ་ཨཱརྱ་པཱ་ལོ་བཞེངས། ས་མོ་ཡོས་ཀྱི་ལོ་ལ་ཚར་ཞེས་གསུང་ཀྱང་མཁས་མཆོག་བུ་ལྟ་བུ་ལ་འཁྲུལ་པ་རགས་པ་འདི་ལྟ་བུ་གང་ལ་མང་། དེ་ནི་ཡིག་མཁན་གྱི་ལོ་ཁམས་ནོར་བར་མངོན། བསམ་ཡས་ལ་པདྨ་སམ་བྷ་ཝ་དང་བོ་དྷེ་ས་ཏྭ་གཉིས་ཀས་རབ་ཏུ་གནས་པ་མཛད། ལོ་དེའི་ཕྱི་མ་སད་མི་བདུན་རབ་ཏུ་བྱུང་། དེ་ནས་སློབ་དཔོན་ཆེན་པོ་ཡི་མངོན་པར་ཤེས་པའི་མཐུ་དང་རྫུ་འཕྲུལ་གྱིས་བློན་པོ་རྣམས་གུ་དོག་པས་རྒྱལ་པོ་ལ་ནན་གྱིས་ཞུས་ཏེ་རྒྱ་གར་དུ་བརྫངས། གཞན་རྒྱ་གར་གྱི་སློབ་དཔོན་བི་མ་ལ་མི་ཏྲ། བྷཱུདྡྷ་གུ་ཧྱ། ཤིནྟཾ་གཪྦྷ། བི་ཤཱུདྡྷ་སིངྷ། ཡོ་ག་མཁན་དྷརྨ་ཀིརྟི་སོགས་སྤྱན་དྲངས། སད་མི་བདུན་སོགས་ལོ་ཙཱ་རྣམས་ཀྱིས་ཆོས་རྒྱ་ཆེར་བསྒྱུར། འབྲུག་ལོ་ཕོ་བྲང་གདན་དཀར་དུ་བཞུགས་པའི་སྐབས་བོད་དུ་འགྱུར་བའི་ཆོས་རྣམས་དཀར་ཆག་གིས་གཏན་ལ་ཕབ། <b>དེ་ནས་མི་རིང་བར་མཁན་པོ་བོ་དྷེ་ས་ཏྭ་ཡང་ཞི་བར་གཤེགས། དཔལ་དབྱངས་སློབ་དཔོན་དུ་བསྐོས་ནས་སྦ་ཡེ་ཤེས་དབང་པོ་ལྷོ་བྲག་ཏུ་བསྒོམ་པར་གཤེགས། དེའི་འོག་ཏུ་ཧ་ཤང་དང་ཆོས་ཀྱི་རྩོད་པ་བྱུང་བར་མཁན་པོའི་སློབ་མ་ཀ་མ་ལ་ཤཱི་ལས་ཧ་ཤང་བཏུལ་ནས་རྒྱ་ནག་ཏུ་བརྫངས། ཡེ་ཤེས་དབང་པོ་ཁམས་ཀྱི་ཟས་སྤང་སྟེ་གཤེགས། མངའ་བདག་ཡང་དགུང་ལོ་དྲུག་ཅུ་རྩ་དགུ་པ་གཤེགས་པར་གསུངས་ཏེ་ས་རྟ་ལ་འཁྲུངས་གཤིས་མེ་སྟག་ལ་གཤེགས་པར་མངོན། དེ་ནས་སྲས་མུ་ནེ་བཙན་པོས་ཆུ་སྟག་ལ་རྒྱལ་སྲིད་བཟུང་། བསམ་ཡས་སུ་མཆོད་པ་ཆེན་པོ་བཞི་བཙུགས། བོད་འབངས་ཀྱི་ལྟོག་ཕྱུག་ལན་གསུམ་སྙོམས། ཆབ་སྲིད་ལོ་གཅིག་དང་ཟླ་བདུན་གྱི་མཐར་ཡུམ་གྱིས་དུག་བཏང་ནས་གཤེགས། དེ་ནས་གཅུང་ཁྲི་ལྡེ་བཙན་པོ་ལོ་བཞི་པ་རྒྱལ་སྲིད་གཏད་པས་སད་ན་ལེགས་གྲགས། དེས་སྐར་ཆུང་རྒྱལ་སྡེའི་གཙུག་ལག་ཁང་བཞེངས། ཆོས་ཀྱི་སྲོལ་ཆེར་མཛད། དེ་ལ་སྲས་ལྔ། ཁྲི་རལ། གཙང་མ། ཁྲི་དར་མ། ལྷ་རྗེ་ལྷུན་གྲུབ། ཁྲི་ཆེན། དེ་ལས་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོའི་སྤྲུལ་པ་རལ་པ་ཅན་དགུང་ལོ་བཅོ་བརྒྱད་པར་ཆབ་སྲིད་བཟུང་། ཕོ་བྲང་འོ་འཇང་དོ་བཞེངས། རྒྱ་ལ་དམག་དྲངས་ཏེ་བཅོམ་ཞིང་སླར་རྒྱ་དང་དུམ་བྱས་ནས་ལྷ་སར་རྡོ་རིང་བཙུགས། དེ་ནས་དགུང་ལོ་སོ་དྲུག་པ་ལྕགས་མོ་བྱ་ལ་བློན་པོས་བཀྲོངས་ཏེ་རྒྱལ་སྲིད་ལ་གླང་དར་མ་བཞག དེ་ནར་སོན་པ་དང་སངས་རྒྱས་ཀྱི་བསྟན་པ་ལ་གནོད་པ་ཆེར་བྱས། དེ་ནས་རིངས་ཤིག་ན་ལྷ་ལུང་དཔལ་གྱི་རྡོ་རྗེས་རྒྱལ་པོ་སྡིག་ཏོ་ཅན་དེ་ལྷ་སའི་རྡོ་རིང་གི་ཡི་གེ་ཀློགས་པར་ཡོད་པས་དེར་བསྒྲལ། རྒྱལ་པོ་དེ་ཡི་བཙུན་མོ་ཆུང་མ་ལ་སྲས་གཅིག་བྱུང་བ་མཚན་མོ་མར་མེའི་འོད་ཀྱིས་བསྲུང་བས་འོད་བསྲུང་དུ་གྲགས། ཆེན་མ་ལ་ཁྱེའུ་སྐྱེས་མ་ཐག་སོ་ཅན་ཞིག་བྱུང་བ་ཡུམ་བརྟན་གྲགས། གནམ་ལྡེ་འོད་བསྲུང་ལོ་དྲུག་ཅུ་རྩ་གསུམ་པར་གཤེགས་ཤིང་། དེ་ཡི་མ་སྲས་ཉིས་ཁྲི་བཀྲ་ཤིས་བརྩེགས་དང་། ཁྲི་ཉི་མ་མགོན་ཡིན་ལ། ཉི་མ་མགོན་མངའ་རིས་སུ་གཤེགས་ཏེ། དེ་ལ་སྲས་གསུམ། ཆེ་བ་རིག་པ་མགོན་མར་ཡུལ་གྱི་བདག་པོ་དང་། འབྲིང་བ་བཀྲ་ཤིས་མགོན་སྤུ་རོང་གི་བདག་པོ། ཆུང་བ་ལྡེ་གཙུག་མགོན་ཞང་ཞུང་གི་བདག་པོར་གྱུར། <b>ཆུང་བ་ལ་སྲས་དྲང་སྲོང་དང་འཁོར་ལོ་ལྡེ་གཉིས་སྟེ་མགྱོགས་མིང་དུ་སྲོང་ཁོ་རེར་གྲགས་སོང་ངེ་རབ་ཏུ་བྱུང་བ་ལ། མཚན་ཡེ་ཤེས་འོད་དེ། དེ་ཡི་ཁྱིའུ་བློ་རྣོ་བ་ཉི་ཤུ་རྩ་གཅིག་རྒྱ་གར་དུ་བཏང་བ་ལ་བཅོ་བརྒྱད་ཚད་པས་ཤི་ཞིང་གཉིས་བོད་དུ་ལོག་པ་ལ་ལོ་ཆེན་རིན་ཆེན་བཟང་པོ་དང་ལོ་ཆུང་ལེགས་པའི་ཤེས་རབ་སྟེ་བསྟན་པ་ལ་ཤིན་ཏུ་ཕན་པར་བྱུང་། གཞན་ཡང་པཎྜི་ཏ་མང་དུ་སྤྱན་དྲངས་ཤིང་། མདོ་སྔགས་ཅི་རིགས་པ་བསྒྱུར། ཁྱད་པར་ཡོ་ག་དང་གསང་འདུས་རྩལ་དུ་བཏོན། པཎྜི་ཏ་སྨྲྀ་ཏི་ཡང་བལ་པོ་བརྒྱུད་བོད་ནས་མདོ་ཁམས་སུ་གཤེགས་པ་འདི་སྐབས་ཡིན་པར་སྣང་། གཅུང་ཁོ་རེའི་སྲས་ལྷ་ལྡེ། དེ་ལ་སྲས་གསུམ་འོད་ལྡེ་དང་། ཕོ་བྲང་ཞི་བ་འོད། བཙུན་པ་བྱང་ཆུབ་འོད་སྟེ་བྱང་ཆུབ་འོད་ཀྱི་འབད་པས་ཇོ་བོ་རྗེ་བོད་དུ་སྤྱན་དྲངས་པས་བཀའ་དྲིན་ཤིན་ཏུ་ཆེ། བསྟན་པ་ཕྱི་དར་མདོ་ཁམས་ནས་བྱུང་བ་ནི་སྔར་གླང་དར་གྱིས་བསྟན་པ་བསྣུབ་པའི་སྐབས་སུ་གཙང་གཡོ་རྨ་གསུམ་གྱིས་གླེགས་བམ་ཇི་སྙེད་པ་བསྣམས་ཏེ་ཁམས་སུ་བྲོས་ཏེ་བཞུགས་པ་ལ་མོས་པས་སྤྱོད་པའི་ས་པ་དམུ་ཟི་རབ་གསལ་ཞེས་རབ་ཏུ་བྱུང་བས་མཚན་དགེ་བ་རབ་གསལ་བཏགས། ཤེས་རབ་ཆེ་བས་ཕྱིས་བླ་ཆེན་པོ་དགོངས་པ་རབ་གསལ་དུ་གྲགས། རབ་ཏུ་བྱུང་བའི་ལོ་ཕྱི་མར་སྔར་གྱི་མཁན་སློབ་དང་རྒྱ་ནག་ཧ་ཤང་གིས་ཁ་བསྐང་བྱས་ཏེ་བསྙེན་པར་རྫོགས། བསྙེན་པར་རྫོགས་ནས་ལོ་ལྔ་ལོན་པ་ན་དབུས་གཙང་གི་སྡེ་མི་བཅུ་མདོ་ཁམས་སུ་བྱོན་ནས་གཙང་པ་ལ་བསྙེན་པར་རྫོགས་པའི་བཀའ་དྲིན་ཞུས་པར་བླ་ཆེན་པོར་ཞུས་ཞིག་པ་བསྩལ་བས་ཁོང་རྣམས་བླ་ཆེན་པོ་ལ་དགེ་སློང་གི་དངོས་པོ་བསྒྲུབ། ཁོང་རྣམས་བོད་དུ་ཡོང་ནས་ཀླུ་མེས་སོགས་དབུས་མི་ལྔ་ཡི་དབུས་སུ་གནས་གཞི་ཐ་དད་རྩིགས་ཤིང་། ལ་སྟན་སོགས་གཙང་པ་ལྔ་ཡི་གཙང་དུ་གནས་གཞི་ཐ་དད་བཟུང་སྟེ་རྒྱལ་བ་ཤཱཀྱའི་བསྟན་པ་ལ་རྒྱས་པར་བྱས་སོ། །<b>འོན་ཀྱང་བླ་ཆེན་པོའི་མཁན་བརྒྱུད་དང་དབུས་གཙང་མི་བཅུའི་སྡོམ་པ་བླང་བའི་མཁན་པོ་ལོ་རྒྱུས་མི་མཐུན་པ་ཡོད་འདུག་ལ། དེ་ཡང་འདི་སྐད་ཅེས་འབྱུང་སྟེ་ཁ་ཅིག་ན་རེ་མཁན་པོ་བོ་དྷེ་ས་ཏྭའི་མཁན་བུ་རྦ་རཏྣ། དེས་ལྷ་ལུང་རྣལ་འབྱོར་དབྱངས། དེས་བླ་ཆེན་པོ་དགོངས་གསལ་དེས་ས་གོང་ཡེ་ཤེས་གཡུང་དྲུང་། དེས་གྲུམ་ཡེ་ཤེས་རྒྱལ་མཚན། དེས་ཀླུ་མེ་ལ་སོགས་པའོ་ཞེས་ཟེར་བ་དང་། བཀའ་ཆེམས་ཀྱི་ཡི་གེ་ཁ་ཅིག་ན་རེ། མཁན་པོ་བོ་དྷེ་ས་ཏྭའི་སློབ་མ་ད་ན་ཤི་ལ་དང་། ཛི་ན་མི་ཏྲས་བྱས་ནས་རྦ་རཏྣ་དེས་གཡོག་དགེ་འབྱུང་། དེས་བླ་ཆེན་དགོངས་པ་གསལ། དེས་སྒྲོལ་མཉྫུ་ཤྲཱི། དེས་གྲུམ་ཡེ་ཤེས་རྒྱལ་མཚན། དེའི་ཀླུ་མེས་ཞེས་འབྱུང་བ་དང་། རིག་རལ་ན་རེ། བླ་ཆེན་པོའམ་མཁན་བུ་གྲུམ་ལ་དབུས་གཙང་གི་མི་བཅུའི་སྡོམ་པ་བླང་ཟེར་བ་རྣམས་བརྟག་དགོས་སོ། །ཡང་གཡོ་ལ་སོགས་པ་རྣམས་ཁ་ཅིག་ཛི་ན་མི་ཏྲའི་མཁན་བརྒྱུད་བླང་འདོད་ཁ་ཅིག་ཞི་བ་འཚོའི་མཁན་བརྒྱུད་དུ་འཆད་པས་བརྟག་པར་བྱའོ། །དེ་ལྟར་དབུས་གཙང་དུ་བསྟན་པ་མེད་པ་ལོ་བདུན་ཅུ་བྱུང་ནས་དབུས་གཙང་གི་མི་བཅུས་བསྟན་པ་བཙུགས་པ་ཡིན་ཏེ། མི་བཅུ་དབུས་སུ་བྱོན་ཙ་ན་རྒན་མོ་ཞིག་ན་རེ་ང་ལོ་དྲུག་ལོན་པ་ན་བཙུན་པ་མཐོང་ཟེར། ཅི་ཙམ་ལོན་བྲིས་པས་ལོ་བདུན་ཅུ་དོན་དྲུག་ལོན་ཟེར་བས་སོ་ཞེས་ཟེར་ལ། ཁ་ཅིག་ལོ་བརྒྱ་རྩ་བརྒྱད་སོང་ཟེར། ཞེས་བུ་སྟོན་ཆེན་པོའི་བསྟན་པ་ཕྱི་དར་ཆུ་བྱ་ལོ་ལ་འདོད་ཞེས་པའི་གཏན་ཚིགས་ཡང་གསུང་དེ་ཡིན་ནོ། །དེ་སྐད་བུ་སྟོན་ཁ་ཆེའི་མཛད་པའི་ཆོས་འབྱུང་རིན་པོ་ཆེའི་མཛོད་ལས་རིག་པ་འཛིན་པས་ཉེ་བར་བཏུས་པའོ། །སརྦ་མངྒ་ལཾ།</p>",
    "ContentChinese": "<p class=\"english-text\">嗡娑帝<b>竊聞西藏王統之始末，據布敦仁欽竹大師所著《佛法源流寶藏》云：天竺國王色堅心王之子，具相好者，降生於雪域天幕之巔，後至贊塘四門，是為聶赤贊普。其後有天王七代，末代斯日贊普時，有本教師贊米波且者。<b>其後有朗七王，繼有德八王及贊四王。自聶赤贊至是，凡二十有六代。其中二十王以苯教治國。及後，觀世音加持之王托托日年贊即位。其六十歲時，居雍布拉岡宮，天降《華嚴經》及《手印經》并金塔，始得正法。王以為密寶而供奉之，福蔭所及，享年一百二十。<b>後四世為南日松贊，妃阿沙托嘎生一王子，乃觀世音化身，頂有無量光佛現於其身。生於丁丑年，號赤松贊。十二歲即位，諸邦歸附，進貢書信可讀。王見藏地需文字，遣禪米桑布扎赴天竺，從班智達獅子慧學習聲明，依藏語制三十音之文字，取法于闐文。於拉薩紅宮制定，並著八部文法論。王亦閉關四年修習聲明，譯《華嚴經》及《寶雲經》。<b>時藏民非議，王聞之，立十善法禁止惡業，故號松贊干布。後迎東印檀香木所現十一面觀音，納尼泊爾王子光甲女為妃，攜無動佛、彌勒佛、檀香度母等像。復納唐太宗女文成公主，攜來佛陀像。建赤孜寺，為降伏雪域大地如屍臥之羅剎女，建立四大廟、四邊寺及四隅寺，並建立布達拉宮。<b>時有天竺阿闍黎矩摩羅、婆羅門商羯羅、尼泊爾阿闍黎施羅曼殊、漢地和尚摩訶提婆、譯師禪米桑布扎及其弟子達磨戈沙、拉龍多杰巴等譯經立說。是王以觀世音化身聞名，傳有二漢僧之事。在位六十九年，享年八十二而崩。<b>時文成公主謂：“宜遷佛像自大昭寺至布達拉宮之北壁，繪文殊菩薩像。”既而與赤孜並歸寂於觀世音前。羣臣亦依遺命更易二佛之位。<b>其子芒松芒贊，子貢松貢贊，子都松莽布杰，子隆南朱爾之王，子赤德祖贊。赤德祖贊建拉薩殿八座，命班卡木拉戈那、乃若那庫瑪羅譯《百業經》、《金光明經》，復興醫算諸學。<b>其子姜扎拉翁有唐國公主金城公主，然王子先崩。後生一子具文殊菩薩化身之相，生於土馬年，是為赤松德贊。少時遣桑興等四人赴漢求法，攜經像一和尚至藏，然王已崩，太子未立，本教大臣不許行法，立禁童規，桑興藏經於巖。<b>及王子稍長掌國，桑興以法事奏聞，王悅。時惹格薩囊在芒域邊地，亦來朝覲，請弘法事。遣其入昂果智慧之門下三年習法。期間薩囊延請阿闍黎菩提薩埵至芒域，遣三臣迎之，漸至西藏。王於赤岩宮相見，於風宮說法四月。<b>然以藏地鬼神作祟，本教大臣喜奉鬼法，不得宣化，暫送大師還尼泊爾。後薩囊赴漢求法，復迎桑興和尚。薩囊自漢回，再迎大師入藏。於桑耶寺行鎮土法，因緣殊勝。然藏地邪魔難降，當迎鄔金大師蓮華生。王遣七使迎請，大師知之，至芒域相見，漸降諸魔至桑耶寺。<b>大師定基址，阿闍黎定規制，效那爛陀寺為式，己巳年奠基，先建阿里巴羅殿。雖云戊子年竣工，然此說不確，恐為書者之誤。蓮華生、菩提薩埵二師共作開光。是年後有七人出家。後因大師神通廣大，諸臣心生嫉妒，奏請王遣其還印。<b>復迎印師毗摩密多、佛陀笈多、寂藏、淨獅、瑜伽師達磨吉祥等。七士等譯師廣譯經典。辰年王居甘噶殿時，制藏地所譯經典目錄。<b>未幾，阿闍黎菩提薩埵亦入寂。立巴爾揚為師，巴耶謝旺布往洛札修行。其後漢僧與藏僧爭論佛法，請菩提薩埵弟子蓮花戒降伏漢僧，遣其還漢。耶謝旺布絕食而寂。贊普享年六十九歲而崩，生於土馬，卒於火虎。<b>其子穆尼贊普於水虎年即位，設桑耶四大供，三賜藏民財物均貧，治國一年七月，為后所毒而崩。其弟赤德贊年四歲即位，號薩那勒札。建噶瓊桂寺，大興佛法。生五子：赤繞、藏瑪、赤達瑪、拉杰倫珠、赤欽。<b>其中菩薩化身熱巴堅十八歲即位，建烏江多殿，征漢得勝，後與漢和好，立碑於拉薩。三十六歲鐵鳥年為臣所弒，立郎達瑪為王。及其長成，大害佛法。後由拉龍華多杰於拉薩碑前誅此惡王。<b>是王小妃生一子，以燈光護之，號鄔松。大妃生一子，生即有齒，號雍丹。烏松六十三歲崩。其母子系有尼赤扎西則與赤尼瑪袞。尼瑪袞往阿里，生三子：長曰日巴袞為瑪域主，中曰扎西袞為普絨主，幼曰德祖袞為象雄主。<b>幼者生昭松與廓勒德二子，廓勒德出家，號耶謝沃。選二十一聰慧童子赴印，十八人死於暑，二人還藏，為大譯師仁欽桑布與小譯師勒巴謝繞，大益佛法。又迎諸班智達，譯諸經典，尤重瑜伽密部。班智達斯密帝由尼泊爾入藏至多麻，似在此時。廓勒德子拉德，生三子：沃德、寂光沃、僧菩提沃。因菩提沃之請，迎至尊入藏，恩德甚大。<b>佛法後弘自多麻始者，初郎達瑪滅法時，藏瑜瑪三人攜經藏至康地。慕行者竇子繞薩出家，號德繞薩，智慧超群，後號大師功德明。次年以前師弟子及漢僧和尚為助緣受具足戒。受戒五年後，衛藏十人至康地，請藏人傳具足戒恩，稟告大師。彼等以大師為戒師受具足戒。<b>十人歸藏，魯美等五人於衛地各建寺院，拉敦等五人於藏地各立道場，大興釋迦遺教。<b>然大師傳承與衛藏十人受戒之師承，史有異說。或云菩提薩埵傳巴惹那，傳拉龍瑜伽音，傳大師功德明，傳薩貢耶謝雍仲，傳竹耶謝堅贊，傳魯美等。<b>又有遺教文獻云：菩提薩埵弟子達那施羅與智那密多傳巴惹那，傳約德郡，傳大師功德明，傳卓曼殊室利，傳竹耶謝堅贊，傳魯美。<b>智惹云：大師之弟子竹傳衛藏十人戒法云者，當詳考之。又瑜等或願受智那密多傳承，或願受寂護傳承，此亦當考。<b>衛藏無佛法者七十載，後十人立教。十人至衛時，有老嫗云：“吾六歲見僧人。‘問年幾何？’，答曰：‘七十有六。’”或云百有八載。布敦大師定後弘始於水雞年者，據此為證。<b>又據布敦大師所撰《佛法源流寶藏》，持明者輯錄。薩哇 芒嘎朗！。</p>",
    "ContentEnglish": "<p class=\"chinese-text\"> Oṃ Svāsti!<b>According to the lineage of Tibetan kings as related by that most excellent among the learned in the Buddha's teaching, Buton Rinchen Drub, from his work “Treasury of Sacred Scriptures on Religious History,” briefly summarized:<b>A certain prince of royal lineage from an Indian king named Rūpakāya Snying-po or Gsal-rgyal 'char-byed came forth in the valley of Lha-ri in the land of Tibet and arrived at Btsan-thang sgo-bzhi, becoming the Tibetan king Gnyan-khri btsan-po. From him, the famous Seven Celestial Thrones (gnam-la khri-bdun) appeared in succession, and during the time of the last of these seven, Srib-gri btsan-po, there appeared the demon-taming Bon priest Gshen Tsha-mi bo-che.<b>Thereafter followed the intermediate period of the Six Legs, then the Eight Lde and the Four Btsan. From Gnya'-khri btsan-po onward, twenty-six generations of royal lineage passed, and the realm of the twenty kings was renowned to be governed by Srid-bon priests. <b>At the end of this period came the king blessed by the Secret Lord, Tho-tho-ri gnyan-btsan. When he reached his sixtieth year, whilst dwelling atop the palace of Yum-bu bla-sgang, from the sky fell a golden casket adorned with flowers, the book of Pang-kong phyag-rgya, and golden stupas. Thus was the beginning of the Sacred Dharma obtained. The king reverently guarded these treasures in secret and through the blessings of his devotions, he lived to one hundred and twenty years. <b>Then came the fourth in the royal lineage, Gnam-ri srong-btsan, and his queen 'Bri-bza' thod-dkar. To them was born a prince who was a manifestation of noble Avalokiteśvara, with Amitābha Buddha manifestly present above his head. He was born in the Fire-Ox year and named Khri-srong btsan. At the age of twelve years he assumed the throne, and having brought all the border principalities under his dominion, he received tribute letters. Perceiving that Tibet had need of writing, he sent Thon-mi Sambhoṭa to India, where he studied grammar with the paṇḍita Lha-rig seng-ge. Adapting to the Tibetan language, he created thirty clear vowel and consonant signs, taking the Kashmiri script as his model, and arranged them in the Lhasa palace at Sku-mkhar dmar-ru. He composed eight grammatical treatises to accompany this system. <b>The king himself spent four years in retreat studying grammar, and translated the Ratnamegha-sūtra and Ratnamegha into Tibetan. At that time, the Tibetan subjects, hearing the king's discourse, turned from unwholesome deeds and established laws based on the ten virtues. Thus he became known as Srong-btsan sgam-po. <b>Then from eastern India, he welcomed the eleven-faced Avalokiteśvara that had manifestly appeared from the heart of a sandalwood nāga, and took as queen the daughter of the Nepalese king 'Od-zer go-cha, who brought the images of Akṣobhya, Maitreya, and the sandalwood Tārā. From the Chinese emperor Seng-ge btsan-po, second of the Tang dynasty, he took as queen Kong-jo, who brought the miraculous Jowo statue. <b>When he desired to build the Trulnang temple but found it could not be constructed, he perceived that the earth of Tibet was a demoness lying supine and needed to be subdued. Thus he built temples: on the right shoulder at Ka-tshal, on the left at Khra-'brug; on the right hip at Gtsang-'bram, on the left at Gram-pa rgyang—these four temples. On the right elbow at Kong-po bu-chu, on the left at Lho-brag kho-mthing; on the right wrist at Ka-brag, on the left at Pra-bdun rtse—these four border-taming temples. On the right palm to suppress the wind at Byang-'tshal, on the left at 'Dan-klong thang-sgron-ma in Khams. On the right sole at Mang-yul byams-sprin, on the left at Mon-yul bum-thang, and at Spa-gro skyer-chu—many temples in all. <b>At the original 'O-thang lake, he built a stone fortress, covered it with wood, made foundations with nāga-clay, filled it with earth, and constructed the miraculous Trulnang temple of Lhasa. In the upper chamber to the north, it is said that the naturally arisen embodiment of the Great Compassionate One with eleven faces took residence. <b>Then the king went to China's Wu-tai shan and built one hundred and eight temples. The Chinese princess Kong-jo built the Ra-mo-che temple. At that time, the Indian ācārya Kumāra, the brahmin Śaṃkara, the Nepalese teacher Śīlā-mañju, the Chinese master Hva-shang Mahāyāna, the translator Thon-mi Sambhoṭa, his disciple Dharma-kośa, and Lha-lung rdo-rje dpal translated and established various teachings. <b>This king was renowned as a manifestation of the Great Compassionate One, and there exist accounts of the two Chinese princesses as well. This king ruled for sixty-nine years and passed away at the age of eighty-two. <b>Simultaneously, Kong-jo spoke from her deathbed, saying that the Śākyamuni statue should be moved from Ra-mo-che to Trulnang, and that Mañjuśrī should be painted with lac on the door of the upper chamber. She, together with Khri-btsun, all three dissolved into the Great Compassionate One, or passed away. The ministers also exchanged the two statues according to her testament. <b>The sons and successors followed: Mang-srong mang-btsan, his son Gung-srong gung-btsan, his son 'Dus-srong mang-po-rje, his son the miraculous king Rlung-nam 'khrul, and his son Khri-lde gtsug-brtsan, who built eight temples including Lhasa mkhar-brag. The brahmin Kamalakoṇa and Myag Jñānakumāra translated the Śatasāhasrikā Prajñāpāramitā and the Suvarṇabhāsottama, and various sciences of calculation and medicine flourished. <b>His son 'Jang-tsha lha-dbon went to take the Chinese princess Gyim-shang kong-jo as bride, but the king's son died en route. From his father's exceptional merit came the manifestation of Mañjuśrī as a youth, Khri-srong lde-btsan, born in the Earth-Horse year.<b>When he was young, four men including Sang-shi were sent to China to seek the Dharma. They returned with teachings and a Chinese monk, but subsequently the king died and the prince had not yet come of age. The Bon ministers made laws forbidding the practice of Dharma even by children, so Sang-shi's teachings were temporarily hidden in the rocks. <b>Later, when the prince had grown somewhat and assumed royal power, he was pleased when Sang-shi requested to teach the Dharma to the prince. In accordance with this, Rba Gsal-snang, who was at the border of Mang-yul, also returned and requested the king to practice Dharma. Following the advice of his maternal uncle Mchad, he was imprisoned for three years, during which time Gsal-snang sent invitation to Ācārya Bodhisattva. <b>When the master arrived in Mang-yul, three ministers were sent to receive him, and he gradually came to Tibet. He met the king at Pho-brang brag-dmar palace. At Pho-brang rlung-'tshub palace, for four months the abbot taught the Dharma, but the dark forces of Tibet—the magical displays of gods and demons, and the ministers who favored Bon—prevented the teaching of Dharma, so the abbot was temporarily sent back to Nepal. <b>Then, after some time had passed, Gsal-snang departed again for China to seek the Dharma and pretended to invite the abbot Sang-shi. Once more Gsal-snang returned from China and again pretended to invite the abbot, whereupon the abbot came to Tibet. When he performed the earth-taming ritual at Samye, the auspicious circumstances were exceedingly favorable. <b>However, since the malevolent gods and demons of Tibet were fierce and could not be properly subdued as they were, it was prophesied that the abbot Padmasambhava of Oḍḍiyāna should be invited. The king sent seven messengers to invite him, and the master, having knowledge thereof, came to Mang-yul. Upon meeting him, he gradually bound the gods and demons under oath and proceeded to Samye. <b>In the direction where the master resided, the abbot broke ground, taking as model the temple of Otantapuri, and in the Fire-Female-Sheep year, construction began with first building the Ārya Pāla. Though it is said to have been completed in the Earth-Female-Sheep year, how could such a gross error occur to an excellent scholar like Buton? This is clearly an error in the scribe's calculation of years and elements. <b>At Samye, both Padmasambhava and Bodhisattva performed the consecration ritual. In the following year, the seven Sad-mi were ordained as monks. Thereafter, through the great master's clairvoyant powers and magical displays, the ministers became jealous and earnestly petitioned the king, whereupon he was sent back to India. <b>Other Indian masters were invited: Vimalamitra, Buddha-guhya, Śāntam-garbha, Viśuddha-siṃha, the yoga master Dharma-kīrti, and others. The seven Sad-mi and other translators translated the Dharma extensively. During the Dragon year, whilst residing at Pho-brang gdan-dkar palace, the teachings to be translated into Tibetan were definitively established through catalogues. <b>Not long thereafter, the abbot Bodhisattva also passed into peace. Dpal-dbyangs was appointed as master, and Sba Ye-shes dbang-po departed to meditate in Lho-brag. Afterwards, when doctrinal disputes arose with the Chinese Hva-shang, the abbot's disciple Kamalaśīla defeated the Hva-shang and sent him back to China. Ye-shes dbang-po departed for the borderlands of Khams, abandoning food. The sovereign also passed away at the age of sixty-nine, having been born in the Earth-Horse year and died in the Fire-Tiger year. <b>Thereafter his son Mu-ne btsan-po assumed royal power in the Water-Tiger year. He established four great offerings at Samye and equalized the wealth of rich and poor Tibetan subjects three times. After one year and seven months of rule, he was poisoned by his mother and died. Then his younger brother Khri-lde btsan-po, having been entrusted with royal power for four years, was renowned as Sad-na legs-grags. <b>He built the Skar-chung rgyal-sde temple and greatly promoted the custom of Dharma. He had five sons: Khri-ral, Gtsang-ma, Khri dar-ma, Lha-rje lhun-grub, and Khri-chen. Of these, Ral-pa-can, a manifestation of a great bodhisattva, assumed royal power at the age of eighteen. He built the 'O-'jang-do palace, led armies against China and conquered it, then made a treaty with China and erected a stone pillar in Lhasa. <b>Then at the age of thirty-six, in the Iron-Female-Bird year, he was murdered by ministers who placed Lang dar-ma on the throne. When that one came to power, he greatly harmed the Buddha's teaching. Then, after some time had passed, Lha-lung dpal-gyi rdo-rje, seeing that the evil king was present at the Lhasa stone pillar reading inscriptions, slew him there. <b>This king's younger queen bore one son who was protected by lamplight at night, hence known as 'Od-bsrung. The senior queen bore a son who had teeth at birth, and the mother's name was Brtan-grags. Gnam-lde 'od-bsrung passed away at the age of sixty-three, and his maternal grandsons were Khri bkra-shis brtsegs and Khri nyi-ma mgon. <b>Nyi-ma mgon departed for Mnga'-ris, where he had three sons: the eldest, Rig-pa mgon, became lord of Mar-yul; the middle one, Bkra-shis mgon, became lord of Spu-rong; and the youngest, Lde-gtsug mgon, became lord of Zhang-zhung. <b>The youngest had two sons: Drang-srong and 'Khor-lo lde. The latter, whose birth name was Srong kho-re, became a monk with the ordination name Ye-shes 'od. He sent twenty-one intelligent youths to India, of whom eighteen died from disease, whilst two returned to Tibet: the elder Rin-chen bzang-po and the younger Legs-pa'i shes-rab, who proved exceedingly beneficial to the teaching. <b>Moreover, many paṇḍitas were invited and various sūtras and tantras were translated. Particularly, yoga and Guhyasamāja were excellently developed. It appears that this was the period when the paṇḍita Smṛti came via Nepal from Tibet to Mdo-khams. <b>Kho-re's younger brother's son was Lha-lde, who had three sons: 'Od-lde, Pho-brang zhi-ba 'od, and the monk Byang-chub 'od. Through Byang-chub 'od's efforts, Jo-bo-rje was invited to Tibet, which was an act of exceedingly great kindness. <b>The Later Diffusion of the teaching arose from Mdo-khams. Previously, when the teaching was destroyed during Lang dar-ma's time, the three—Gtsang, Gyo, and Rma—carried whatever books they could and fled to Khams, where they dwelled. Among them, a householder named Dmu-zi rab-gsal became ordained, receiving the name Dge-ba rab-gsal. Due to his great wisdom, he later became renowned as the great master Dgongs-pa rab-gsal. <b>In the year following his ordination, he received full ordination, with the former abbot and disciples and the Chinese Hva-shang completing the quorum. Five years after his full ordination, ten men from Dbus and Gtsang came to Mdo-khams and requested the great master to grant them full ordination. When they implored him as the great master, he established the monastic discipline for them.<b>When they returned to Tibet, they established separate monasteries: in Dbus, five men including Klu-mes established different foundations, and in Gtsang, five men including La-stod established different foundations, thus greatly flourishing the teaching of the Victorious Śākya. <b>However, there exist conflicting historical accounts regarding the lineage of abbots from the great master and the ordination of the ten men from Dbus and Gtsang. The accounts say: Some claim the succession was: Abbot Bodhisattva's disciple Rba Ratna, he ordained Lha-lung rnal-'byor dbyangs, he ordained the great master Dgongs-gsal, he ordained Sa-gong ye-shes g.yung-drung, he ordained Grum ye-shes rgyal-mtshan, who ordained Klu-mes and others.<b>Certain testament documents state: The disciples of Abbot Bodhisattva, Dana-śīla and Jina-mitra, ordained Rba Ratna, he ordained G.yog dge-'byung, he ordained the great master Dgongs-pa gsal, he ordained Sgrol mañju-śrī, he ordained Grum ye-shes rgyal-mtshan, who ordained Klu-mes. <b>According to Rig-ral, whether the great master or the abbot's disciple Grum received ordination from the ten men of Dbus and Gtsang requires investigation. Again, regarding Gyo and others, some wish to follow the abbatial lineage of Jina-mitra, whilst others explain it as the lineage of Śī-ba-'tsho, which requires examination.<b>Thus it was that after seventy years without the teaching in Dbus and Gtsang, the ten men from Dbus and Gtsang reestablished the teaching. When the ten men came to Dbus, an old woman said, “When I was six years old, I saw monks.” When asked how old she had become, she said she was about seventy-six years old. Some say one hundred and eight years had passed. This accords with great Buton's reasoning that the Later Diffusion of the teaching began in the Water-Bird year. <b>Thus speaks the Treasury of Religious History composed by Buton the Kashmiri, as compiled by the Vidyādhara. <b>Sarva Maṅgalam (May all be auspicious) </p>",
    "status": "published",
    "meta": {
      "words": "藏 2761 音節 | 中 1885 字 | 英 2306 詞",
      "pages": "8 頁 (估算)",
      "readTime": "閱讀約 38 分鐘",
      "preview": "༈ ཨོཾ་སྭཱསྟི། རྒྱལ་བའི་བསྟན་པ་ལ་མཁས་པའི་ཁྱུ་མཆོག་བུ་སྟོན་རིན་ཆེན་གྲུབ་ཀྱི་ཞལ་སྔ་..."
    },
    "availableLanguages": [
      "bo",
      "zh",
      "en"
    ],
    "createdAt": "2025-05-31T14:08:00Z",
    "updatedAt": "2025-05-31T22:18:00Z"
  },
  {
    "id": "aspiration_002",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": [
      "迴向"
    ],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": {
      "words": "藏 1 音節 | 中 9 字",
      "pages": "1 頁 (估算)",
      "readTime": "閱讀約 1 分鐘",
      "preview": "此祈願文之藏文內容..."
    },
    "availableLanguages": [
      "bo",
      "zh",
      "en"
    ],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "prayer_001",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": [
      "迴向"
    ],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": {
      "words": "藏 1 音節 | 中 9 字",
      "pages": "1 頁 (估算)",
      "readTime": "閱讀約 1 分鐘",
      "preview": "此祈願文之藏文內容..."
    },
    "availableLanguages": [
      "bo",
      "zh",
      "en"
    ],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "aspiration_001",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": [
      "迴向"
    ],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": {
      "words": "藏 1 音節 | 中 9 字",
      "pages": "1 頁 (估算)",
      "readTime": "閱讀約 1 分鐘",
      "preview": "此祈願文之藏文內容..."
    },
    "availableLanguages": [
      "bo",
      "zh",
      "en"
    ],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "spontenously fuill wishes_001",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": [
      "迴向"
    ],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": {
      "words": "藏 1 音節 | 中 9 字",
      "pages": "1 頁 (估算)",
      "readTime": "閱讀約 1 分鐘",
      "preview": "此祈願文之藏文內容..."
    },
    "availableLanguages": [
      "bo",
      "zh",
      "en"
    ],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "autobiography_001",
    "sanscritTitle": "༄༅། །བིཏྱཱདྷཱརེཤྭརམཎེཿསྭབེདནངྒམཏྲཛལྤཏིསདྡྷརྨྨཱཡམཏིབརྟྟཏེཀཐམབདཱནཾཔརྤཏསྠཥནྟརསྱཽཥདྷིཔརམནཱམབིཧརཏིསྨ། །",
    "tibetanTitle": "༄༅། །རིག་པ་འཛིན་པ་ཚེ་དབང་ནོར་བུ་ཡི་རང་མྱོང་ལེགས་ཉེས་ཆ་ཤས་ཙམ་སྨོས་ཤིང་དམ་པའི་ཆོས་ལ་བློ་གཞུག་པའི་གྲོས་འདེབས་རྟོགས་བརྗོད་རི་ཐང་མཚམས་ཀྱི་སྨན་མཆོག་ཅེས་བྱ་བ་བཞུགས་སོ། །",
    "chineseTitle": "持明才旺諾布自述善惡經歷少分佛法入心之忠告自傳‧名曰山野間之妙藥",
    "author": "才旺諾布",
    "category": "自傳",
    "tags": [
      "山野間妙藥、自傳"
    ],
    "ContentTibetan": "<p class=\"tibetan-text\">མཆོད་བརྗོད་ཀྱི་སྐབས།<br>༈ ཨོཾ་སྭ་སྟི། རིགས་དང་དཀྱིལ་འཁོར་ཀུན་གཙོ་བླ་མེད་བླ་མ་མཆོག །རྒྱལ་ཀུན་ཐུགས་འཕྲིན་ལས་གཅིག་བསྡུས་འདྲེན་པ་མཚུངས་མེད་དཔལ། །ཧེ་རུ་ཀ་ཆེན་འཕུར་འགྲོ་མཚོ་སྐྱེས་རྡོ་རྗེ་འཆང་། །ཐོར་ཅོག་ཅན་ཞེས་པདྨ་འབྱུང་ལ་ཕྱག་འཚལ་ལོ། །གང་གི་ཐུགས་ཉིད་ཀུན་བཟང་སྒྱུ་འཕྲུལ་རོལ་པའི་གར། །སངས་རྒྱས་ཀུན་གྱི་ཡེ་ཤེས་དྲང་ཐད་སྟོན་པའི་ལམ། །རྨད་བྱུང་རྡོ་རྗེ་སྙིང་པོ་ཇི་བཞིན་སྟོན་མཁས་པ། །དྲི་མེད་བཤེས་གཉེན་འོད་ཟེར་འགྱེད་ལ་ཕྱག་འཚལ་ལོ། །ཐུབ་དབང་བསྟན་པ་ཧེ་རུ་ཀ་ཡི་བརྟུལ་ཞུགས་ཆེ། །སྤྱོད་པའི་རྒྱན་དུ་པདྨ་འབྱུང་གནས་རེས་འགའ་མཚན། །ནག་པོ་སྤྱོད་པ་ཞེས་བྱར་སྟོན་ནས་རྨད་བྱུང་སྔགས། །མཆོག་གི་ལམ་མཁན་གང་དེར་སྙིང་ནས་འདུད་ཕྱག་འཚལ། །གྲུབ་པའི་དངུལ་ཆུས་ལྕགས་ལ་ཅུང་ཟད་རེག་པས་གསེར་ཁམས་བཞིན། །མཚན་ཙམ་ཁོ་ན་དག་གིས་བྱིན་གྱིས་བརླབས་པས་ཀྱང་འདི་ལྟ། །མངོན་མཐོ་ངེས་ལེགས་དཔལ་ཀུན་སྟེར་མཛད་མགོན་པོ་བཀའ་དྲིན་ཅན། །གྲུབ་ཆེན་ནམ་མཁའི་སྙིང་པོར་རྟག་ཏུ་ཕྱག་འཚལ་བདག་བྱིན་རློབས། །གང་ཁྱོད་ཞི་ལ་གནས་མིན་འགྲོ་ལ་སྨན་ཆེད་དུ། །སྤྲུལ་པའི་བཀོད་པ་རྟག་འཆར་དུས་འདིར་གྲུབ་ཀུན་གྱི། །འཁོར་ལོས་བསྒྱུར་མཛད་དྲན་པས་འཁྲུལ་བཅོམ་ཀུན་བཟང་ཞལ། །མགོན་གཅིག་པདྨ་བདེ་ཆེན་གླིང་ལ་ཕྱག་འཚལ་ལོ། །དེ་དང་ཐ་དད་མི་མངའ་རྒྱལ་བ་ཀུན་གྱི་ཡབ། །གསང་འདུས་འཁོར་ལོ་སྡོམ་པ་འཇམ་དཔལ་རྡོ་རྗེ་སེམས། །མི་ཟོལ་སྐྱེ་སྤྲུལ་རྒྱལ་གསང་རབ་འབྱམས་རྒྱ་མཚོའི་བདག །ཀརྨ་རིག་འཛིན་ཞབས་རྡུལ་བདག་གི་སྤྱི་བོས་ལེན། །དེ་བཞིན་བཀའ་དྲིན་གསུམ་མནོད་ནུས་ལྡན་སྒྱུ་འཕྲུལ་པུཎྱེའི་མཚན། །དང་པོའི་སངས་རྒྱས་མཆོག་དང་གཉིས་མེད་ཆོས་རྗེ་ཀུན་བཟང་དབང་། །ཡོན་ཏན་བཀོད་པའི་ཞིང་བདག་མངལ་སྤང་སྤྲུལ་སྐུ་ཆོས་ཀྱི་དབང་། །ཧེ་རུ་ཀ་དཔལ་གོརྵ་ནཱ་ཐ་ལའང་ཕྱག་འཚལ་ལོ། །གཞན་ཡང་དབང་བསྐུར་རྒྱུད་བཤད་ཤེས་རྒྱུད་བཀྲོལ། །མན་ངག་ལུང་སྟོན་བསྐང་དང་འདྲེན་པའི་སློབ་དཔོན་ཆེ། །ཐར་པའི་ལམ་སྟོན་བཀའ་དྲིན་ཅན་གྱུར་བླ་མའི་ཚོགས། །ཀུན་ལ་རབ་ཏུ་དྭངས་བས་ཕྱག་འཚལ་བྱིན་གྱིས་རློབས།</p><p class=\"tibetan-text\">རི་ཐང་མཚམས་ཀྱི་སྨན་མཆོག་ལས་རྣམ་ཐར་གཞུང་དངོས་ཀྱི་སྐབས།<br>ཞེས་ཕྱག་འཚལ་བ་སྔོན་དུ་སོང་ནས་འདིར་བརྗོད་པར་བྱ་བ་ནི་རང་ཉིད་ཀྱི་ངང་ཚུལ་ཅུང་ཟད་གླེང་བ་སྟེ། དེ་ཡང་བདག་འདྲ་ཕྱོགས་ཀུན་ཏུ་འཁྱམས་ཤིང་ལས་ཀྱི་འཕེན་པས་བླ་མའི་གཟུགས་སུ་བརྫུས་ཀྱང་། རང་སེམས་ལ་རང་དབང་མ་ཐོབ་པས་ན། འཁྲུལ་པའི་ཆོ་རོལ་ལེགས་ཉེས་བྱ་བ་སྣ་ཚོགས་ལ་སྤྱོད་པ་ཞིག་སྟེ། ཚུལ་དེ་ཇི་ལྟ་བུ་ཞེ་ན་ཁོ་བོ་ཅག་ལུས་རྟེན་འདི་ལ་རྣམ་པར་རྟོག་པ་མཐའ་དག་ཆོས་ཉིད་དབྱིངས་ཀྱི་ཡེ་ཤེས་གཡོ་མེད་ཀློང་དུ་མ་གྲོལ་བས། རྣམ་རྟོག་གིས་བསྐྱོད་པའི་ལས་ཀུན་གློ་བུར་དྲི་མ་ཉིད་དུ་གྲུབ་པས་ན། དྲི་མ་ཀུན་འཁྲུལ་པའི་ཆ་ཤས་ལས་མ་འདས་ཕྱིར། འཁྲུལ་པའི་ཆོ་རོལ་དུ་དེ་ཕྱིར་བཏགས་ཏེ་སྤྱིར་འཁྲུལ་པ་དེ་ལྟར་ལ་ཡང་བདག་འཛིན་ཉོན་མོངས་རང་ཁ་ཡི་རྣམ་པར་རྟོག་པས་སྤྱད་པ་ལ་ཉེས་སྤྱོད་ཞེས་དང་། མ་འཁྲུལ་པའི་ཆོས་ཉིད་ཀྱི་ལམ་ལ་དམིགས་པའི་རྣམ་རྟོག་གི་སྤྱད་པའི་ལས་ལ་ལེགས་སྤྱོད་ཞེས་སུ་བཟུང་བར་བྱ་སྟེ། དེ་ཡི་ཕྱིར་བྱ་བ་ལེགས་ཉེས་སྣ་ཚོགས་ལ་སྤྱོད་ཞེས་པའི་དོན་དེས་བསྟན་པ་ཡིན་ལ། བདག་གི་རྟོག་པ་བརྗོད་པ་མཐའ་དག་ཡང་རང་ཚུལ་དེ་ལས་མི་འདའ་བས་ན། ཁོ་བོའི་ལོ་རྒྱུས་རྣམ་ཐར་མཐར་ཆགས་སུ་བཀོད་པ་ཀུན་གྱི་སྤྱི་དོན་དུ་འདི་ཉིད་བཞག་པ་ཡིན་གྱི་ཀུན་ཏུ་ངེས་པར་བྱ་ལ། དེ་ལྟ་ན་ཡང་དེང་སང་ཁ་ཅིག་གྲུབ་རྟགས་ལ་ཐོགས་པ་མེད་ཚུལ་དང་། ཡི་དམ་ཞལ་གཟིགས་ཤིང་མཁའ་འགྲོའི་གསང་ལུང་ཕེབས་པ་ཡིན་ཞེས་དང་། མངོན་མཁྱེན་སྒྲིབ་མེད་ཡོད་ཅེས་སྙན་པའི་རྔ་སྒྲ་དྲག་ཏུ་རྒོད་པར་བྱེད་ན་ཡང་བདག་ནི་དེ་ལྟ་བུའི་ཡོན་ཏན་མཚར་དུ་དངར་བ་གང་ཡང་ངོམ་རྒྱུ་མེད་ཀྱི། ཅི་ཕྱིར་ཞེ་ན་ཡེ་ཤེས་ཀྱིས་རྣམ་ཤེས་ཟིལ་གྱིས་གནོན་པ་སྣང་སེམས་རོ་མཉམ་དུ་མ་ཤར་བས་གྲུབ་རྟགས་གཞན་ལྟ་ཅི། དགུན་གྱི་ཟན་འཁྱག་ལ་སྭོས་ཐེབ་པའི་གྲུབ་རྟགས་ཙམ་ཡང་མེད་ལགས། དེ་བཞིན་སྒྲིབ་གཉིས་ཀྱི་བག་ཆགས་འཐུག་པོས་གཡོགས་པས། ཡི་དམ་གྱི་ལྷ་ཞལ་དངོས་སུ་ནི་ཅི་ལ་མཇལ། མཁའ་འགྲོའི་ལུང་བསྟན་ནི་དམ་ཚིག་གཙང་མ་ལ་འབྱུང་བར་གསུང་པས་བདག་ནི་དམ་ཚིག་དེང་སང་དུས་ལ་དཔགས་པའི་བསྲུང་ལུགས་རང་བློས་ཅི་ནུས་བྱས་ཀྱང་སྔོན་བྱོན་དམ་པའི་རྣམ་ཐར་ལ་དཔགས་ན་གཞུང་ནས་གསུང་བཞིན་ཕྲ་རགས་མཐའ་དག་ཚུལ་བཞིན་ནི་འགྲུབ་པར་དཀའ་བས་མཁའ་འགྲོས་གསང་ལུང་བསྟན་པ་ཡང་ཁོ་བོ་ཅག་ལྟ་བུར་ཤིན་ཏུ་དཀོན་མོད། མངོན་པར་ཤེས་པ་ནི་བླ་མ་ལྷ་ཡི་བྱིན་བརླབས་ཞུགས་པའི་སྟོབས་ནི་གཞིར་བཞག གནས་སྐབས་ཞི་གནས་ལྷག་མཐོང་ཡུན་དུ་བསྒོམ་པ་དང་རྩ་རླུང་ཐིག་ལེ་ལ་སྦྱངས་པ་འབད་བརྩོན་བགྱིས་པའི་གསལ་སྣང་དང་། སྔོན་ནས་སྒྲིབ་པ་བག་ཆགས་ཀྱིས་སྲབ་པས་གཞན་རྒྱུད་ཤེས་པ་སོགས་མངོན་ཤེས་རྗེས་མཐུན་ཆེ་འབྲིང་ཆུང་ངུ་ཇི་རིགས་ཡོང་བར་གསུངས་ཀྱང་བདག་ལ་ནི་ཡོན་ཏན་དེ་རྣམས་མི་ལྡན་པས་མངོན་ཤེས་ཀྱི་རིགས་ཅི་ལ་བདོག དེས་ན་མངོན་གྱུར་གྱི་ཡོན་ཏན་དེ་འདྲ་མེད་བཞིན་ཡོད་བརྫུ་བའི་མི་ཆོས་བླ་མའི་རྫུན་གྱི་རྩ་བའི་ཕམ་ལྟུང་བསྒྲུབ་ནས་མནར་མེད་དམྱལ་བའི་བུད་ཤིང་དུ་སྐལ་པར་སྡོད་ནུས་པའི་སྙིང་ཁམས་ནི་མེད་པས་སྨྲ་བར་ག་ལ་སྤོབས། དེས་ན་ལོ་རྒྱུས་སམ་རྣམ་ཐར་ནི་གདུལ་བྱའི་དྭངས་བ་འདྲེན་པའི་ཆེད་དུ་ཡིན་ཀྱང་། ངེད་ལ་ནི་ངོ་མཚར་བའི་གཏམ་མང་པོ་བརྗོད་དུ་མེད་པས་ན་ཁོ་བོའི་ངང་ཚུལ་ལ་སུས་ཀྱང་རེ་ཆེ་མ་བྱེད་ཅིག དེ་ལྟ་ན་བརྗོད་རིན་མི་ཆོག་བཞིན་དུས་ཀྱི་གྲོན་དུ་ཇི་ཕྱིར་འབྲི་ཞེ་ན་རྨོངས་ཞེན་ཅན་མང་པོས་ཁྱོད་ཀྱི་རྟོག་པ་བརྗོད་པར་གྱིས་ཞེས་ཡང་ཡང་རྣ་བའི་ཚེར་མར་གྱུར་པ་སེལ་བའི་སླད་དང་རང་ཉིད་ཀྱི་བྱ་བ་མ་ནོར་བ་དང་། ནོར་འཁྲུལ་དུ་གྱུར་པ་གསོང་པོར་བརྗོད་པ་ལ་བརྟེན་གཞན་རྣམས་ཀྱིས་སྤང་བླངས་ཀྱི་འཇུག་སྒོ་ལ་ཕན་པར་ཡང་སྲིད་བསམ་ནས་རང་ཉིད་ཀྱི་ངང་ཚུལ་རྣམ་དཀར་གྱི་བག་ཆགས་ཅུང་ཟད་སད་པས་རང་སེམས་དམུ་རྒོད་དུ་མ་བཏང་བར་ཆོས་ཕྱིར་ཞུས་དག་རང་བློས་ཅི་ལྕོགས་སུ་བགྱིས་ནས་ཐར་ལམ་ལ་བློ་ཁ་ཅུང་ཟད་ཕྱོགས་པའི་ངང་ཚུལ་ལྷུག་པ་སྒྲོ་སྐུར་དང་བྲལ་བ་རང་རྒྱུད་རང་གི་ཆེ་བ་ནས་ཆ་ཤས་ཕྲ་མོ་ཞིག་ངོ་མཚར་ཡོད་མེད་གང་ལྟར་ཡང་བརྗོད་པར་བྱ་སྟེ། དེ་ཡང་དམ་པ་རྣམས་ནི་ཡོན་ཏན་ཡོད་ཀྱང་ཁེངས་སྐྱུང་གི་མེད་པར་བརྫུ་བར་མཛད་ཅིང་། དམ་པ་མ་ཡིན་པ་རྣམས་ཡོན་ཏན་མེད་ཀྱང་ཡོད་པར་བརྫུ་བས་དུས་འདའ་བ་རང་རང་གི་ངང་ཚུལ་དུ་གྲུབ་མོད། ཁོ་བོ་ནི་དམ་པ་མཆོག་མ་ཡིན་པར་རང་གིས་རང་ལ་ངེས་པ་རྙེད་པ་ཞིག་ལགས་པས་ངོ་མཚར་ཡོན་ཏན་མེད་ལ་དེ་ཡིས་ཁེངས་སྐྱུང་ནི་མ་དགོས། ཉོན་མོངས་རང་རྒྱུད་ཀྱི་ང་རྒྱལ་ནི་མགོ་བསྙིལ་གང་ཐུབ་དགོས་རྒྱུར་གདའ་ཡང་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་མ་ཐོབ་ཅིང་དུས་སྙིགས་མ་ཉོན་མོངས་ཧྲག་པའི་སྐབས་སུ་སྐྱེས་པས་མགོ་བསྙལ་བའང་དཀའ་པོར་གདའ། དམ་པ་མ་ཡིན་ཀྱང་རང་གི་སྔོན་བསགས་བསོད་ནམས་དང་རྩ་བའི་བླ་མའི་ཐུགས་རྗེ་ལ་བརྟེན། རྒྱལ་བའི་གསུང་ལ་ཡིད་ཆེས་པས་རང་འདོད་སྙིང་ལ་གབ་ནས་གཞན་མགོ་བསྐོར་བའི་ཟག་ཟོག་གི་བྱ་བ་ནི་བྱེད་པར་མི་འགྱུར་ཞིང་སྔར་ཡང་དེ་འདྲ་སྤྱོད་པའི་ལས་ལ་འགྱོད་དགོས་སུ་གྱུར་པ་ཡང་མ་མཆིས། དེས་ན་རང་གི་ཆ་རྒྱུས་ལ་རང་ཉིད་ཞིབ་པས་རང་མྱོང་ཐུན་མོང་མ་ཡིན་པ་ཆ་ཤས་རེ་ཡང་གླེང་ན་ཉེས་པར་མི་སེམས་ལ་དྲང་པོར་བརྗོད་པའི་གཏམ་ནི་གཤིན་རྗེ་ཆོས་རྒྱལ་གྱི་སྤྱན་སྔར་བྲིན་པར་གྱུར་པ་དང་། སྒྲོ་བསྐུར་མེད་པ་འདི་ནི་དེ་བཞིན་གཤེགས་པས་ཀྱང་གནང་བར་གྲགས་མོད། འོན་ཀྱང་མདོ་ནས་དགེ་བ་གཟུགས་བརྙན་པར་གསུང་པའི་རྣམ་པ་སྒྲོ་བསྐུར་བྲལ་བའི་གཏམ་ཡིན་པ་ལ། ངོ་བོས་འགྲོ་བ་ལོག་ལམ་དུ་བཀྲི་བ་དང་གསང་སྔགས་ཀྱི་ཚིག་ཁྲོམ་དུ་འཁྱར་བ་སོགས་ནི་མི་རུང་གི །དེ་དག་གིས་ངན་འགྲོ་མི་བཟོད་པའི་རྒྱུ་བསགས་པའི་ཕྱིར་རོ། །དེས་ན་བྱ་བྲལ་རིག་སྔགས་འཆང་བ་རང་ཉིད་ཀྱི་རྟོགས་པ་བརྗོད་པ་འདི་ལ་ཡང་དེ་ལྟ་བུའི་སྐྱོན་གྱིས་སྦགས་པ་མཆིས་སྲིད་ན་དཔང་གྱུར་རྒྱལ་བ་སྲས་བཅས་ཀྱི་སྤྱན་སྔར་མཐོལ་ཞིང་བཤགས་ཀྱི་འདི་ཕྱིའི་སྒྲིབ་པ་མེད་པར་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ། དེ་ལྟར་རྩོམ་པར་དམ་བཅའ་ནས་བརྗོད་པའི་དངོས་པོ་ལ། སྤྱི་དོན་གསུམ་དུ་བཞག་སྟེ། དེ་ཡང་ཁོ་བོ་ཀུན་གཞི་བག་ཆགས་ཅན་གྱི་ཡིད་ལུས་རིགས་དྲུག་གི་དུཿཁ་ཡང་ཡང་ཟོ་འཁྱུད་འཁོར་མར་བརྒྱུད་བཞིན་པ་ལས་གནས་སྐབས་དུས་ཉི་ཚེ་བ་འདི་ལ་སྐུ་སྐྱེར་བཏགས་པའི་གཏམ་འོལ་སྤྱིའི་རྗེས་སུ་འབྲང་སྟེ་སྔོན་གྱི་གནས་ཅུང་ཟད་གླེང་བ་འཕྲོས་ཐུང་ཙམ་དང་། སྐྱེ་བ་འདིར་སྔོན་གྱི་ལས་སྨོན་འཕྲལ་གྱི་རྐྱེན་ལ་བརྟེན་ནས་ད་ལྟ་ཡན་ཆད་ལེགས་ཉེས་ཀྱི་འཇུག་སྒོ་སྣ་ཚོགས་སྤྱད་པ་ལས་འཕྲོས་པའི་གཏམ་རགས་པ་ཞིག་བརྗོད་པ་དང་། ཕྱིན་ཆད་ཐར་པ་མཆོག་ཏུ་གྱུར་པའི་དམ་པའི་ཆོས་ལ་བློ་གཞོལ་ནས་ལྷག་བསམ་གྱི་གཞན་ཕན་རྒྱ་ཆེན་པོ་སྒྲུབ་པར་སྨོན་པའི་གཏམ་གྱི་སྦྱོར་བ་ཅུང་ཟད་སྤེལ་བ་སྟེ། དེ་ལྟར་དོན་ཚན་གསུམ་དུ་གྱུར་པ་དེ་ཀུན་གྱི་སྤྱི་ཆིངས་ཀྱི་ཚུལ་དུ་གཞི་ལམ་འབྲས་བུའི་རྣམ་པར་བཞག་པ་ས་བོན་ཙམ་ཞིག་ཐོག་མར་བཀོད་པར་བྱ་ལ།</p><p class=\"tibetan-text\">རི་ཐང་མཚམས་ཀྱི་སྨན་མཆོག་ལས་གཞི་ལམ་འབྲས་བུའི་རྣམ་པར་གཞག་པའི་སྐབས།<br>དེ་ཡང་ཇི་ལྟར་ཞེ་ན་འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པའི་ཆོས་མ་ལུས་མི་ལུས་ལུས་པ་མེད་པ་ཐམས་ཅད་ཀྱི་འཆར་གཞི་ཐོག་མ་མཐའ་མ་མེད་པ་དུས་བྲལ་གཉུག་མ་ལ་གདོད་མའི་མིང་བཏགས་པ་ཡང་ནི་ཡེ་ཤེས་སྤྲོས་པ་ཐམས་ཅད་དང་བྲལ་ཞིང་འདུས་མ་བྱས་པ་སྨྲ་བསམ་བརྗོད་པའི་ཡུལ་མཐའ་དག་ཡེ་སྟོང་རྩ་བྲལ་ཀ་ནས་དག་པ་ཆོས་ཀྱི་རང་བཞིན་གྱི་འོད་གསལ་བ་གཞི་དབྱིངས་ཆེན་པོ་དེ་ལས་གཞི་སྣང་ལྷུན་གྱིས་གྲུབ་པའི་སྒོ་མ་འགགས་ཅིར་ཡང་འཆར་བས་ཡེ་ཐོག་གདོད་མའི་ཀུན་ཏུ་བཟང་པོ་གཞི་ལས་འཕགས་པ་གཞི་སྣང་གི་དག་པ་རང་རིག་ཡེ་ཤེས་ཆེན་པོའི་སྒོར་ཞུགས་ནས་སྒྲིབ་པས་གོས་མ་མྱོང་རེག་མ་མྱོང་འཁྲུལ་མ་མྱོང་བར་མ་འཁྲུལ་རང་ངོ་རང་ཤེས་རྒྱལ་བ་ཡོངས་ཀྱི་སྤྱི་དཔལ་སྤྱི་མེས་ཡོངས་གྲུབ་ཐིག་ལེ་ཆེན་པོར་རང་སངས་རང་རྒྱས་ཀུན་ཏུ་བཟང་པོ་མཆོག་ཏུ་གྲུབ་ཅིང་།གྲུབ་པ་དེ་ལས་མ་གཡོས་བཞིན་དུ་རྒྱ་ཆད་ཕྱོགས་ལྷུང་མེད་པ་ཁྱབ་བརྡལ་ཟངས་ཐལ་ཆེན་པོར་སྣང་སྲིད་ཡོངས་ཀྱི་མགོན་དང་བཅུད་དང་དྭངས་མ་སྙིང་པོ་དམ་པར་བཞུགས་པའི་བྱིན་བརླབས་ཐུགས་རྗེའི་ནུས་པ་ལ་བརྟེན་ནས། ནམ་མཁའི་མཐར་ཐུག་པའི་རིས་མེད་པའི་འགྲོ་བ་མཐའ་དག་པ་ཐར་པ་དང་ཐམས་ཅད་མཁྱེན་པའི་འབྲས་བུ་སྒྲུབ་རུང་ལ་བསྒྲུབ་པའང་གློ་བུར་འཁྲུལ་རྟོག་གིས་ཤུན་པ་བསལ་བར་བྱེད་ནས་རང་རིག་བདེ་གཤེགས་སྙིང་པོ་གདོད་ནས་བཞུགས་པ་དེ་ཉིད་མངོན་དུ་བྱེད་པ་ལས་གཞན་མ་ཡིན་གྱི། གློ་བུར་གྱི་དྲི་མ་བསལ་བར་བྱེད་པ་བདེ་གཤེགས་སྙིང་པོའི་མདངས་འོད་སྟེ་ཐབས་ཀྱི་རྒྱུད་ཞེས་རྒྱལ་བ་ཐབས་ལ་མཁས་ཤིང་ཐུགས་རྗེ་ཆེན་པོའི་འཕྲིན་ལས་རང་བྱུང་གི་སྣང་བས་གྲུབ་པར་གྱུར་པ་དེ་ཡི་སེམས་ཅན་མཐའ་དག་བྱང་ཆེན་གྱི་ས་ལ་སྦྱོར་བར་བྱེད་ཅིང་གློ་བུར་གྱི་དྲི་མ་ཅན་དང་དྲི་མ་དག་རིམ་པ་སོ་སྐྱེས་མོས་སྤྱོད་དང་། མཐོང་སྒོམ་རྒྱུན་མཐའི་འཕགས་པ་ཐེག་ཆེན་པས་དང་གཞན་ཉན་ཐོས་སྐྱེ་འཕགས་དང་རང་རྒྱལ་འཕགས་པ་སོགས་སྤང་རྟོགས་མཐོ་དམན་ལ་བྱུང་བའི་རྣམ་པ་འབྱམས་ཀླས་པ་དང་སངས་རྒྱས་ཀྱི་སྒྱུ་འཕྲུལ་གང་ལ་གང་འདུལ་གྱིས་སྐུ་བསམ་གྱིས་མི་ཁྱབ་པ་གདུལ་བྱའི་དོན་དུ་སྣང་བར་མཛད་པའང་སྟེ། དེ་ཡི་ཚུལ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཁོ་ནའི་སྤྱོད་ཡུལ་དུ་གྱུར་པ་ལས་གཞན་གྱིས་དམིགས་བསམ་བློ་ཡུལ་ལས་འདས་པ་ཉིད་དུ་གྲུབ་མོད། མཐར་ཐུག་བསྒྲུབ་པའི་འབྲས་བུ་ཞེས་པ་ཡང་རང་གི་ངོ་བོ་བྲི་བ་དང་གང་བ་མེད་པ་གདོད་མ་ནས་ལྷན་ཅིག་སྐྱེས་པ་བདེ་གཤེགས་སྙིང་པོའི་མཚན་ཅན་རང་བྱུང་རིག་པ་ཟབ་གསལ་བདེ་བ་ཆེན་པོ་བྱང་ཆུབ་ཀྱི་སེམས་དེ་ཁོ་ན་ཉིད་ངེས་པའི་དབྱིངས་གང་ཡིན་པ་དེ་མངོན་དུ་གྱུར་ཅིང་རང་སར་གྲོལ་བ་ལ་འབྲས་བུ་སྤང་བ་དང་རྟོགས་པའམ་བྲལ་བའམ་སྨིན་པ་མཐར་ཐུག་པ་གཙང་བདེ་རྟག་པ་བདག་གི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དཔལ་ཀུན་ཏུ་བཟང་པོའི་གོ་འཕང་ཐོབ་པ་ཞེས་བྱའོ། །དེ་ལྟར་སངས་རྒྱས་པ་རྣམ་པ་ཙམ་དུ་གཟུགས་སྐུ་གདུལ་བྱ་ཞིང་ཁམས་སྨོན་ལམ་ཐ་དད་པ་ལྟར་སྣང་ཡང་། དོན་དམ་པར་ཆོས་ཀྱི་སྐུ་རོ་མཉམ་པ་ཉིད་དང་གཉིས་སྣང་ལས་འདས་པས་ཐམས་ཅད་ངོ་བོ་གཅིག་པ་ཁོ་ན་ཡང་ཡིན་ཏེ། དེ་ཡང་དང་པོའི་བློ་ཅན་གྱི་བློ་ཡུལ་དུ་རེ་ཞིག་གོ་བདེ་བར་བཀྲི་བའི་ཆེད་དུ་ཕྱོགས་ཙམ་མཚོན་པར་སྨོས་ན། དཔེ་ནི་རྣལ་འབྱོར་རྨི་ལམ་སྤྲུལ་བསྒྱུར་བྱང་བ་ཞིག་གི་ལུས་ཀྱི་བཀོད་པ་གཅིག་ཆར་དུ་བཞི་དང་། བརྒྱད་དང་། བཅུ་དྲུག་གིས་མཚོན་ཅི་ཙམ་སྤྲུལ་པ་དེ་རྣམས་བྱ་བྱེད་རྣམ་འགྱུར་མི་འདྲ་བ་རེ་རེ་བྱེད་པར་བསྟན་ཡང་། ངོ་བོ་རྨི་ལམ་གྱི་སྐྱེས་བུ་གཅིག་གི་ཆོ་འཕྲུལ་དུ་སྣང་བ་དང་འདྲ་སྟེ། དེ་ལྟར་རྣལ་འབྱོར་པས་རྨི་ལམ་དང་དངོས་ཀྱང་རུང་ལུས་ཀྱི་བཀོད་པ་དེར་གཉིས་སྣང་འགགས་པ་ཡང་མ་ཡིན་ལ། དེ་བས་ཀྱང་གྲུབ་པ་ཐོབ་སྟེ་ས་དང་པོ་ལ་གནས་པ་ཞིག་གི་ལུས་བརྒྱ་ཕྲག་ཏུ་སྣང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱར་ཞུགས་པ་སོགས་ཀྱང་གཉིས་སྣང་དངོས་སྤངས་ཟིན་ཡང་བག་ཆགས་ཕྲ་མོའི་རྒྱུན་ཙམ་ནི་ཡོད་པས་ས་གཞན་རྣམས་ཀྱང་མཚོན་ལ། སངས་རྒྱས་ཀྱི་གནས་སྐབས་སུ་གཉིས་སྣང་གཏན་ནས་སྤང་པ་ཡི་གསང་བ་གསུམ་ཡང་མཁའ་ཁྱབ་ཏུ་གྱུར་པས་ན། དོན་དམ་པར་སངས་རྒྱས་རྣམས་གཅིག་དང་ཐ་དད་ཀྱི་དབྱེ་བས་དཔྱད་དུ་མེད་ལ། དེས་ན་དམིགས་པའི་ཡུལ་ལས་འདས་ཤིང་བསམ་གྱིས་མི་ཁྱབ་པའི་གནས་སུ་ཡང་དག་པར་ཤེས་བྱ་བའི་ཡུལ་ལོ། །</p><p class=\"tibetan-text\">རི་ཐང་མཚམས་ཀྱི་སྨན་མཆོག་ལས་གཞི་ལམ་འབྲས་བུའི་སྡོམ་བཀོད་པའི་སྐབས།<br>འདིར་སྨྲས་པ། ཀུན་གཞི་ཀུན་ལ་ཁྱབ་པའི་ངོ་བོ་ཉིད། །ཀ་དག་གདོད་མའི་ཡེ་ཤེས་གནས་ལུགས་དོན། །མ་འཁྲུལ་རང་བྱུང་སངས་རྒྱས་ཀུན་ཏུ་བཟང་། །ཉག་གཅིག་ཟང་ཐལ་ཀུན་ཁྱབ་བདེ་བ་ཆེ། །སྤྲོས་བྲལ་འོད་གསལ་གཡོ་མེད་མཉམ་ཡངས་ངང་། །འབད་རྩོལ་མེད་པར་འགྲོ་དོན་རྒྱུན་མི་ཆད། །རྒྱ་ཆེན་མཛད་པ་ནམ་མཁའི་ཕ་མཐར་ཐུག །རྣམ་པ་ཐམས་ཅད་ཆོས་སྐུའི་ཀློང་ཉིད་ལས། །བརྟག་དཔྱད་བློ་ཡི་ར་བ་ལས་འདས་ཏེ། །འཁོར་འདས་རོ་མཉམ་གཅིག་དང་ཐ་དད་བྲལ། །གློ་བུར་གཉིས་སྣང་དྲི་མས་བཅིངས་པ་ལ། །འཁོར་འདས་སོ་སོར་བདེ་སྡུག་བདེན་པར་གྲུབ། །རྨི་ལམ་སྒྱུ་མའི་འཁྲུལ་འཁོར་ངོ་ཤེས་བཞིན། །གཉིས་སྣང་རང་གི་ངོ་བོས་མ་གྲུབ་པས། །ངོ་བོས་གཞན་སྟོང་ཆོས་དབྱིངས་སྙིང་པོའི་ཁམས། །དུས་གསུམ་འཕོ་འགྱུར་བྲི་གང་མེད་པ་སྟེ། །གང་དེའི་རང་ཉིད་རྟོག་མེད་དབྱིངས་འཇོག་ན། །རྟོག་བཅས་དྲི་མ་ཆོས་ཉིད་དབྱིངས་སུ་གྲོལ། །གཤིས་ལུགས་ཡེ་ཤེས་ཁམས་དམིགས་མཉམ་བཞག་ལ། །གོམས་པར་བྱེད་དེ་ལམ་ཞུགས་རྣལ་འབྱོར་གྲགས། །གློ་བུར་དྲི་མ་སངས་ནས་ཡེ་གདོད་མའི། །གནས་ལུགས་ཡོངས་གྲུབ་ཀྱི་ཆོས་དབྱིངས་ཆེན་པོ། །རང་ངོ་རང་གྲོལ་སྐུ་དང་ཡེ་ཤེས་ཀྱི། །རྩལ་ཁ་རྒྱས་ཚེ་འབྲས་བུ་ཞེས་སུ་གྲགས། །དེ་ལྟར་རྒྱུ་ལམ་འབྲས་བུ་དོན་དམ་ཁམས། །ཐིག་ལེ་ཡང་དག་གསང་བའི་དོན་འདི་ཉིད། །ཅུང་ཟད་གོ་ཡང་བློ་གྲོས་ཆེར་བསྐྱེད་ནུས། །ཚུལ་འདི་དེང་སང་གཞན་གྱིས་རྟོགས་དཀའ་ཡང་། །སྔོན་བསགས་ལས་སྨོན་རྩ་བའི་བླ་མ་ཡི། །ཐུགས་རྗེས་མཚམས་སྦྱར་ཤིང་རྟ་ཆེ་འགའ་ཡི། །བྱིན་རླབས་ཞུགས་མཐུས་ཚུལ་འདི་མ་ནོར་གོ །ཉུང་ངུའི་ངག་གིས་གསལ་དག་འདུས་པར་སྨྲས། །ཚེ་གང་ཐོས་བསམ་བྱས་པའི་ཡུས་ཅན་དང་། །ཚིག་སྐམ་སྐྱོར་འཛིན་རྟོག་གེས་སྦོས་སོགས་ཀྱིས། །རྙེད་པར་དཀའ་བའི་གནས་ཀུན་བླ་མ་ཡི། །རྣལ་འབྱོར་མཆོག་ལ་འབད་ན་རྟོགས་པར་ངེས། །ཞེས་སོ། །དེ་ལྟར་སྤྱི་ཆིངས་ཚུལ་དུ་བདག་དང་མཐའ་ཡས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་བྱང་ཆུབ་མཆོག་བསྒྲུབ་པ་ལ་ཤེས་པར་བྱ་བའི་གནས་གཞི་ལམ་འབྲས་བུའི་རྣམ་གཞག་ས་བོན་ཙམ་བསྟན་ཟིན་ནས། ད་ནི་རང་ཉིད་ཀྱི་རྟོགས་པ་བརྗོད་པར་སྤྱི་དོན་རྣམ་པ་གསུམ་དུ་བཞག་པ་ཡི། །</p><p class=\"tibetan-text\">རི་ཐང་མཚམས་ཀྱི་སྨན་མཆོག་ལས་སྐྱེས་རབས་སྔ་མ་རྣམས་སྤྱིར་བཤད་པའི་སྐབས།<b>དང་པོ་ཁྱོད་ཀྱི་སྔོན་གྱི་གནས་ཇི་ལྟ་བུ་ཞིག་ཡིན་དྲི་བར་བྱེད་པ་རྣམས་ལ། ཁོ་བོ་ཅག་གི་སྔོན་གྱི་གནས་སྐྱེ་བ་ཡིན་ལུགས་ད་ལྟའི་ངང་ཚུལ་འདི་ཡི་རྗེས་སུ་དཔག་སྟེ་སྒྲོ་སྐུར་བྲལ་བར་སྨྲ་ན་འདི་ལྟ་སྟེ། དེ་ཡང་གདོད་མའི་རང་བཞིན་སངས་རྒྱས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱི་གཞི་དམིགས་བསམ་བརྗོད་པའི་ཡུལ་དང་བྲལ་ཞིང་། དུས་དང་ཆ་དང་ཕྱོགས་ལས་འདས་པ་སྟེ་མཚན་ཉིད་རྒྱུ་ཡི་ཐེག་པར་དོན་དེ་འཁོར་བ་ཐོག་མ་མེད་པ་ཞེས་སུ་བཏགས་བཞིན་ལས་གཞི་ལས་འཕགས་ཏེ་གཞི་སྣང་ལྷུན་གྲུབ་ཀྱི་སྒོ་བརྒྱད་ལས་ཤིན་ཏུ་ཕྲ་བའི་རླུང་གིས་ཅུང་ཟད་བསྐྱོད་པ་ལ་བརྟེན་རང་ངོ་མ་ཤེས་པས་མ་དག་འཁོར་བའི་སྒོར། རླུང་སེམས་རང་བཞིན་རྟོགས་ཚོགས་ཉོན་མོངས་རགས་པ་ལ་བརྟེན། སྣོད་བཅུད་རྟེན་བརྟེན་ཚུལ་དུ་ཤར་ནས་རྟེན་འབྲེལ་བཅུ་གཉིས་ཀྱི་འཁོར་ལོ་ལུ་གུ་རྒྱུད་བར་མེད་དུ་བརྒྱུད་དེ་ཁམས་གསུམ་འཁོར་བར་ཡང་ནས་ཡང་དུ་འཁོར་བའི་དུཿཁས་མནར་ཏེ། དེ་ཡང་རེས་ཞེ་སྡང་གི་དབང་གིས་དམྱལ་བར་སྐྱེས་ཏེ་ཚ་གྲང་གི་སྡུག་བསྔལ་ཚད་བཟུང་མེད་པར་ཡང་མྱོང་བར་བྱས་ཤིང་། དེ་བཞིན་རེས་སེར་སྣ་འཇུར་གེགས་དབང་གིས་ཡི་དྭགས་སུ་སྐྱེས་ནས་བཀྲེས་སྐོམ་སོགས་ཀྱིས་མནར་བ་དང་། རེས་གཏི་མུག་དབང་གིས་བྱོལ་སོང་གི་སྐྱེ་སྒོ་གྲངས་མེད་པར་རྨོངས་ཞིང་བཀོལ་སྤྱོད་སོགས་སྡུག་བསྔལ་ཚད་ལས་འདས་པ་དང་། རེས་ཕྲག་དོག་དབང་གིས་ལྷ་མིན་གྱི་འཐབ་རྩོད་ལ་སོགས་པའི་སྡུག་བསྔལ་ཆེན་པོས་མནར་བ་དང་། རེས་ང་རྒྱལ་དབང་གིས་ལྷ་ཡི་འཆི་འཕོ་ལྟུང་བ་སོགས་སྡུག་བསྔལ་དུ་མས་མནར། རེས་འདོད་ཆགས་དབང་གིས་མི་ཡི་སྐྱེ་རྒ་ན་འཆི་ལ་སོགས་སྡུག་བསྔལ་སྣ་ཚོགས་པས་མནར་བ་དེ་ལྟར་སྡུག་བསྔལ་གྱི་གནས་སུ་རེས་མོས་ཀྱིས་མནར་ཏེ། དེ་ཡང་རེས་དམྱལ་བ་སོགས་སུ་སྐྱེ་བ་གཅིག་ཁོ་ནའི་ཡུན་ཚད་ཀྱང་བསྐལ་ཆེན་གྲངས་མེད་དང་། བསྐལ་པ་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་གྲངས་སུ་བར་མཚམས་མེད་པར་སྡུག་བསྔལ་བས་དོས་དྲག་ཏུ་མནར་བ་དང་། རེས་ནི་ཉིན་རེ་ཡི་ཡུན་ཚད་ལ་སྐྱེ་འཆི་བརྒྱ་ཕྲག་མང་པོ་བྱས་ནས་སྡུག་བསྔལ་དྲག་པོས་མནར་བ་དང་། ཡང་རེས་ནི་ལྟས་དབང་དགེ་བ་ཆ་མཐུན་པར་སྤྱོད་པའི་མཐུ་ལ་བརྟེན། མཐོ་རིས་སུ་རྒྱལ་པོ་དང་། བློན་པོ། བཙུན་མོ། ཁྱིམ་བདག བྲམ་ཟེ། དམ་པ་༼དམངས༽ཕལ་པ་སོགས། བདེ་བའི་འབྱོར་པ་ཕུན་སུམ་ཚོགས་པ་མྱོང་ཞིང་མཐར་སྙིང་པོ་མེད་པར་སླར་ཡང་དགེ་བའི་འཕེན་པ་རྫོགས་ནས་སྡུག་བསྔལ་དྲག་པོས་མནར་བ་དང་། རེས་ནི་སྐྱེ་བ་གཅིག་ལ་ཡང་བདེ་སྡུག་གི་མྱོང་བ་ལྷ་མིའི་དབང་པོའི་བདེ་བ་ལྟ་བུ་དང་མནར་མེད་དམྱལ་བའི་སྡུག་བསྔལ་ལྟ་བུ་སྤེལ་མས་མནར་བ་དང་། ཡང་སྐབས་སུ་ནི་འཇིག་རྟེན་པའི་བསམ་གཏན་ཐོབ་སྟེ་དེ་ཡི་རོ་ལ་མྱོང་ནས་བསྐལ་ཆེན་མང་པོར་གནས་པ་དང་། དེ་བཞིན་རེས་ནི་སེམས་ལ་བྱུང་ཚོར་གྱི་རྟོག་པ་དང་དྲན་སེམས་མེད་པ་ལུང་མ་བསྟན་གྱི་ངང་དུ་བསྐལ་པ་གྲངས་ཅན་དང་གྲངས་མེད་དུ་གནས་ནས་དེ་ལས་སད་དེ་སླར་སྡུག་བསྔལ་ལ་སྤྱོད་པ་སྟེ། མདོར་ན་ཁམས་གསུམ་འཁོར་བའི་གནས་རིས་མཐོ་དམན་དུ་བདེ་བ་མྱོང་ཡང་ཡིད་བརྟན་མ་ཐུབ། སྡུག་བསྔལ་མྱོང་ཡང་དེ་ལས་གཞན་དུ་གྱུར་པའི་གོ་སྐབས་ཀྱང་མ་རྙེད་ཅིང་། དེ་དང་དེ་ལྟ་བུའི་བར་མཚམས་མེད་པར་འཁོར་བའི་བདེ་སྡུག་ལྟར་སྣང་ཇི་ལྟར་སྣང་ཡང་དོན་དུ་སྡུག་བསྔལ་གསུམ་ལས་མ་འདས་པར་འཁོར་བ་མཐའ་མེད་དུ་འཁྱམས་ཞེས་དུས་དང་ཡུན་ཚད་བཟུང་ལས་འདས་ཤིང་། མདོར་ན་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གྲངས་དང་མཐའ་དང་མུ་མེད་པ་འདིར་སྐྱེས་འདིར་མ་སྐྱེས་ཞེས་བརྗོད་དུ་མེད་ཅིང་། དེ་བཞིན་ས་ཡི་ཕྱོགས་འདིར་སྐྱེས་འདིར་མ་སྐྱེས་ཞེས་ཀྱང་བརྗོད་པར་མི་ནུས་ལ། བདག་ཉིད་ཀྱང་ས་ཕྱོགས་ཡུལ་ཕྱོགས་གང་དང་གང་དུ་སྐྱེ་འཆི་མ་བྱས་པའི་གནས་ཅུང་ཟད་ཀྱང་མེད་པར་རྒྱལ་བས་གསུང་བཞིན་པ་སྟེ། དེ་ལྟར་སྐྱེ་འཆི་ཤ་ཁྲག་གི་ལུས་ཅན་ཁོ་ན་བླངས་པའི་གཟུགས་ཕུང་ཡང་བསགས་སུ་ཡོད་ན། མི་མཇེད་འཇིག་རྟེན་ཁམས་འདིར་སྐྱེས་པ་འབའ་ཞིག་གི་ཤ་དང་རུས་པ་བསགས་པས་ཀྱང་མི་མཇེད་འདི་ཡི་ས་གཞི་རི་རབ་རྣམས་ཀྱི་གཏོས་དང་མཉམ་ལ། རྣག་ཁྲག་ཀྱང་རྒྱ་མཚོ་ཆེན་པོ་ཇི་ཙམ་པའི་ཚད་དུ་འགྱུར་ན་འཇིག་རྟེན་ཁམས་གཞན་གང་དང་གང་དུ་སྐྱེས་པ་ཡང་དེ་སྙེད་ཀྱི་རིག་པས་དེ་དང་མཐུན་པ་ཉིད་དོ། །ཇི་སྐད་དུ། ཤ་རུས་བསགས་ན་འཇིག་རྟེན་གཏོས་དང་མཉམ། །རྣག་ཁྲག་བསགས་ན་རྒྱ་མཚོ་ཆེན་པོ་ཙམ། །ལས་འཕྲོ་བསགས་ན་བསམ་འདས་བརྗོད་ལས་འདས། །ཞེས་པ་ལྟར་རོ། །དོན་དེ་ཡིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བདག་གི་མ་མ་བྱས་པ་ཡང་མེད་ལ། ཕ་མ་བྱས་པ་ཡང་མེད་པ་ཁོ་ནའོ། །དེ་ལྟར་འཁོར་བ་ཐོག་མ་མེད་པ་ནས་དུས་ད་ལྟ་ལ་ཐུག་གི་བར་བྱས་པ་དོན་མེད་འཁོར་བ་མཐའ་མེད་ཀྱི་རྒྱ་མཚོ་ཆེན་པོར་སྤྱོད་པས་ཨ་ཐང་ཆད་པ་ནི་བདག་སོགས་སེམས་ཅན་སོ་སོའི་སྐྱེ་བོ་ཐམས་ཅད་ཀྱི་འཁྲུངས་རབས་སམ་སྐྱེས་རབས་དེ་ལས་མ་འདས་པ་སྟེ། དེ་ཡང་དེ་བཞིན་གཤེགས་པའི་གསུང་གི་རྗེས་སུ་འབྲང་ནས་འཁོར་བའི་གནས་ལུགས་སམ་ངང་ཚུལ་དེ་ལྟ་བུར་ཤེས་པར་བྱས་ནས་ཉིན་མཚན་མེད་པར་འཁོར་བ་ལ་སྐྱོ་ཤས་དྲག་ཏུ་བསྐྱེད་དེ། ངེས་པར་འབྱུང་བ་ཐར་པའི་ལམ་ལ་གཞོལ་བར་འོས་སོ་ཞེས་རང་གཞན་མཐའ་དག་ལ་གདམས་པའོ། །<br>སྨྲས་པ། འཁོར་བའི་རང་བཞིན་ངོ་བོ་མ་གྲུབ་ཀྱང་། །འཁོར་བའི་གནས་ཚུལ་སྣ་ཚོགས་སྡུག་བསྔལ་སྤྱོད། །འཁོར་བ་ཐོག་མ་དུས་ཀྱི་དམིགས་ཡུལ་འདས། །འཁོར་བ་སྤྱི་བཙན་མཐའ་མ་མེད་གནས་ཀྱང་། །གང་ཟག་སྒོས་བཙན་འཁོར་བ་ཐ་མ་ཡོད། །ཐར་པ་ཐོབ་ཚེ་འཁོར་བའི་འཁྲུལ་འཁོར་འཇིགས། །འཁོར་བས་ཡུན་རིང་དུབ་པའི་སྐྱེས་བུ་ཁྱོད། །ད་ནི་ཐར་པའི་ལམ་དུ་གཞོལ་བར་གྱིས། །དེ་སྐད་རང་ཉིད་ཆོས་དང་མཐུན་དཀའ་ཡང་། །གཞན་བློ་ཆོས་ལ་བསྐུལ་བའི་ལྷག་བསམ་ཅན། །ནེ་ཙོ་བཞིན་དུ་སྨྲ་བ་ལ་དགའ་བ། །ཚེ་དབང་ནོར་བུ་དཔལ་དེའི་གླུ་དབྱངས་ཡིན། །དེ་ལྟར་ལས་བདག་གི་སེམས་ཀྱི་རྒྱུན་དེ་འཁོར་བའི་དུཿཁས་མནར་བཞིན་པ་ལས་ནམ་ཞིག་ན་སྟེས་དབང་གིས་དགེ་བ་རྗེས་མཐུན་པ་མང་དུ་སྤྱད་པའི་མཐུ་ལ་བརྟེན་དེ་སངས་རྒྱས་ཀྱི་མཚན་ལན་ཅིག་ཁོ་ན་རྣ་བར་གསལ་པོར་ཐོས་པར་གྱུར་པའི་ཕན་ཡོན་ལས། བདེ་གཤེགས་སྙིང་པོའི་ཁམས་རྒྱུད་ལ་ལྷན་སྐྱེས་སུ་ཡོད་པའི་རིགས་ཀྱི་ནུས་པ་ཅུང་ཟད་སད་པའི་རྐྱེན་དུ་བྱས་ནས། དུས་དེ་ནས་བརྩམ་མཐོ་རིས་གནས་སུ་སྐྱེ་བ་དུ་མ་བླངས་ནས་དགེ་བའི་རྒྱུ་ཚོགས་ལ་སྤྱོད་པར་གྱུར་ཞིང་། སྔོན་གྱི་ལས་ཀྱི་ལྷག་མས་མི་དགེ་བ་ཡང་སྤྱད་པས་སྐབས་དང་སྐབས་སུ་ངན་སོང་དུ་སྡུག་བསྔལ་གྱི་ཚོར་བ་ཡང་མྱོང་བར་གྱུར་ཏོ། །དེ་ལྟ་ལས་ནམ་ཞིག་ན་དགེ་བའི་རྒྱུ་ཚོགས་མང་དུ་བསགས་པའི་མཐུ་གང་རྒྱལ་བའི་ཐུགས་རྗེའི་འཇུག་པ་ལ་བརྟེན་རིགས་དྲུག་གི་གནས་གང་དུ་ཡང་རུང་བར་རྒྱལ་བའི་བསྟན་པ་རིན་པོ་ཆེ་དང་མཇལ་ནས་དཀོན་མཆོག་གསུམ་ལ་མོས་པའི་བག་ཆགས་འཇོག་པའི་སྐལ་བ་ཅན་དུ་གྱུར་ཞིང་། དེ་ཡི་དགེ་བའི་མཐུ་ལ་བརྟེན་ཕྱིས་ཞིག་སངས་རྒྱས་ཀྱི་བསྟན་པར་ཞུགས་ནས་དམ་པའི་ཆོས་ཐེག་པ་ཆེན་པོ་ལ་སྤྱོད་པའི་སྐལ་བ་ཅན་དུ་གྱུར་ཅིང་དེ་ཡི་དགེ་བའི་མཐུ་ཆེན་པོ་ལ་བརྟེན་སངས་རྒྱས་ཀྱི་བསྟན་པའི་སྙིང་པོ་འབྲས་བུ་སྔགས་ཀྱི་ཐེག་པ་དང་མཇལ་བའི་རྟེན་བཟང་པོ་ཁམས་དྲུག་ལྡན་པ་རྡོ་རྗེའི་ལུས་ཁ་ཡར་ཐོབ་ཀྱང་ལེ་ལོའི་དབང་གི་བརྩོན་པ་ཆེན་པོས་ཚེ་གཅིག་སངས་རྒྱས་ཀྱི་སར་བགྲོད་པར་མ་བྱས་རུང་། བླ་མ་ལ་མོས་གུས་དང་ལྡན་ཅིང་སྨོན་ལམ་བཟང་པོས་བག་ཆགས་བཞག་པ་ཙམ་བྱས་པས་དེ་ཡི་མཐུ་ལ་བརྟེན་ད་ལྟ་ཡང་དལ་འབྱོར་གྱི་རྟེན་བཟང་པོ་རྙེད་པར་གྱུར་པ་འདི་བཞིན་ཏེ། ད་ནི་ཕྱིས་ནས་ཅིར་འགྱུར་མ་ཤེས་པས་དམ་པའི་ཆོས་ལ་བརྩོན་པས་མཆོག་ཏུ་འབད་པའི་དུས་སྐབས་སུ་བབ་པར་སྣང་ངོ་། །དེ་ལྟར་ནི་བདག་འདྲ་ཚེ་དབང་ནོར་བུའི་རང་གི་རང་ཉིད་ལ་ལེགས་པར་སེམས་ནས་སྨྲ་བ་ཇི་བཞིན་པའི་འཁྲུངས་རབས་སམ་སྐྱེས་རབས་སུ་བརྗོད་པ་ནི་དེ་ཁོ་ན་ཡིན་ནོ་དེ་ཁོ་ན་ཉིད་ཡིན་ནོ། །</p><p class=\"tibetan-text\">རི་ཐང་མཚམས་ཀྱི་སྨན་མཆོག་ལས་སྐྱེས་རབས་སྔ་མ་རྣམས་བྱེ་བྲག་ཏུ་ཉུང་ངུར་བཀོད་པའི་སྐབས།<br>འདིར་སྨྲས་པ། ཐོག་མེད་དུས་ནས་འོང་པའི་གཉུག་མའི་ལུས། །བག་ཆགས་འཁོར་བའི་དུཿཁས་རྟག་ཏུ་མནར། །ནམ་ཞིག་རྒྱལ་བའི་ཐུགས་རྗེའི་འཇུག་པ་ཡིས། །དགེ་བའི་རིགས་གྱུར་འབྲས་བུ་སངས་རྒྱས་ཀྱི། །མཚན་ཙམ་ཁོ་ན་ཐོས་པས་ཡུན་རིང་བར། །བདེ་བའི་གོ་སྐབས་བཟང་པོ་ཐོབ་གྱུར་ཅིང་། །ནམ་ཞིག་དད་པའི་ས་བོན་བཟང་པོ་རྒྱས། །ཚུལ་དེས་ཐར་ལམ་བསྒྲོད་པའི་སྟེགས་སུ་གྱུར། །དེ་ནས་ཀྱང་ནི་མི་དགེས་སྦགས་མིན་པའི། །བསོད་ནམས་བཟང་པོ་མང་བསགས་ནུས་པ་ཡི། །དལ་འབྱོར་བཟང་པོ་ཁམས་དྲུག་རྡོ་རྗེའི་ལུས། །འབྲས་བུ་སྔགས་ཆོས་མཇལ་བའི་སྐལ་ལྡན་གྱུར། །དེ་ལྟ་ན་ཡང་ལེ་ལོ་ཆེ་གྱུར་ཞིང་། །བརྩོན་པ་དམན་པས་བདེ་ཆེན་མ་ཐོབ་ཀྱང་། །ཁེ་ཉེན་ཆེ་བ་སྔགས་ཀྱི་དམ་ཚིག་ཞེས། །དེ་ཡི་སྙིང་པོ་བླ་མར་མོས་གུས་ཏེ།མ་ཉམས་ཚུལ་བཞིན་གསོལ་འདེབས་འབད་པའི་མཐུས།།ཕུན་ཚོགས་དལ་འབྱོར་འདི་ཐོབ་ངེས་ཤེས་སྐྱེས།། བདག་ནི་སོ་སྐྱེ་བྱིས་པ་ཉིད་ཡིན་གྱི། །ཡིན་ལུགས་ངང་ཚུལ་གསོང་པོར་དེ་སྐད་སྨྲས། །དེས་ན་བསམ་བཞིན་སངས་རྒྱས་ཀུན་འདུས་དཔལ། །བླ་མའི་བཀའ་དྲིན་ནམ་ཡང་འཁོར་ཐབས་ཅི། །ཀྭ་ཡེ་ལམ་མཆོག་གསང་སྔགས་ལ་ཞུགས་རྣམས། །སྨྱུག་དོང་སྦྲུལ་འཇུག་ལྟ་བུའི་དམ་ཚིག་གཉེན། །རང་སྲོག་བརྒྱ་ཕྲག་ལས་ལྷག་བཙའ་རིགས་ཀྱི། །སྙིང་པོ་བླ་མར་གུས་འཚལ་ཁ་ཆེམས་ཡིན། །དེ་ཡང་ངོས་ལྐོག་ལྟེམ་རྐྱང་མེད་པ་རུ། །བླ་མ་དགྱེས་པའི་ཐབས་ལ་འབད་བྱས་ཤིང་། །སྨོན་ལམ་བཟང་པོར་རྟག་ཏུ་སྤྱོད་པ་དང་། །བྱང་ཆུབ་མཆོག་གི་རྒྱུ་རུ་ཡོངས་བསྔོ་བྱ། །རིམ་གཉིས་བརྩོན་པ་དམན་ཡང་ཚུལ་དེ་ལྟས། །རིང་པོར་མི་ཐོགས་བྱང་ཆུབ་མཆོག་འབྲས་འགྲུབ། །དེ་ལས་གཞན་དུ་ཕྱོགས་ན་རིམ་གཉིས་ལ། །འབད་ཀྱང་སངས་རྒྱས་ལམ་དུ་འགྱུར་བ་མིན། །བླ་མའི་མོས་གུས་གནད་དང་བྲལ་བ་ཡི། །ངན་སོང་སྡུག་བསྔལ་སྤྱོད་དོ་ངེས་པར་གྱིས། །དལ་འབྱོར་རྟེན་འདི་ཆུ་ནང་ལྦུ་བ་བཞིན། །ཡུད་ཙམ་གཅིག་ནས་འཇིག་པའི་ཆོས་ཅན་སྟེ། །དེས་ན་མྱུར་དུ་དམ་པའི་ཆོས་སྤྱོད་ལ། །འཇུག་བརྩོན་གྱིས་ཞེས་ཁོ་བོའི་སྙིང་གཏམ་ཡིན། །རིགས་དྲུག་མཐོ་དམན་གནས་སུ་བདེ་དང་སྡུག །སྤྱོད་ཚུལ་སངས་རྒྱས་ཀྱིས་ཀྱང་བརྗོད་དཀའ་ཞིང་། །དེ་དག་ཀུན་ལ་སྙིང་པོ་མ་མཆིས་ན། །གཏན་བདེ་ཐར་པ་མཆོག་ལ་ད་འཇུག་འཚལ། །ལུས་འདི་བོར་ནས་གར་སྐྱེ་ཆ་ཡང་མེད། །རྟེན་བཟང་དལ་འབྱོར་ཐེག་ཆེན་སྔགས་ལམ་དང་། །འཕྲད་པ་ད་རེས་ཁོ་ན་ཙམ་ཡིན་གྱི། །ནོར་བུ་རྙེད་སྟོར་མ་བྱེད་ཤེས་ལྡན་རྣམས། །འཁོར་བ་ཐོག་མེད་དུས་ནས་དུས་ད་བར། །བྱས་པ་དོན་མེད་སྔ་མ་དེ་ཙམ་ཡིན། །ད་ནི་འཁོར་བའི་ལས་ལ་སྐྱོ་དུབ་པས། །བདེ་ཆེན་བཙན་ས་བཟུང་ན་མི་འཐད་དམ། །ཞེས་སོ། །དེ་ལྟར་རང་གི་ཡིན་ལུགས་ཇི་ལྟ་བའི་སྐྱེས་རབས་བརྗོད་ཟིན་ནས། ད་ནི་སྒྲོ་བཏགས་ལ་བརྟེན་སྐྱེ་བའི་ངང་ཚུལ་ཇི་ལྟ་བུ་མཆིས་ཞེས་ན། དེ་ཡང་བདག་སྐྱེས་ནས་ལོ་གསུམ་མར་བཏགས་ཙམ་དུ་ངེད་ནམ་མཁའི་སྙིང་པོ་ཡིན། སྒྲུབ་གནས་ལྷོ་བྲག་མཁར་ཆུ་ཡིན་ཞེས་ཟེར་སྐད་པ་དང་། དེ་བཞིན་སྔོན་གནས་སྐྱེ་བའི་ངང་ཚུལ་ཡིན་རྒྱུའི་ཅལ་ཅོལ་མང་པོ་ཞིག་བྱིས་པ་མནོ་མེད་ཀྱི་ངག་ནས་ཅི་ཐོད་ཐོད་བྱུང་རྒྱལ་དུ་བརྗོད་པ་ལས་གཞན་གྱིས་བཟོ་བཅོས་སོགས་ནི་མེད་ངེས་ཡིན། ཚུལ་དེ་ལ་བརྟེན་མིང་སྐུ་སྐྱེར་བླ་བཏགས་པར་གྱུར་ཏེ། དོན་དུ་ནི་དེ་དག་བྱིས་པའི་བླ་བརྡོལ་ཚིག་ཙམ་ལས་ཅི་ཞིག ལྷག་པར་དཔལ་ཆེན་པོ་ནམ་མཁའི་སྙིང་པོ་ལྟ་བུ་ནི་ཕྱག་རྒྱ་ཆེན་པོ་མཆོག་གི་དངོས་གྲུབ་བརྙེས་ཏེ་སངས་རྒྱས་ཀྱི་སར་གཤེགས་པ་སྟེ་དེ་ལྟའི་རྣམ་རོལ་བདག་ལྟ་བུ་ག་ལ་ཞིག་སྟེ། དགེ་སློང་ནམ་མཁའ་སྙིང་པོ་ཡིན་ཞེས་བྱིས་པས་མནོ་མེད་ཀྱི་ཁ་ཧམ་པ་མཐོ་བ་ཁོ་ན་སྟེ། ངེས་པའི་དོན་དུ་ངེད་ཅག་ལྟ་བུའི་སོ་སྐྱེ་བྱིས་པ་ལ་དེ་འདྲ་ཡི་དཔྱད་པ་ཡི་གནས་ཙམ་ཡང་མ་རེ་ཞིག འོན་ཀྱང་མགོན་པོ་དེས་གདུལ་བྱ་ཐུན་མོང་དམན་པའི་ངོར་སོ་སོ་སྐྱེ་བོ་ཕལ་བར་བྱིན་གྱིས་བརླབས་ནས་གཞན་ཕན་སྨོན་ལམ་དབང་གི་སྤྱོད་པ་ཞིག་ཡིན་པར་གྱུར་ན་སྲིད་མཐའ་མ་བཀག་གོ དེ་ལྟར་ཡང་གུ་རུ་པདྨ་འབྱུང་གནས་ཀྱི་གཏེར་ལུང་དུ་མ་ནས་རྡོ་རྗེའི་ཚིག་གིས་ལུང་བསྟན་པ་དང་བཀའ་དྲིན་མཚུངས་མེད་རྩ་བའི་བླ་མ་དང་། གྲུབ་བརྙེས་དམ་པ་མང་པོས་མགྲིན་གཅིག་དང་དབྱངས་གཅིག་ཏུ་དཔལ་ཆེན་པོ་ནམ་མཁའི་སྙིང་པོའི་སྤྲུལ་པའི་རྣམ་གྲངས་སོ། །གསུངས་པར་མཛད་ན་དེ་དེ་ལྟ་བུར་གྱུར་ཅིག་ཅེས་རང་གིས་ཀྱང་རང་ལ་སྨོན་ལམ་གྱི་ཡུལ་དུ་བྱས་ནས་འདིར་ཅུང་ཟད་གླེང་བར་བྱ་སྟེ། དེ་ཡང་དཔལ་ཆེན་པོ་ནམ་མཁའི་སྙིང་པོ་དེ་ཉིད་ངེས་པའི་དོན་དུ་གསང་བདག་དཔའ་བོ་ཐུགས་ཀྱི་རྡོ་རྗེ་དང་གཉིས་སུ་མེད་པས་གདོད་མ་ཉིད་ནས་གྲུབ་པའི་དཔལ་ཆེན་པོ་དངོས་སུ་གྱུར་པ་ཞིག་སྟེ་བསམ་གྱིས་མི་ཁྱབ་པའི་གནས་དང་། དེ་བཞིན་དགྲ་བཅོམ་འཕགས་པ་ཉེ་བ་འཁོར་དང་ཐེག་ཆེན་སློབ་དཔོན་ཆེན་པོ་ཡོན་ཏན་འོད་དང་། རྨད་བྱུང་རྒྱལ་བའི་སྲས་པོ་ཞི་བ་ལྷ་དང་། རིག་འཛིན་ཆེན་པོ་ཧཱུྃ་ཀ་ར་རྣམས་ཀྱང་དཔལ་ཆེན་པོ་ནམ་མཁའི་སྙིང་པོ་ཡི་སྐྱེ་བའི་རྣམ་གྲངས་དེ་ལྟར་འཛིན་པ་ཡིན་ཞེས་མཆོག་གི་བདག་ཉིད་སློབ་དཔོན་ཆེན་པོ་མང་ཞིག་གིས་དེ་ལྟར་གསུང་ཞིང་ཧཱུྃ་ཀ་ར་དང་བླ་སློབ་ཏུ་འབྲེལ་པས་ཀྱང་མཚོན། དེ་རྣམས་ལ་ལ་དངོས་ལ་ལ་སྤྲུལ་གཞིའམ་ཐུགས་རྒྱུད་གཅིག་པར་བཞེད་པར་སྣང་ངོ་། །གཞན་ཡང་བོད་ཀྱི་རྒྱལ་པོ་མེས་ཨག་ཚོམ་ཅན་གྱི་སྐུ་རིང་དུ་རྒྱ་ཕྲུག་སང་ཤི་ཏ་ཞེས་བྱང་ཆུབ་སེམས་དཔའ་༼ཁ་ཅིག་གི་འདི་སྦ་གསལ་སྣང་དུ་ལུང་བསྟན་པ་ཡིན་ཡང་ཟེར། མཆན༽རྟ་སྐད་ཀྱི་སྤྲུལ་པར་རྒྱ་ཡི་སློབ་དཔོན་མངོན་ཤེས་ཅན་གྱིས་ལུང་བསྟན་པ་དེར་གྱུར་ནས་ཐེག་པ་ཆེན་པོའི་མདོ་སྡེ་ཁ་ཡར་སྤྱན་དྲངས་བསྟན་པ་ལ་ཕན་པར་བྱས། དེ་འཕོས་པའི་སྐྱེ་བ་ནམ་མཁའི་སྙིང་པོ་ཡིན་ཞེས་ལྷ་རི་ནམ་མཁའ་འོད་ཀྱི་སྐྱེས་རབས་རྣམ་ཐར་ལས་འབྱུང་བ་ཡང་ཐུགས་རྒྱུད་གཅིག་པར་གོ་ལ། དངོས་གནས་བྱང་ཆུབ་སེམས་དཔའ་རྟ་སྐད་ནི་དཔལ་རྟ་མགྲིན་དང་། དེ་ཡི་སྤྲུལ་པ་སང་ཤི་ཏ། ཚེ་འཕོས་པའི་སྐྱེ་བ་ནི་དབུ་རུ་ངན་ལམ་བོན་གྱི་རིགས་རུས་སུ་འཁྲུངས་པ་དགེ་སློང་སྔགས་ཀྱི་གྲུབ་ཐོབ་རྒྱལ་བ་མཆོག་དབྱངས་ཡིན་པར་ཀུན་ཏུ་གྲགས་སོ། །དེས་ན་དཔལ་ནམ་མཁའི་སྙིང་པོ་ཐུན་མོང་གི་གདུལ་བྱའི་སྣང་ངོ་དང་མཐུན་པའི་སྐུ་ཡི་སྐྱེ་བའི་ཚུལ་སྟོན་དངོས་ནི་སྔ་མ་རྒྱ་གར་འཕགས་པའི་ཡུལ་དུ་བྲམ་ཟེའི་རིགས་ཀྱི་ཡབ་གུ་ཎ་སིདྡྷི་༼ཡོན་ཏན་དངོས་གྲུབ་མཆན༽དང་། ཡུམ་རྒྱལ་རིགས་སུ་ཛྙཱ་ལིཀྵྨཱི་༼མཁྱེན་པའི་དཔལ་མོ། མཆན༽སྲས་བྲམ་ཟེ་ཛ་ཏ་བྱ་བར་གྱུར་ཏེ་མགོན་པོ་འོད་དཔག་མེད་པ་རིག་འཛིན་པདྨ་འབྱུང་གནས་ཞེས་བྱ་བའི་སྐུར་སྤྲུལ་པ་དེ་མ་ཀུ་ཏ་ཡི་བྲག་ཕུག་ཏུ་བཞུགས་པར་རིན་ཆེན་གསེར་གྱི་པ་ཏྲ་མཎྜལ་དུ་བྱས་ནས་དབང་བསྐུར་བ་ནོད་པས་གསང་བའི་མཚན་ནམ་མཁའ་རྡོ་རྗེ་ཞེས་སུ་བཏགས་པར་མཛད་ནས་སྐྱེ་བ་དེ་ཡི་འོག་ཏུ་བོད་ཡུལ་དུ་སྐྱེ་བར་ལུང་བསྟན། དེ་ནས་གཙང་གི་ཕུང་པོ་རི་བོ་ཆེ་ཡི་ཤར་ཕྱོགས་གནུབས་ཡུལ་རོང་ཞེས་བྱ་བར་ཡུམ་མཆིམ་བཟའ་འོད་དེ་རྒྱན་ཞེས་པའི་སྲས་སུ་དཔལ་ནམ་མཁའི་སྙིང་པོ་སྐུ་འཁྲུངས་པ་ཡིན་ལ། ཁ་ཅིག་ནས་གཉལ་སྨད་ཤམ་དུ་མཁར་དུ་སྐུ་འཁྲུངས་པར་འདོད་ཀྱང་རོང་དུ་འཁྲུངས་པ་འདི་ཚད་མར་གྱུར་བར་རྟོགས་སོ། །དེ་ཡང་དུས་འཁོར་མཁན་པོ་རྣམས་ཀྱི་བསྟན་རྩིས་བཞེད་པ་ལྟར་ན་བདག་ཅག་གི་སྟོན་པ་རྩ་ཅན་དུ་མྱ་ངན་ལས་འདས་ནས་རགས་རྩིས་ལོ་སྟོང་དང་ལྔ་བརྒྱ་ཙམ་ན་རྒྱ་གར་ཤར་ཕྱོགས་ཡུལ་ཨུ་རུ་བི་ཤར་བྲམ་ཟེའི་རིགས་ལས། བརྟུལ་ཞུགས་སྤྱོད་པའི་དབང་པོ་ཀཧྣ་པ་སྟེ་ནག་པོ་པ་སྐུ་འཁྲུངས་ཤིང་། གང་དེ་དགུང་ལོ་བརྒྱད་ཅུ་སྐོར་ལྷག་ཙམ་ན་བོད་ཡུལ་ལྷོ་བྲག་དང་ཉེ་བ་རྒྱ་གར་གྱི་ཡུལ་ཏི་ཕུ་ར་ཡི་ཕུ་ཕལ་སྐད་དུ་ཀ་ས་རངྒ་ཞེས་བྱ་བ་ཡུལ་ཉེར་བཞིའི་ཡ་གྱལ་དེ་ཝི་ཀོ་ཊར་རྣམ་སྨིན་གྱི་ལུས་བཏང་ནས་བར་དོར་རྫོགས་སངས་རྒྱས་པ་ཧེ་རུ་ཀ་ཡི་སྐུར་བཞེངས་ཏེ་ལོ་བརྒྱ་ལྷག་ཙམ་ན་གྲུབ་པའི་སློབ་དཔོན་འདི་གཙང་རོང་དུ་འཁྲུངས་པར་ཤེས་སོ། །དེ་ལྟར་གྲུབ་པའི་སློབ་དཔོན་འདི་ཐོག་མར་འཕགས་པ་འཇམ་དཔལ་གྱི་སྤྲུལ་པ་རྒྱལ་པོ་ཁྲི་སྲོང་ལྡེའུ་བཙན་གྱི་བློན་པོར་གྱུར་ཅིང་། དེ་ནས་དམ་པའི་ཆོས་ལ་ཡང་དག་པར་མོས་པས་ཨོ་རྒྱན་ཆེན་པོ་བོད་དུ་སྤྱན་དྲངས་པའི་ཕོ་ཉ་བ་ཡང་བགྱིས་ཤིང་། མཁན་པོ་ཞི་བ་འཚོ་ལ་ཤཱཀྱའི་དགེ་སློང་གི་དངོས་པོར་བསྒྲུབ་དུས་ལན་གཅིག་ན་སློབ་དཔོན་ཆེན་པོ་པདྨ་འབྱུང་གནས་ཡར་འབྲོག་མུ་ཏིག་ཤེལ་གྱི་སྤ་མ་གོང་དུ་བཞུགས་པའི་སྤྱན་སྔར་བྱོན་ནས་རིན་ཆེན་གསེར་གྱི་མཎྜལ་ཕུལ་བར་སློབ་དཔོན་ཆེན་པོས། ཀྱཻ། ནམ་མཁའ་སྙིང་པོ་བདེའམ། ཞེས་བཀའ་བསྩལ་ནས་སྨིན་མཚམས་ནས་འོད་ཟེར་བྱུང་ནམ་མཁའི་སྙིང་པོར་ཕོག་པས་དྲན་མེད་དུ་ཡུག་གཅིག་བརྒྱལ་ནས། སད་ཚེ་སྐྱེ་བ་དྲན་པར་བྱིན་གྱིས་བརླབས། དེ་ནས་རྟ་གདོང་དཀར་མོ་ཐུགས་ཀྱི་གནས་ལྷོ་བྲག་མཁར་ཆུ་བོད་ཡུལ་གྱི་དེ་ཝཱི་ཀོ་ཊ་ཞེས་པ་སྟེ། དཔལ་ཧེ་རུ་ཀ་ལྷན་སྐྱེས་ཡབ་ཡུམ་བྲག་རི་ལ་རང་བྱུང་ཤིན་ཏུ་གསལ་བར་བཞུགས་པའི་འདབས་བྲག་རི་དུང་དཀར་གྱི་དབྱིབས་སུ་གནས་པའི་མཁར་ཆུ་ལྕགས་ཕུར་ཅན་དུ་ཕེབས་ནས་ཡང་དག་བཀོལ་བྱང་གི་དཀྱིལ་འཁོར་དུ་དབང་བསྐུར་བར་མཛད་གསང་བའི་མཚན་ནི་ཐུགས་ཀྱི་རྡོ་རྗེར་གྲགས། ཕྱིས་རྒྱ་གར་དུ་བྱོན་ནས་བྲག་ཕུག་གསེར་གྱི་བྱ་སྐྱིབས་ཅན་དུ་ཡང་དག་གི་བཀའ་བབ་པའི་རིག་འཛིན་ཧཱུྃ་ཀ་ར་དང་མཇལ་ནས། བླ་མེད་མ་ཡི་རྒྱུད་ལ་མཁས་པར་སྦྱངས་ནས་བསྒྲུབས་པས་གྲུབ་པ་ཆེན་པོ་ཉམས་འོག་ཏུ་ཆུག་པར་གྱུར་ནས་བོད་དུ་བྱོན། མཁར་ཆུ་གཙོ་བོར་གྱུར་པའི་གཉལ་སྨད་དགེ་རི་ལ་སོགས་བསྒྲུབ་གནས་དུ་མར་བསྒྲུབ་པ་ཡུན་རིང་དུ་མཛད་པའི་ཚུལ་བསྟན། སྤྱོད་པའི་ཕྱག་རྒྱ་ལུང་བསྟན་བྱུང་བ་ལྟར་གཙང་རྟ་ནག་ནས་ཤེལ་དཀར་བཟའ་རྡོ་རྗེ་མཚོ་སྒྲོན་རྙེད་དེ་ལས་ཀྱི་ཕྱག་རྒྱར་མཛད་དེ་བརྟུལ་ཞུགས་ཀྱི་སྤྱོད་པ་གསུམ་བསྐྱངས། དེ་བཞིན་གུ་རུ་པདྨ་འབྱུང་གནས་ཀྱིས་བཀའ་བསྩལ་ལྟར་མཁའ་འགྲོ་ཡེ་ཤེས་མཚོ་རྒྱལ་ལ་བརྟེན་མི་འགྱུར་བདེ་བ་ཆེན་པོའི་སྐུ་ཕྱག་རྒྱ་ཆེན་པོའི་རིག་འཛིན་ཡང་དག་པར་གྲུབ་པ་སྟེ། དེ་ཡང་གདུལ་བྱ་ཐུན་མོང་རྣམས་ཀྱི་སྣང་ངོར་སྐུ་ལུས་དེ་ཀ་རགས་རྩིས་སུ་ལོ་བརྒྱ་ཕྲག་གཅིག་ལྷག་ངེས་པར་བཞུགས་པའི་མཐར་རྣམ་སྨིན་གྱི་ལུས་འཇའ་ལྟར་ཡལ་ནས་ཡེ་ཤེས་ཀྱི་སྐུ་མཁའ་དང་མཉམ་པར་གྱུར་ཏེ། དེ་ལྟར་སྔགས་ཀྱི་ཕྱག་རྒྱ་ཆེན་པོའི་རིག་འཛིན་གྱི་གོ་འཕང་སྒྲ་ཇི་བཞིན་པ་ངེས་པར་བརྙེས་པ་ནི་སྔགས་རང་ལམ་གྱི་ས་བརྒྱད་པ་ཐོབ་པ་ཡིན་ལ། གསང་སྔགས་ཐབས་ཀྱི་སྤྱོད་པ་རྨད་དུ་བྱུང་བ་ལ་བརྟེན་མདོ་ལམ་ཁོ་ནས་བསྒྲོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ས་བཅུ་པ་དང་དགོངས་སྤྱོད་མཉམ་པར་གསུང་ཞིང་། མདོ་ལམ་གྱིས་བསྒྲོད་པའི་ས་བཅུ་པའི་ཡོན་ཏན་ནི་མདོ་སྡེ་ས་བཅུ་པར་བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེ་སྙིང་པོས་ཇི་ལྟར་བཤད་བཞིན་ཏེ། དེ་ནི་ཇི་ལྟ་བུ་ཞིག་སྙམ་ན་ཚུལ་དེ་མདོ་སྡེ་དེར་གསུང་པའི་དོན་ཉུང་ངུའི་ངག་གིས་བརྗོད་ན། གཟུང་དང་ཏིང་ངེ་འཛིན་གྱི་ཡོན་ཏན་ཚད་མེད་པར་རྒྱས་ཏེ་གདུལ་བྱར་ཕན་བདེའི་ཡོན་ཏན་མཐའ་དག་བསྐྱེད་པར་བྱེད་ཅིང་། སངས་རྒྱས་ལྟར་ཇི་ལྟར་འདོད་པ་བཞིན་དུ་སྤྲུལ་པ་སྣ་ཚོགས་པས་སེམས་ཅན་གྱི་དོན་མཛད་པ་དང་། ཆོས་ཀྱི་དབྱིངས་ལ་དབང་བའི་གནས་སུ་རྟོགས་ཤིང་། རྣམ་པར་སྨིན་པ་ནི་ལྷ་ཡི་དབང་ཕྱུག་ཆེན་པོ་ཞེས་གནས་གཙང་མའི་བདག་པོར་འགྱུར་བ་དང་། ཡོན་ཏན་ནི་ས་དང་པོར་སངས་རྒྱས་བརྒྱ་མཐོང་ཞིང་བརྒྱ་གཡོ་སྤྲུལ་པ་བརྒྱ་སྟོན་པ་སོགས་ཡོན་ཏན་བརྒྱ་ཕྲག་བཅུ་གཉིས་སུ་གསུངས་པ་བཞིན་འདིར་ནི་ཕྱོགས་བཅུའི་ཞིང་ཁམས་བརྗོད་དུ་མེད་པ་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཕྲ་རབ་ཀྱི་གྲངས་དང་མཉམ་པའི་ཡོན་ཏན་དེ་རྣམས་ཐོབ་ཅིང་། མཁྱེན་པ་ནི་སངས་རྒྱས་དང་རྗེས་སུ་མཐུན་པའི་ཐམས་ཅད་མཁྱེན་པའི་གནས་ཐོབ་སྟེ་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གཙོ་བོར་སྤྱོད་པ་སྟེ། དེ་ཡང་གོང་དུ་བཤད་མ་ཐག་པ་ལྟར་སྤྱིར་དག་པའི་ས་གསུམ་ལས་ཁྱད་པར་ས་བཅུ་པའི་སྐྱེས་བུ་ཡི་གཟུགས་སྐུས་འགྲོ་བའི་དོན་དུ་མཛད་འཕྲིན་ནི་སངས་རྒྱས་ཉིད་དང་མཚུངས་པར་བཤད་ན། དེ་ཕྱིར་ཡོན་ཏན་གྱི་ཚད་བཟུང་བར་མི་ནུས་པ་ཁོ་ནའོ། །<br>འདིར་སྨྲས་པ། འཕགས་པའི་སར་བཞུགས་སྐྱེས་བུའི་རྣམ་པར་ཐར། །རྡོ་རྗེའི་ལྗགས་ལྡན་རྣམས་ཀྱི་སྤྱོད་ཡུལ་ལས། །ཚུར་མཐོང་བྱིས་པའི་བློ་ཡིས་རྟོགས་འདོད་པ། །སྦྲང་མའི་རྩལ་གྱིས་ནམ་མཁའི་མཐའ་གཞལ་འདྲ། །གང་གི་མཛད་པ་བསམ་མི་ཁྱབ་པ་ལ། །བརྟག་དཔྱད་གནས་སུ་སྤྱོད་པ་རང་ངལ་མཐོང་། །དེ་བས་ངོ་མཚར་དཔག་མེད་འབྱུང་བའི་གནས། །དེར་གུས་མོས་པའི་གདུང་ཤུགས་བསྐྱེད་པ་ན། །ཕུན་ཚོགས་འབྲས་བུ་འགྲུབ་ལ་སོམ་ཉི་ཅི། །དོན་དེ་གུས་པས་གསོལ་འདེབས་འབད་པར་བྱོས། །བདག་ཀྱང་ཚེ་རབས་རྟག་ཏུ་མགོན་དེ་ལ། །རྩེ་གཅིག་གསོལ་འདེབས་བྱེད་པར་སྨོན་ལམ་བཏབ། །ཅེས་སོ། །དེ་ལྟར་གྲུབ་པའི་སློབ་དཔོན་ཆེན་པོ་དེ་ནི་གོང་དུ་སྨོས་པ་བཞིན་མཁའ་ཁྱབ་ཡེ་ཤེས་ཀྱི་བདག་ཉིད་ཆེན་པོར་གྱུར་པས་ན་སྤྲུལ་པའི་རྣམ་རོལ་འདི་ཙམ་ཞེས་སུ་ཞིག་ཚད་བཟུང་བར་ནུས། དེ་ལྟ་ན་ཡང་གདུལ་བྱ་ཡུལ་དུས་སུ་ཉི་ཚེར་གྲགས་ཚོད་ཙམ་ཡང་ཆུ་ནང་གི་ཟླ་གཟུགས་བཞིན་ཐ་དད་ཀྱི་ཚུལ་དང་གཅིག་ཏུ་སྟོན་པ་སོགས་དུ་མར་སྣང་བར་མཛད་པ་མཐའ་དག་གླེང་བར་མི་སྤོབས་མོད། སྤྱིར་ཡང་བདག་ལྟ་སོ་སོའི་སྐྱེ་བོར་གྱུར་པ་ལ་སྐྱེ་བའི་ཕྲེང་བ་དམ་པར་བགྲང་པ་ནི་ཤིན་ཏུ་མི་མཛེས་པ་ཞ་ཉེའི་རྡོག་པ་ལ་འདི་ཡི་རྒྱུ་ཡིད་བཞིན་གྱི་ནོར་བུ་ཞེས་བསྔགས་པའམ། མི་འོས་པ་སྤྲང་པོ་མཛེ་ཁྱེར་ཞིག་ལ་འཁོར་ལོས་བསྒྱུར་བའི་རྒྱལ་པོའོ་ཞེས་བརྗོད་ན་རྒྱལ་ཁྲིམས་ཀྱི་ཉེན་པ་བཞིན་རབ་ཏུ་མི་ལེགས་པར་འདི་ཕྱིའི་དུཿཁའི་རྒྱུར་འགྱུར་བར་ཡང་ཡོངས་སུ་ཤེས་ཤིང་ཁོང་དུ་ཆུད་མོད། <br>འདིར་སྨྲས་པ། སུ་ཞིག་མཛེ་ཁྱེར་སྤྲང་པོ་ངན་ངོན་དེ། །འཁོར་ལོས་བསྒྱུར་བའི་རྒྱལ་པོ་ཡིན་ནོ་ཞེས། །འཁོར་ལོས་བསྒྱུར་བའི་འབངས་ལ་སྟོན་པ་ན། །རྒྱལ་པོའི་ཁྲིམས་ཀྱིས་ཉེན་པར་ཅིས་མི་འགྱུར། །ཆེས་དམན་གང་ཟག་ཐ་མལ་སོ་སོ་སྐྱེ། །དང་པོའི་ལས་ཅན་མུ་ཏོ་ངན་ངོན་པ། །ཀུན་ནས་ཉོན་མོངས་མཛེ་སྐྱས་ཡོངས་ཟིན་ཞིང་། །གཞན་ཕན་རྣམ་དག་ནོར་དང་མི་ལྡན་འདི། །གྲངས་མེད་བསྐལ་པའི་ཕ་རོལ་ཚོགས་བསགས་ནས། །བདག་དོན་ཆོས་སྐུ་མངོན་གྱུར་སྤྱི་བོ་སྐྱེས། །གཞན་དོན་རིན་ཆེན་བདུན་ལྡན་དཔུང་གིས་ཕྱུག །མི་མཆོག་དེ་ལྟ་ཡིན་ཞེས་སུ་ཡིས་སྨྲ། །གལ་ཏེ་རང་འདོད་དབང་གིས་སྨྲ་བ་པོ། །མཆིས་ན་ལས་ཀྱི་རྒྱལ་ཁྲིམས་བཙན་པོ་ཡིས། །ཚེ་རབས་མང་པོར་དམྱལ་བའི་ཁྲིམས་མུན་དུ། །འཇུག་པར་ངེས་མོད་ཚུལ་འདི་འཛེམ་འོས་མཐོང་། །ཞེས་སོ། །དེ་ལྟ་ནའང་འདིར་རང་ལ་བཀའ་དྲིན་ཆེ་བའི་བླ་མ་རྡོ་རྗེ་འཛིན་པ་ཆེན་པོ་རྡོ་རྗེ་སེམས་དཔའ་དང་གཉིས་སུ་མེད་པ་རྣམས་ཀྱི་གསུང་གིས་ལུང་བསྟན་པ་ནི་སྔགས་ཀྱི་རྡོ་རྗེ་སློབ་དཔོན་གྱི་གསུང་སངས་རྒྱས་ཀྱི་བཀའ་ལྟར་ཤེས་པར་འོས་པའི་གནས་དང་། ཟོལ་ཟོག་མེད་པའི་ཟབ་གཏེར་གྱི་ལུང་བྱང་བསླད་བྲལ་རྣམས་ནས་གསུང་པ་ནི་མི་བསླུ་ངེས་པ་རྡོ་རྗེའི་ཚིག་ཡིན་པས་དེ་དོན་ལྟར་ཁ་ཤས་ཅིག་རང་ཉིད་དད་མོས་ཀྱི་གསོས་སུ་ཕྱག་འཚལ་བ་སྔོན་དུ་བྱས་ནས་སྨྲ་ན། གཏེར་ལུང་གིས་གསལ་བ་ནི། ཁ་ཆེར་བྲམ་ཟེ་རིན་ཆེན་རྡོ་རྗེ། དྭགས་པོ་སྒོམ་ཚུལ། ལྷ་རི་ནམ་མཁའ་འོད། ཀཿཐོག་བྱམས་པ་འབུམ། ཙཱ་རི་རས་པ་བྱང་ཆུབ་འབུམ། ལྷོ་བྲག་སློབ་དཔོན་ཨེ་མ་སྟག་ལུང་སངས་རྒྱས་དབོན། གཞོ་ལུང་པ་རྡོ་རྗེ་རྒྱལ་པོ། གཏེར་སྟོན་བྱང་ཆུབ་གླིང་པ་རྣམས་ཏེ་རགས་རིམ་ཞིག་གོ །གཞན་ནི་རིག་འཛིན་པདྨ་ནོར་བུའི་སྐྱེ་བ་བདག་ཡིན་པར་སྲིད་ཚེ། དེ་ལ་ཁམས་གཏེར་སྟོན་ནུས་ལྡན་བདུད་འདུལ་རྡོ་རྗེས་གནང་བའི་ལུང་བསྟན་དུ། ཟུར་ཆུང་རབ་ཤེས་གྲགས། གཏེར་སྟོན་གྲྭ་པ་བཛྲ། མཁན་པོ་སྟོན་བཟང་པོ་དཔལ། ཀཿཐོག་ཚུལ་ཁྲིམས་འབུམ། ཀུན་མཁྱེན་སངས་རྒྱས་འཕེལ། བདག་སྨྱོན་ཀུན་དགའ་ལེགས་པ་རྣམས་སྐྱེ་བའི་ཕྲེང་བར་ངོས་བཟུང་བས་དེ་ཀུན་ཀྱང་དཔལ་ནམ་མཁའ་སྙིང་པོའི་སྤྲུལ་པར་བཞེད་པའོ། །བདག་རང་ལ་དཔལ་བརྩེ་བ་ཆེན་པོས་བཀའ་བསྩལ་བ་ནི་ཇོ་ནང་ཀུན་མཁྱེན་དོལ་པོ་བའི་ཐུགས་སྲས་མ་ཏི་རྣམ་གཉིས་ཀྱི་ཡ་གྱལ་དེ་དང་ཇོ་ནང་རྗེ་བཙུན་དམ་པས་བྱིན་གྱིས་བརླབ་པ་ཞིག་གོ་གསུང་སྟེ། རང་ཡང་འདི་ཕྱོགས་སུ་བག་ཆགས་ཤིན་ཏུ་འཐུག་པས་མད་པར་མཆིས། དེ་བཞིན་བདག་གི་བླ་མ་གྲུབ་པའི་དབང་པོས་ཁྱོད་མཁས་པ་གཙང་ནག་པའི་སྐྱེ་བར་སྣང་།གནང་བ་དེ་ལ་བག་ཆགས་སད་རྒྱུ་ཞིག་ཀྱང་འདུག དེ་རྣམས་ནི་རང་རེའི་བྱེ་བྲག་གི་སྐྱེ་རྒྱུད་ཚུལ་དུ་བྱུང་བ་རགས་རིམ་ཙམ་ཞིག་སྟེ་མཐའ་དག་ནི་འདིར་མ་སྨོས་ཤིང་། གཞན་ནི་བོད་འདིར་དཔལ་ནམ་མཁའི་སྙིང་པོའི་སྤྲུལ་པར་གཏེར་ལུང་སྒོ་དུ་མར་ཤིན་ཏུ་མང་བར་སྣང་བ་ནི་བྲིར་མ་ལང་ཤིང་སྐབས་འདིར་ནི་སྨྲ་ཡང་མ་དགོས་མོད། དོན་དུ་ནི་རང་རྒྱུད་ལ་རང་གིས་བརྟག་ནས་གཞལ་ན་གོང་དུ་སྨོས་པ་དེ་རྣམས་ཀྱི་སྐྱེ་བ་དངོས་སྨོས་ཅི་འཚལ་སྤྲུལ་པ་ཡང་སྤྲུལ་གྱི་ཆ་ཡང་མ་ལགས་རུང་ཡེ་ཤེས་ཐོབ་པ་ནི་ཀུ་རེ་ཀྱལ་ཁའི་ཚུལ་མཛད་པ་ཡང་། དོན་དམ་དུ་གྱུར་ནས་གཞན་ཕན་ནུས་པས་མཚོན་དམ་པའི་གསུང་ལ་བརྙས་པ་ཅུང་ཟད་ཡང་མི་རུང་ཞིང་། དོན་དེ་ལྟ་བུའི་བསྐལ་བཟང་ལ་བསམ་ནས་འདིར་བཀོད་པ་ལས་གཡོ་སྒྱུའམ་མངོན་པའི་ང་རྒྱལ་གྱིས་འཕྱར་བ་མ་ཡིན་ཏེ། རང་གི་གནས་ཚུལ་སྐྱེ་རྒྱུད་དངོས་བསྟན་གོང་དུ་བརྗོད་ཟིན་པ་དེ་ཀའོ། །<br>འདིར་བར་སྐབས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ། གང་ཞིག་རྒྱལ་བ་མཆོག་གི་གོ་འཕང་ལ། །ཉེ་བར་ཞུགས་ནས་གདུལ་བྱ་འདྲེན་པའི་སླད། །གང་འདུལ་གཟུགས་སྐུའི་སྣང་བརྙན་ཅིར་ཡང་ཤར། །འགྲོ་ལ་བརྩེ་ཆེན་རྣམ་ཐར་དེ་ལ་ཇི། །བདག་ནི་ནམ་མཁའི་སྙིང་པོའི་སྤྲུལ་པ་ཞེས། །མིང་ཙམ་ཁོ་ན་ལས་གཞན་ནམ་ཡང་མིན། །དེས་ན་དམ་པའི་སྐྱེ་འཕྲེང་བསམ་འཕེལ་གྱི། །ནོར་བུ་འཕྲེང་བ་ཇི་བཞིན་མཛེས་པ་ལ། །སོ་སྐྱེ་བདག་ལྟ་ཞ་ཉེའི་རྡོག་པ་བཞིན། །ནམ་ཡང་མཛེས་པའི་གོ་སྐབས་ཡོད་མ་ཡིན། །འོན་ཀྱང་ནོར་བུ་ཀེ་ཏས་རེག་བྱས་པས། །བ་ཚྭ་ཅན་ཀྱང་བརྒྱད་ལྡན་ཆུ་བོ་བཞིན། །དམ་པ་གང་གི་མཚན་གྱིས་དབང་བསྐུར་མཐུས། །མགོན་པོ་དེ་ཡི་བྱིན་རླབས་འཇུག་གྱུར་ཅིང་། །གང་གི་འཕྲིན་ལས་བྱེད་པའི་འབངས་གྱུར་ནས། །འགྲོ་ཀུན་ཐར་པར་གཞོལ་བྱེད་ཉིད་དུ་སྨོན། །ཞེས་པ་ཡང་སྨྲས་སོ། །</p><p class=\"tibetan-text\">དེ་ལྟར་གོང་དུ་སྨོས་པའི་སྐྱེས་བུ་ཆེན་པོ་དེ་དག་དུས་སྔ་ཕྱི་ཅི་ལྟར་བྱུང་མི་འཁྲུལ་ཕྱིར་གོ་རིམ་ཆ་ཤས་སྨྲ་ན། <br>བྲམ་ཟེ་རིན་ཆེན་རྡོ་རྗེའི་ཞབས་ནི། མི་ཆོས་ཀྱི་ཡུལ་ཁ་ཆེ་རུ་བྲམ་ཟེ་པཎྜི་ཏ་ཧ་རི་བྷ་ཏྲ་ཞེས་པའི་སྲས་སུ་འཁྲུངས་ཤིང་རྩ་བའི་བླ་མ་ཨིནྟྲ་བྷོ་དྷི་ཆུང་ངུ་ལ་ཐུག་ཡི་དམ་འཁོར་ལོ་བདེ་མཆོག་གི་སྒོ་ནས་དངོས་གྲུབ་བརྙེས་ཤིང་བདེ་མཆོག་གི་བསྒྲུབ་ལུགས་སྲོལ་ཁ་གསར་པ་ཡང་གཏོད། ཁོང་གི་བླ་མ་ཨིནྟྲ་བྷོ་དྷི་འདི་ནི་རྫོགས་ཆེན་གསང་བ་སྙིང་ཐིག་གི་བབས་གཞུང་དུ་བི་མ་ལས་མཆོད་གནས་མཛད་པའི་ཨིནྟྲ་བྷོ་དྷི་དེ་ཡིན་པར་མངོན། བྲམ་ཟེ་རིན་ཆེན་རྡོ་རྗེ་འདི་ཉིད་ནཱ་རོ་ཏ་པ་དང་ཆུང་ངུ་ནས་གྲོགས་པོ་ཡིན་ལ། ཕྱིས་བི་ཀྲ་མའི་གཙུག་ལག་ཁང་དུ་མཁས་པ་སྒོ་དྲུག་ཏུ་གྲགས་པའི་དབུས་ཀྱི་ཀ་ཆེན་གཉིས་ཀྱི་དང་པོར་གྱུར་ཅིང་མཐར་སྐུ་ཚེ་སྨད་ཨོ་རྒྱན་དུ་བྱོན་ནས་འཇའ་ལུས་རྡོ་རྗེའི་སྐུ་བརྙེས་པར་གྲགས། དེ་ནི་དཔལ་ནམ་མཁའི་སྙིང་པོ་འཇའ་སྐུར་གཤེགས་ནས་ལོ་སྐོར་ཁ་ཤས་སོང་བ་ན་བྱུང་བར་སྣང་། དྭགས་པོ་སྒོམ་པ་ཚུལ་ཁྲིམས་སྙིང་པོ་ནི་མཉམ་མེད་དྭགས་པོ་ལྷ་རྗེའི་རིགས་དབོན་ཏེ་དུས་མཁྱེན་དང་ཕག་གྲུ་ལས་ལོ་དྲུག་གིས་གཞོན་ཞིང་ལྷ་རྗེའི་སློབ་མ་ཕྱི་ཚར་རྣམས་ཀྱི་བླ་མ་ཡང་ཡིན། ཆུང་ངུ་ནས་ཕྱག་རྒྱ་ཆེན་པོའི་རྟོགས་པ་ཀློང་དུ་གྱུར། དེ་ནི་ཁ་ཆེ་རིན་ཆེན་རྡོ་རྗེ་འཇའ་ལུས་གཤེགས་ནས་ལོ་དྲུག་ཅུ་ཉེ་སྐོར་གཅིག་ན་བྱོན་པར་རྟོགས་སོ། །ལྷ་རི་ནམ་མཁའ་འོད་ནི་མངའ་བདག་མྱང་གི་གཏེར་ལུང་དུ་དཔལ་ནམ་མཁའི་སྙིང་པོའི་སྐྱེ་བ་དངོས་ཡིན་པར་གསུངས་ཀྱང་དེ་སྐབས་ཁྲོ་ཕུ་ལོ་ཙཱ་བྱམས་པ་དཔལ་སོགས་ནམ་སྙིང་གི་སྤྲུལ་པར་ལུང་བསྟན་པ་དུས་མཚུངས་ཁ་ཤས་ཡོད་པས་དེ་རྣམས་ལས་ཁོང་ཉིད་ཐུགས་ཀྱི་སྤྲུལ་པར་རྣམ་པར་བཞག་པར་གོ་ལ། དུས་ཡང་མྱང་རལ་དང་རག་པར་མཚུངས། ཞང་འགྲོ་བའི་མགོན་པོ་བརྩོན་འགྲུས་གྲགས་ཀྱི་ཐུགས་ཀྱི་སྲས་དམ་པ་ཡིན། ཞིང་འདི་ནས་འཕོས་ཏེ་སངས་རྒྱས་ནམ་མཁའ་རྣམ་པར་རོལ་པར་འགྱུར་བར་ཞལ་གྱིས་བཞེས། རང་གི་དངོས་སློབ་ལྷ་རིའི་གདན་ས་མཛད་པ་པོ་སངས་རྒྱས་སོ་ལྷ་དགེས་བྱ་བ་དེ་ཁོང་ཉིད་ཀྱི་ཐུགས་ཀྱི་སྤྲུལ་པ་ཡིན་པར་དབུགས་དབྱུང་བ་སོགས་མཛད་པ་ངོ་མཚར་ཆེས་མང་བ་བསྟན་པ་དམ་པ་དེ་དྭགས་པོ་སྒོམ་ཚུལ་གཤེགས་པའི་ལོ་དེ་ཀའམ་དེ་ཡི་ཅུང་ཟད་སྔ་ཕྱི་ཙམ་དུ་སྐུ་འཁྲུངས་པ་ཡིན། མདོ་ཁམས་ཀཿཐོག་བྱམས་པ་འབུམ་ནི། དམ་གཙང་བྱམས་གསུམ་དུ་གྲགས་པའི་ཡ་གྱལ་དེ། དེ་ཡང་དམ་པ་བདེ་གཤེགས་ཀྱི་ཞབས་ཐུག་པ་ཙམ་དང་། གཙོ་བོར་གཙང་སྟོན་ལ་བརྟེན་ནས་སྨིན་གྲོལ་གྱི་ཡོན་ཏན་རྫོགས་པར་མཛད། གཙང་སྟོན་གཤེགས་ནས་ཀཿཐོག་གི་གདན་ས་བཟུང་སྟེ་གདུལ་བྱ་ཤིན་ཏུ་ཆེ་བ་བསྐྱངས་དཔལ་ཀརྨ་པཀྵི་ཡང་ཁོང་གི་སློབ་མ་ཡིན། གུ་རུ་པདྨས་ནམ་མཁའི་སྙིང་པོའི་སྤྲུལ་པ་དང་། དེ་སྐབས་རྒྱ་གར་ནས་སྤྱན་རས་གཟིགས་ཀྱི་སྒྱུ་འཕྲུལ་མི་ཏྲ་ཛོ་ཀིའི་ནག་པོ་སྤྱོད་པའི་སྤྲུལ་པར་ལུང་བསྟན། ཁོང་ཉིད་ཀྱིས་ཀྱང་སྐྱེ་བ་མང་དུ་གསུངས་དེ་ནི་ལྷ་རི་ནམ་མཁའ་འོད་དང་སྐུ་ཚེ་སྟོད་སྨད་ཙམ་ལས་དུས་མཚུངས་སུ་བྱོན་ནོ། །འགྲོ་བའི་མགོན་པོ་ཙཱ་རི་རས་པ་ནི་དབུས་གཡོར་པོ་གཞུང་དུ་རྗེ་ལོ་རས་ཀྱི་ལྕམ་སྲིང་གི་སྲས་སུ་འཁྲུངས་རྩ་བའི་བླ་མ་ཡང་ལོ་རས་དར་མ་དབང་ཕྱུག་ཡིན། སྦུབ་རི་དང་གཙང་རོང་གནུབ་དཀར་པོ་ཆོས་ལུང་སོགས་སུ་འགྲོ་དོན་ཅི་རིགས་པ་བསྐྱངས། སྐུ་ཚེ་སྨད་མཁོ་མཐིང་ལྷ་ཁང་གི་ཞིག་གསོ་མཛད་དེར་བཞུགས། ཁོང་ནི་ལྷ་རི་ནམ་མཁའ་འོད་ཞི་བར་གཤེགས་པ་ལ་ཕྱོགས་པ་ན་འཁྲུངས་བར་མངོན། ལྷོ་བྲག་སློབ་དཔོན་ཨེ་མ་ནི་རིགས་ནི་སྐྱི་སྟོན་ཡིན། གཏེར་སྟོན་གུ་རུ་ཆོས་དབང་གི་ཐུགས་ལས་སྐྱེས་པའི་སྲས་དམ་པར་གྱུར་ཞིང་། ལྐོག་གྱུར་དུ་འགྲོ་བའི་དོན་དཔག་མེད་མཛད་པ་ལས་མངོན་གྱུར་གྱི་འཕྲིན་ལས་ནི་ཧ་ཅང་དེ་ཙམ་མ་བྱུང་བར་སྣང་། གང་ལྟར་ཙཱ་རི་རས་པའི་སྐུ་ཚེའི་སྨད་དུ་བྱོན་པར་གྲུབ། སྟག་ལུང་སངས་རྒྱས་དབོན་ཞེས་པ་ནི་མཚན་དངོས་གྲགས་པ་དཔལ་རྗེ་སངས་རྒྱས་ཡར་བྱོན་གྱི་དབོན་ཡིན། བྱང་སྟག་ལུང་གི་བྲག་གདོང་ནས་གུ་རུ་པདྨ་ཀཽའུ་རི་མ་བརྒྱད་ཀྱིས་བསྐོར་བའི་བླ་སྒྲུབ་གཏེར་ཡང་བཞེས། དགུང་ལོ་ཉི་ཤུ་རྩ་དྲུག་པའི་སྐབས་མདོ་ཁམས་སུ་བྱོན་ནས་རི་བོ་ཆེ་ཡི་དགོན་པ་བཏབ་གཞན་ཕན་འཕྲིན་ལས་ཤིན་ཏུ་ཆེ་བར་གྱུར། དེ་ནི་ཀཿཐོག་སྤྱན་སྔ་བྱམས་པ་འབུམ་ཞི་བར་གཤེགས་ཏེ་ལོ་ཁ ཤས་ནས་བྱུང་བའི་སྤྲུལ་པར་སྣང་ངོ་། །གཞོ་ལུང་རྡོ་རྗེ་རྒྱལ་པོ་ནི། གཏེར་སྟོན་དྲི་མེད་ལྷུན་པོའི་ཡི་དམ་ཙིཏྟའི་རྒྱན་ཅིག་ལུང་བསྟན་ཉི་མའི་འོད་ཟེར་ལས། ད་ལྟའི་གནུབ་བན་ནམ་མཁའ་སྙིང་པོ་ནི༔ འབྲི་རུ་རྡོ་རྗེ་རྒྱལ་མིང་རྨུ་རྒོད་འདུལ༔ ཞེས་འབྱུང་བ་དེ་ཡིན་ཏེ། གནས་ཆེན་ཏི་སྒྲོ་བྲག་དཀར་གྱི་སྒོ་དབྱེ་བར་སྣང་ཞིང་། འབྲི་གུང་གི་རྙིང་ཆོས་ལ་སྤྱོད་པའི་དབུ་ཡང་ཁོང་ནས་བརྩམ་པར་གྲགས། དགུང་ལོ་དྲུག་ཅུ་རྩ་བརྒྱད་བར་བཞུགས། མང་པོ་གཏེར་སྟོན་བྱང་ཆུབ་གླིང་པ་ནི་གཞོ་ལུང་རྡོ་རྗེ་རྒྱལ་པོ་གཤེགས་པའི་ལོ་དེ་ཡི་ཕྱི་མ་ཆུ་འབྲུག་ལ་འཁྲུངས། གཞོན་ནུའི་སྐབས་སུ་སྒྱུ་འཕྲུལ་ཞི་ཁྲོ་ཡང་ཕུར། སེམས་ཕྱོགས་ཟུར་ཚོ་ལུགས་སུ་གྲགས་པ་ལ་སྦྱངས་ཤིང་ཕྱིས་གཏེར་སྟོན་ཚེ་བརྟན་རྒྱལ་མཚན་གྱིས་སྟོན་པའི་ཁ་བྱང་ཕྱག་ཏུ་བྱུང་བ་ལ་བརྟེན་དགུང་ལོ་ཉེར་ལྔ་བཞེས་སྐབས་ལ་སྟོད་དཔལ་མོ་དཔལ་ཐང་གི་སྲིན་མཚོའི་ནུབ་བྱང་བྲག་བྱ་ཁྱུང་གི་མཆུ་འདྲ་བ་ནས་ཀུན་བཟང་ཐུགས་གཏེར་བཏོན་ནས་སྐུ་ཚེ་སྨད་སྙེ་ནམ་གསེར་ཕུག་ཏུ་བཞུགས་པར་མཛད། ཁོང་རང་གི་གཏེར་ལུང་དུ་དེ་སྐབས་ནམ་སྙིང་སྤྲུལ་པ་གསུམ་ལས་ཐུགས་ཀྱི་སྤྲུལ་པ་ཡིན་པར་བཤད། རིག་འཛིན་རྒོད་ལྡེམ་ཅན་དང་སངས་རྒྱས་གླིང་པ་དང་དུས་མཚུངས། དེ་གཉིས་ཀ་དང་ཁོང་དངོས་སུ་མ་མཇལ་ཀྱང་སློབ་མས་སྦྲེལ་ཏེ་ཐུགས་མཛའ་གཅུགས་སུ་གྱུར་ཞིང་གཏེར་ཆོས་ཕན་ཚུན་གསན་བཞེས་དང་། དམ་རྫས་ཕབ་རྒྱུན་གཅིག་ཏུ་སྤེལ་བར་མཛད་དོ། །དེ་ལྟར་གཏེར་ལུང་ནས་བསྟན་པ་རགས་རིམ་གྱི་དུས་ཀྱི་གོ་རིམ་དང་། གཞན་ནུས་ལྡན་བདུད་འདུལ་རྡོ་རྗེའི་ལུང་ལས་བྱུང་བའི་ཟུར་ཆུང་ཤེར་གྲགས་ནི་སྔ་འགྱུར་བཀའ་མ་ལ་གྲགས་ཤིན་ཏུ་ཆེ་ཞིང་སྦྱོར་སྒྲོལ་གྱི་ནུས་པ་རྨད་དུ་བྱུང་བ་ཐོབ་པའི་བོད་ཀྱི་གྲུབ་ཐོབ་ཆེན་པོར་གྱུར་པ་དང་། གཏེར་སྟོན་གྲྭ་པ་བཛྲ་ནི་མཁའ་འགྲོ་དགོངས་འདུས་གཏེར་ནས་འདོན་པ་པོ་ཡིན་ཞེས་གསུངས་ཀྱང་གྲྭ་སྒོམ་ཆོས་ཀྱི་རྡོ་རྗེ་དང་གཅིག་མིན་དཔྱད་པ་ལས་གཞན་སྔར་ཆ་མ་འཚལ། འཁོན་སྟོན་བཟང་པོ་དཔལ་ནི་འགྲོ་མགོན་ཆོས་རྒྱལ་འཕགས་པའི་དབོན་ས་སྐྱའི་གདུང་རབས་རྣམས་ཀྱི་སྤྱི་མེས་གྲགས་ཆེ་ཞིང་རྟོགས་སླ་བ་ཉིད་དོ། །ཀཿཐོག་ཚུལ་ཁྲིམས་འབུམ་ནི་སྔ་ཕྱི་གཉིས་བྱུང་བའི་སྔ་མ་ནི་ཀརྨ་པ་རོལ་བའི་རྡོ་རྗེའི་སྐུ་ཚེའི་སྨད་ཙམ་དུ་བྱུང་ཞིང་སྐལ་ལྡན་གྱི་འདུ་བ་ཡང་མང་དུ་བསྐྱངས་བཀའ་གཏེར་གྱི་བསྟན་པ་རྒྱས་པར་མཛད། དེ་ཡི་སློབ་མ་ནི་ཀཿཐོག་ཆོས་འབུམ་དང་། དེ་ཡི་སློབ་མ་བུ་འབོར་ཡེ་ཤེས་རྒྱལ་མཚན། དེ་ཡི་སློབ་མ་བྱང་སེམས་ཆོས་རྗེ། དེ་ཡི་སློབ་མ་དཀོན་མཆོག་རྒྱལ་མཚན། དེ་ཡི་སློབ་མ་ཚུལ་ཁྲིམས་འབུམ་ཕྱི་མ་སྟེ་སྐུ་ཚེའི་སྨད་ལ་ཀུང་ལུང་གནས་སྒོ་དབྱེ་ཞིང་སྒྲུབ་སྡེ་འདེབས་པ་པོ་ཡིན། ཀོང་པོ་རྒྱ་ར་ནམ་མཁའ་ཆོས་ཀྱི་རྒྱ་མཚོ་ཡང་འདི་ཡི་སློབ་མར་གནང་། ཀུན་མཁྱེན་སངས་རྒྱས་འཕེལ་ནི་གཙང་རོང་ཆེན་སྣར་དུ་སྐུ་འཁྲུངས། ཐོག་མར་རོང་བྱམས་ཆེན་གྱི་གྲྭ་སར་ཞུགས། བྱམས་ཆེན་རབ་འབྱམས་པར་གྲགས། ཕྱིས་འབྲས་ཡུལ་རྫོང་དཀར་སྐྱེད་མོའི་ཚལ་གྱི་བཤད་གྲྭ་བཙུགས། བོད་གངས་ཅན་གྱི་བཤད་གྲྭ་ཕལ་མོ་ཆེ་འདི་ལས་གྱེས་ཤིང་། ཁོང་རང་གི་སློབ་མ་རྣམས་ཀྱིས་རྒྱལ་སྲས་ཞི་བ་ལྷའི་སྤྲུལ་པ་དང་གཙང་རོང་མེས་སྟོན་མཚོན་པོའི་སྐྱེ་བར་བཞེད། སྤྱོད་འཇུག་སྨོན་ལེའུའི་ཚིག་ཤུགས་ཀྱི་ལུང་བསྟན་པར་ཡང་འདོད་འདྲ་རུང་ཡང་ཡོད། བདག་སྨྱོན་ཀུན་དགའ་ལེགས་པ་ནི། ས་སྐྱའི་གདུང་རིགས་ལས་འཁྲུངས་མྱང་གི་དྲག་དམར་སྙིང་པོ་དུང་ཕྱུར་གྲུབ་པར་གྲགས། སྐྱིད་རོང་གནས་རམས་པ་བྱམས་པ་ཕུན་ཚོགས་ཀྱིས་འབྲས་ཡུལ་སྐྱེད་ཚལ་དུ་ཁོང་དང་མཇལ་སྐབས་ལམ་འབྲས་པའི་ཆོས་སྐད་དུ་ཁམས་འདུས་ཏེ་རྣམ་པར་མི་རྟོག་པའི་ཡེ་ཤེས་ཕེབས། ཞེས་གནས་རམས་པའི་རྣམ་ཐར་དུ་འཁོད་སྣང་བས་དུས་ནི་སྐྱེད་ཚལ་འོག་མ་འདེབས་པ་པོ་ཆོས་རྗེ་ལྷ་དབང་བློ་གྲོས་དང་རགས་རྩིས་སུ་མཚུངས་པར་གྲུབ། ཇོ་ནང་ཀུན་མཁྱེན་དོལ་པོ་པའི་ཐུགས་སྲས་མ་ཏི་རྣམ་གཉིས་ལས་ས་བཟང་མ་ཏི་པཎ་ཆེན་ལ་དགོངས་སོ་སྙམ་ཞིང་། ཇོ་ནང་རྗེ་བཙུན་གྱི་སྐུ་ཡི་སྐྱེ་བ་སྔ་ཕྱི་རྣམས་སྤྱན་སྔ་བྱམས་པ་འབུམ་པའི་འཁྲུངས་རབས་དང་ཤིན་ཏུ་འབྲེལ་ཞིང་དེ་དག་དང་ཐུགས་བརྒྱུད་གཅིག་པའི་བླ་སློབ་ཏུ་ངེས་པར་གྱུར་པ་ཞིག་གོ །མཁས་པ་གཙང་ནག་པ་ནི་འཁྲུངས་ཡུལ་གཙང་ཇོ་མོ་ནགས་རྒྱལ་གྱི་འདབ་ནགས་ཕུག་ཏུ་འཁྲུངས། དགེ་བཤེས་ཕྱྭ་པ་ཆོས་ཀྱི་སེང་གེའི་ཞབས་ལ་ཐུག ཐུགས་སྲས་སེང་གེ་དགུ་ཡི་ཡ་གྱལ་གཅིག་སྟེ་མཚན་དངོས་ཐུགས་རྗེ་སེང་གེ །འཇམ་དཔལ་གྱི་དངོས་གྲུབ་ཐོབ་ཅིང་སྨྲ་བའི་སེང་གེར་གྱུར་ཀྱང་སྔོན་གྱི་རྟེན་འབྲེལ་དང་གནས་སྐབས་མི་ཆོས་དང་མི་བསྟུན་པས་ཟང་ཟིང་གི་འདུ་བ་ཤིན་ཏུ་ཆུང་ཞིང་ཆོས་ཀྱི་སློབ་མ་ཡང་ཆེར་མ་བྱུང་། འོན་ཀྱང་མཁས་པའི་གྲགས་པ་ནི་ད་ལྟའི་བར་མ་ཉམས་པ་དེར་སྣང་། སྐུ་གཙང་ཐོབ་རྒྱལ་དུ་ཡལ། སྐུ་སྤུར་སྦྱངས་པའི་ས་དེ་དད་པས་ཟོས་ན་ཤེས་རབ་ཆེན་པོ་ཡོང་ཞེས་ད་ལྟ་ཡང་ཚོལ་ནས་ཟ་སྲོལ་ཡོད་འདུག དེ་ལྟ་སྤྲུལ་པའི་སྐུ་དེ་རྣམས་དང་ཀུན་རྫོབ་ཉིད་དུ་ལས་སྨོན་བཟང་པོས་འབྲེལ་ཞིང་ཅུང་ཟད་ཙམ་ཞིག་བདག་བྱིན་གྱིས་རླབས་པར་གོར་མ་ཆག་གོ་སྙམ་པའི་མོས་པ་དང་། ཆོས་ཉིད་དོན་དམ་གྱི་ངོས་ནས་རྩ་བའི་བླ་མས་སེམས་ལྷན་སྐྱེས་ཀྱི་ཡེ་ཤེས་རང་ངོ་སྤྲད་པའི་སྐབས་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྐུ་དང་རྒྱུད་ལྡན་བླ་མའི་ཐུགས་ཀྱི་ཡེ་ཤེས་རང་རིག་ཟབ་གསལ་དབྱེར་མེད་བདེ་ཆེན་འདི་ཀ་ལས་གཞན་དུ་མ་ཚོལ་ཞེས་གདམས་པར་མཛད་ཅིང་ཕྱག་རྒྱ་ཆེན་པོ་ཁྲེག་ཆོད་ལྟ་བའི་རྣལ་འབྱོར་པ་ཀུན་གྱིས་དེ་ལྟར་ཁས་ཡང་ལེན་ན། དཔལ་ནམ་མཁའི་སྙིང་པོ་ཡི་སྒྱུ་འཕྲུལ་སྐྱེས་བུ་དེ་རྣམས་ཀྱི་ཐུགས་ཀྱི་ཡེ་ཤེས་དང་བདག་གི་སེམས་ཉིད་གཤིས་ལུགས་ངོ་ཤེས་པའི་ཆ་གང་ཡིན་དེ་དང་གདོད་ནས་དབྱེར་མེད་རོ་གཅིག་ཏུ་གནས་པ་ཡིན། ཞེས་ཡེ་ཤེས་ཇི་བཞིན་དངོས་གནས་རྟོགས་ན་དེ་ལྟ་ཡིན་མོད་ཀྱང་བདག་རང་གིས་ནི་མ་རྟོགས་རུང་། ཉམས་མྱོང་ཕྲ་མོའམ་གོ་བ་ཙམ་ལ་བརྟེན། སྐབས་འདིར་སྟོང་ཟོབ་ཀྱི་སྒོ་ནས་དེང་སང་གི་ཆོས་གཟུགས་ཕལ་གྱི་སྤྱི་ནོར་གྱི་ཚུལ་དང་མཐུན་པར་ཐོ་ཅོ་ཆེན་པོས་ལ་བཟླ་བར་བྱས་སོ། །<br>འདིར་སྨྲས་པ། ཨ་ཧོ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྒྱུད་ལ་རྟགས་ཡོད་པའི། །རྣམ་ཀུན་མཆོག་ལྡན་གྱི་ཆོས་དབྱིངས་ཡེ་ཤེས་དེ། །སངས་རྒྱས་ཀུན་གྱི་དངོས་གདོད་མའི་ཀུན་བཟང་མགོན། །ཐ་དད་བྲི་གང་དང་དབྱེ་བ་མེད་ཞེ་ན། །སེམས་ཅན་ཐམས་ཅད་ཀུན་སངས་རྒྱས་རང་བཞིན་གྱུར། །དོན་དམ་གཤིས་ལུགས་ལ་འཁོར་འདས་རོ་གཅིག་མཉམ། །ཀུན་རྫོབ་གློ་བུར་གྱི་དྲི་མ་སྤང་མ་སྤངས། །ཁྱད་པར་ཆ་ཤས་ལས་གནས་ལུགས་གཅིག་གོ་ཞེས། །ངེས་དོན་མདོ་རྒྱུད་དང་བསྟན་བཅོས་ཀུན་ལས་གསུངས། །དེ་ཀ་ཡིན་ནས་ཀྱང་ཡིན་ལུགས་ངེས་ཤེས་སྐྱེས། །དེ་ཚེ་མགོན་པོ་མཆོག་ནམ་མཁའི་སྙིང་པོ་ཡང་། །མཁའ་ཁྱབ་གནས་ལུགས་ཀྱི་བདག་དང་དབྱེ་བ་ཅི། །ཆོས་ཉིད་བཞུགས་ཚུལ་གྱི་ངང་དུ་དེ་ལྟ་ཡང་། །གང་ཟག་ལམ་བདེན་ལ་དབྱེ་བ་ཡོད་ཅེས་ན། །ཐེག་ཆེན་སྔགས་ལམ་ལ་ཞུགས་པའི་རྣལ་འབྱོར་པར། །དབང་དུས་ཡེ་ཤེས་སམ་བཞི་པའི་ལམ་རིམ་སྐབས། །མ་བཅོས་བསམ་འདས་ཀྱི་རིག་པ་ཟབ་གསལ་འདི། །རང་ངོ་རང་ཉིད་ཀྱི་ཤེས་གྱུར་འཕོ་བའི་དབང་། །བྱིན་རླབས་བླ་མ་ལ་བརྟེན་ནས་ཐོབ་པའི་ཚེ། །སྣང་ཚུལ་རྒྱུ་ཡི་བླ་མ་ཡང་རང་རིག་གདངས། །དོན་དམ་བླ་མ་ནི་ངོ་བོ་ཟབ་གསལ་བདེ། །རང་རིག་རྟོགས་ཚུལ་གྱི་ངོ་མཐོང་འདི་ཀ་ལས། །ཐ་དད་སོ་སོ་རུ་ནམ་ཡང་ཡོད་མིན་ཅིང་། །རྒྱལ་ཀུན་ཆོས་སྐུ་ཡི་བཞུགས་ཚུལ་འདིའོ་ཞེས། །ཚེ་གཅིག་སངས་རྒྱས་སུ་འདོད་པའི་ཉེ་ལམ་མཁན། །མཐའ་དག་ཞེ་འདོད་ཅིག་དབྱངས་གཅིག་ཉིད་གསུང་ན། །དེ་ཚེ་ཁོ་བོ་ཡང་བླ་མའི་བྱིན་བརླབས་མཐུས། །དབང་དོན་ཡེ་ཤེས་སམ་བཞི་པའི་ལམ་རིམ་ཉིད། །མངོན་ནས་ཆ་ཤས་ཤིག་གོ་ཞིང་མྱོང་བའི་མཐུས། །ཀུན་བཟང་པད་འབྱུང་དངོས་རྩ་བའི་བླ་མ་ལ། །ཀུན་རྫོབ་ལམ་དུས་སུ་མོས་གུས་མཆི་མ་འཁྲུགས། །ལུས་སྲོག་ལྟོས་མེད་དུ་དེ་ཕྱོགས་གཏོང་ནུས་མོད། །དོན་དམ་བླ་མ་ནི་སེམས་ཉིད་ཆོས་ཀྱི་སྐུ། །རིག་པ་རང་ངོ་ཡི་དབྱིངས་སུ་རོ་མཉམ་ན། །དཔལ་ཆེན་གྲུབ་པ་ཆེ་ནམ་མཁའི་སྙིང་པོ་ཡང་། །ཁོ་བོའི་སེམས་ཉིད་ཀྱི་དབྱིངས་སུ་ཅིས་མི་གཅིག །སྤྲུལ་པ་ཡང་སྤྲུལ་གྱི་ཐ་སྙད་མ་ལགས་ཀྱང་། །རྣལ་འབྱོར་ཉམས་མྱོངས་ཀྱིས་ཞེ་ཁ་འགྲང་བའི་ཚེ། །གནས་ལུགས་དོན་དམ་དང་རྗེས་སུ་འབྲེལ་བའི་གཏམ། །སྟོང་ཤོབ་ཐད་གོག་ཞིག་ཐག་ན་དེ་འདྲ་མཆིས། །ཚུལ་དེ་ཀུ་རེ་དང་ཀྱལ་ཀའི་ངང་ཚུལ་ལས། །ཇི་བཞིན་གནས་ལུགས་སུ་ནམ་མཁའ་ཁབ་མིག་དང་། །ཆུ་གཏེར་དཀྱིལ་འཁོར་དང་འཁྱོར་ཆུ་ཇི་བཞིན་འགྲན། །རྫས་མཚུངས་རྣམ་གྲངས་སུ་བརྗོད་ལ་འགོག་ཀྱང་མེད། །གཅིག་དང་མི་གཅིག་ཅེས་ཐ་དད་ཁས་ལེན་འདི། །སྨྱོན་པའི་གླུ་དབྱངས་ལྟར་ཚད་མ་མིན་ཞེས་ན། །འབྲུ་ཆན་དག་པ་དེ་ཆོས་ཉིད་གཉུག་མའི་ཁམས། །ཕབ་རྐྱེན་བཟང་པོ་ནི་བྱིན་རླབས་བླ་མའི་མཐུས། །དགེ་སྦྱོར་ཉམས་མྱོང་གི་དྲོད་ཀྱིས་ཉེར་སྨིན་ཏེ། །ཇི་བཞིན་རྟོགས་པ་ཡང་ཆ་ཤས་ཞིམ་ཆང་ལྡང་། །མདོ་རྒྱུད་གཞུང་མང་གི་གཙང་ཆུས་སྦྲན་བྱས་ཏེ། །ཐོས་བསྒོམ་ཟུང་འཇུག་གི་ལྟོ་རུ་འཐུང་བའི་མཐུས། །སྣ་ཚོགས་འགལ་མེད་ཀྱི་དབང་པོ་ར་ཡང་རོ། །གུ་ཡངས་བློ་བདེ་ཡི་སྨྱོ་གླུ་བླངས་བ་ན། །ཐ་སྙད་ཚིག་སྐམ་གྱི་འགལ་རྟགས་བྱེད་པ་དང་། །རྟོག་དཔྱོད་ཐེ་ཚོམ་ཅན་ཇི་ལྟར་དགྱེས་དགྱེས་མཛོད། །ལར་ནི་དོན་དམ་དུ་གཉིས་སྣང་ལས་འདས་པ། །དེ་བཞིན་གཤེགས་པ་ཡི་བཤུལ་ལམ་མཆོག་ཏུ་གསུངས། །ཀུན་རྫོབ་བདེན་ངོ་རུ་བཟང་ངན་སྒྱུ་མ་ལྟར། །སྣང་ཚུལ་མ་འདྲེས་པར་ཤར་ལ་འགོག་མི་འཚལ། །བར་སྐབས་སུ་གླུ་རུ་བླངས་པའོ། །</p><p class=\"tibetan-text\">ད་དུང་དེ་ཡི་འཕྲོས་གཞན་ཡང་ཅུང་ཟད་གླེང་ན། <br>དེ་ཡང་བདག་མ་སྐྱེས་པའི་གོང་ནས་ལོ་ཙཱ་བ་བཻ་རོ་ཙ་ནའི་ཐུགས་ཀྱི་སྤྲུལ་པའི་སྐུ་རིག་འཛིན་ཡོངས་ཀྱི་འཁོར་ལོས་བསྒྱུར་བ་ཆེན་པོ་པདྨ་བདེ་ཆེན་གླིང་པའི་ཞལ་སྔ་ནས་ད་སྟེ་ལོ་གསུམ་འདས་ཤིང་། བཞི་ལྔའི་ཁོང་དུ་ཡུལ་ཕྱོགས་འདིར་སྐྱེས་བུ་དམ་པ་ཞིག་གི་སྐྱེ་བའི་སྲིད་པ་བཟུང་བར་འགྱུར་རོ། །ཞེས་གསུང་གི་གསང་བ་མཐོན་པོས་སྒྲོགས་པར་མཛད་པ་ལ་སྐྱེ་བོ་ཕལ་ཆེ་བས་འཕྱ་རྒོད་ཀྱི་གནས་སུ་བྱས། དེ་ནས་ལོ་བཞི་པའི་ཁོངས་སུ་བདག་སྐྱེས་པ་ན་མགོན་པོ་དེ་ཡི་གདུལ་བྱ་གྱུར་པ་དག་གིས་ནི་བདག་ལ་སྤྲུལ་པའི་སྐུ་ཞིག་སྙམ་ནས་ཡིད་རྩེ་གཅིག་ཏུ་བརྟོན་པར་བྱེད་དོ། །གཞན་ཡང་ཡུལ་དེར་ས་བླས་སྒྲོགས་པ་ལྟ་བུས་རིག་འཛིན་པདྨ་མ་ཎིའི་སྤྲུལ་སྐུ་ཡིན་འདུག་ཅེས་ཀུན་ཏུ་གྲགས་སོ། །འོན་ཀྱང་གོང་མའི་དབོན་རིགས་རྣམས་ནས་རྗེ་བླ་མ་བསྐལ་བཟང་སོགས་ནི་རང་ཉིད་ཟུར་བཞུགས་ཚུལ་གྱི་འཕྲལ་དུ་དོ་གལ་མེད་ཚུལ་ཙམ་དང་། གཞན་གཞུང་བཞུགས་པ་ཚོ་ནི་རིག་འཛིན་གོང་མ་དེ་ཉིད་ཀྱི་ལུང་བསྟན་ལྟར་ཕལ་ཆེར་རང་མདོག་བསྟན་ཟིན་པ་དང་། མ་གཞི་ནས་ཀྱང་མཁྱེན་པ་ཟབ་ཅིང་རྒྱ་ཆེ་བའི་རང་བཞིན་གྱིས་གཞན་ཕྱོགས་ཀྱི་སྐུ་སྐྱེས་འདྲ་བྱུང་ན་དགྱེས་ཚོར་སྤྲོ་སྤྲོ་སག་སག་ནི་ཡོད་ཚོད་སྟེ་དུས་ཕྱིས་སྐབས་ངེད་ཀྱི་ཁུ་བོ་བླ་མའི་ཁུང་ས་དམར་བཀྲ་ཤིས་ཀྱི་སྐུ་སྐྱེར་གྲགས་པ་ཞིག་བྱུང་བ་དེ་ལ་བསུ་ཆང་བསྐྱལ། དར་སོགས་ཀྱང་གནང་སྐད་ཐོས་ན་རང་ཕྱོགས་ཀྱི་སྤྲུལ་སྐུ་དང་སྐུ་སྐྱེའི་མིང་ཅན་འདྲ་བྱུང་ན་དགྱེས་ཚོར་ཆེར་མེད་པ་ནི་རང་གཤིས་མི་ཡི་རིགས་རུས་ཀྱི་གནས་ལུགས་སུ་གྲུབ་པ་ལ་མ་མགུ་འཁོང་བྱེད་པའི་གནས་མ་ཡིན་ཞིང་། བདག་ལྟ་བུ་ནི་ཁོང་རྣམས་ཀྱི་དད་པའམ་མི་དད་པའི་ཚུལ་ཅི་འདྲ་བསྟན་ཀྱང་རེ་ལྟོས་ཏིལ་འབྲུ་ཙམ་འཆའ་དགོས་མེད་ན། དེ་ཕྱིར་ཀོ་ལོང་ཡང་མི་བདོག་མོད། ངེད་རང་ནས་ཀྱང་སྤྲུལ་སྤྲུལ་སྐྱེ་སྐྱེ་ལ་དགའ་ཚོར་ཆེ་བ་མེད་ན་ཁོང་ཚོ་ལ་ཅི་ཞུ། ཁོང་རྣམས་ཀྱི་མཛད་སྒོ་ནི་འཇིག་རྟེན་མི་ཆོས་ལ་སྤྱོད་བཞིན་དགྲ་གཉེན་གོ་ལྡོག་པའི་ཚུལ་གྱིས་གཞན་ཕྱོགས་སྒྲོ་བཏགས་ཙམ་ལ་ཡང་གསར་འགྲོགས་བཅས་ཏེ་བཀུར་བཀུར་ཅོག་ཅོག་དང་རང་ཕྱོགས་ཀྱི་སྐུ་སྐྱེ་སྤྲུལ་སྐུར་གྲགས་པ་ལ་མིག་བརྙས་དང་ཁྱད་གསོད་མ་ཐུབ་ན་མ་གཏོགས་གང་ཐུབ་གང་ལྕོགས་གནང་བཞེད་འདུག་པ་དེ་ཀ་ཡ་མཚན་པའི་གནས་སུ་ཆེ་བ་ཞིག་བྱུང་ནས་འདིར་སྨྲས་པ་ཡིན། ཨོཾ་མ་ཎི་པདྨེ་ཧཱུཾ་ཧྲཱིཿ འདི་དུས་སྐབས་ཡུལ་དེར་གཅོད་པ་ཨོ་རྒྱན་ཕུན་ཚོགས་ཞེས་ཕྱིས་གཏེར་སྟོན་ཁྱུང་དྲག་རྡོ་རྗེར་མངའ་གསོལ་བ་དེ་བཞུགས་ཤིང་འཕྲིན་ལས་རྒྱས་པའི་དུས་སུ་གྱུར་པས་ཁོང་ནས་ཕྱོགས་དེ་ཚོའི་གང་ཟག་སྔོན་བྱོན་འཁྲུལ་ཞིག་དབང་དྲག་རྒྱ་མཚོ་ཞེས་ཨོ་རྒྱན་གུ་རུས་ས་བཅུ་པའི་སྤྲུལ་པར་དབུགས་དབྱུང་བ་དེ་ཡི་སྐྱེ་བ་གནམ་ཆོས་མི་འགྱུར་རྡོ་རྗེ་ཡིན་པ་ཀུན་ཏུ་གྲགས་པ་བཞིན་དེ་བས་གཞན་པའི་ངོས་འཛིན་གསར་པ་མཛད་པ་སོགས་ཀྱི་ཐོགས་དྲངས་མཆོག་དམན་བར་མ་མང་པོ་ཞིག་གི་སྐྱེ་བ་ངོས་འཛིན་ལུང་བསྟན་འབྱམས་ཀླས་པ་གནང་སྐབས་ཡིན་པས། དེ་ཚེ་ངེད་ལ་པདྨ་ནོར་བུ་མ་ཡིན་ནམ་ཞེས་ཟུར་གྱི་དམོད་པས་ཕལ་ཆེ་ཐེ་ཚོམ་ཞིང་གོང་གི་དབོན་རིགས་རྣམས་ཀྱང་དེས་ཐེ་ཚོམ་པ་སྐད་ཟེར་ཡང་གནས་ལུགས་དངོས་མ་ནི་གོང་དུ་བསྟན་པ་དེའོ། །དོན་དུ་ཡང་བདག་རང་ནས་ཇོ་ནང་པའི་ལྟ་གྲུབ་འཛིན་པ་ཁ་ཤས་སྐྱེས་སམ་སྙམ་པ་ད་ལྟ་ཡང་འདུག དེ་བཞིན་ཀརྨ་པ་ཡབ་སྲས་དང་ལས་འབྲེལ་ཆེ་བ་ནི་ཡོད་ངེས་ཞིག་སྣང་། གཞན་སྐྱེ་བ་འོལ་ཅི་ཡད་ཡུད་དྲན་པ་ལྟ་བུ་ཡོང་གི་འདུག་མོད། རིག་འཛིན་པདྨ་ནོར་བུ་ཡིན་པ་ནི་ཆུང་ངུའི་སྐབས་བག་ཆགས་ཤིན་ཏུ་གསལ་བ་བྱུང་སྐད་ཀྱང་། དུས་ཕྱིས་རང་བློ་ལ་ནི་གཞན་པས་བག་ཆགས་འཐུག་པ་ནི་མི་གདའ་བ་དྲང་པོར་སྨྲ་བ་ཡིན། དེར་ཡང་མ་ཟད་རིག་འཛིན་པདྨ་མ་ཎི་རང་གི་སྒོས་ལུང་དུ། སྤྲུལ་པའི་སྐྱེ་བས་ལྷོ་ཕྱོགས་སུ༔ ཁ་བྱང་འཛིན་ཅིང་འགྲོ་བླར་བདག༔ ཅེས་སྣང་ན་ལྷོ་ཕྱོགས་ཀྱི་སྒྲ་སྤྱིར་གཏང་གི་མདོ་ཁམས་དབུས་འགྱུར་ཀཿཐོག་གི་ལྷོ་ནི་བཙན་རིར་བཞག་སྟེ། གཏེར་སྟོན་འཇའ་ཚོན་སྙིང་པོ་དཔལ་མགོན་གྱི་ལུང་བྱུང་ལས། ཀཿཐོག་ལྷོ་རུ་ནོར་བུའི་མིང་༔ ཡ་མཚན་ཤེས་རབ་སྙིང་རྗེར་ལྡན༔ དཔལ་མགོན་ཆོས་དང་འཕྲད་སྲིད་ན༔ དངོས་གྲུབ་མྱུར་དུ་ཐོབ་པར་འགྱུར༔ ཞེས་པས་གསལ་བ་དང་། ལུང་འཛིན་གང་ཟག་རང་གི་སྒྲུབ་གནས་བཙན་རིའི་ལྷོ་ནི་གྲོ་ལོད་སྟེ། བཀའ་འདུས་སྙིང་པོ་ཡིད་བཞིན་ནོར་བུའི་ཁ་བྱང་ལས། མདོ་ཁམས་གནས་ཀུན་གཙོ་བོ་ཡོངས་གྲགས་པ༔ གྲོ་ལོད་བྱང་ཕྱོགས་ཀཿཐོག་ལྷོ་ཕྱོགས་མཚམས༔ ཞེས་པས་བཙན་རི་གྲོ་ལོད་ཀྱི་བྱང་དུ་ཡོད་ན་བཙན་རིའི་ལྷོ་གཙང་ཁ་གྲོ་ལོད་ཡིན་པར་མངོན་སུམ་པས་བསྟན་ནོ། །དེ་བཞིན་བར་ཁམས་ཀྱི་ལྷོ་དང་དབུས་གཙང་གི་ལྷོ་ཁ་དང་ལྷོ་བྲག་མཁར་མཆུ་སོགས་འཇུག་སྒོ་མང་བར་མ་ཟད་སྐྱེ་བ་དངོས་གནས་དེ་ཡང་ཟབ་གཏེར་ལ་སྤྱོད་ཅིང་འགྲོ་བ་ཡོངས་ཀྱི་བླ་མར་གྱུར་པ་བཤད་ན། ངེད་ལྟ་བུའི་རྣལ་འབྱོར་གཉོམ་ཆུང་གྱི་ནར་སྤྱོད་པ་ཞིག་འབྱུང་རྒྱུ་མི་འདྲ་བས་སྔར་ནི་རྗེ་བླ་མའི་དྲུང་ཙམ་ལས་གཞན་རྣམས་ནས་ངེད་ལ་རེ་བ་བྱེད་མཁན་མེད་པ་དེས་གོ་བཅད། ད་དུང་ཡང་རེ་བ་མ་བྱེད་ཅིག རང་ངོས་ཀྱང་རིག་འཛིན་པདྨ་མ་ཎི་ཡི་སྐྱེ་བ་ཡིན་མིན་ཁྱད་པར་ཅུང་ཟད་ཀྱང་སྔར་ནས་མི་བདོག་ན། ད་ལྟ་ཡང་ག་ལ་བདོག་སྟེ་ཡིན་ལུགས་མངོན་སུམ་པ་འདི་ཀའོ། །ཡང་དུས་ཕྱིས་ངེད་ལོ་བཅོ་ལྔ་སྐོར་ལོན་པ་ན་གཏེར་སྟོན་ཁྱུང་དྲག་རྡོ་རྗེ་བ་སྟག་བུའི་ལྗོངས་སུ་འཕྲིན་ལས་བསྐྱངས་བར་ཕེབས་སྐབས་ཁོང་རང་གི་གཏེར་ལུང་དང་ཐུགས་མཁྱེན་གཉིས་སྦྲགས་ཀྱི་སྒོ་ནས་ངེད་ལ་བསྟོད་ར་ཚད་མེད་པ་དང་བཅས་ཤིང་རིག་འཛིན་པདྨ་མ་ཎི་ཏ་ཡིན་པ་ཨ་ཀྱང་དཔལ་ནམ་སྙིང་གི་སྤྲུལ་པའི་སྐུ་དངོས་གནས་ཟབ་གཏེར་གྱི་བདག་པོ་ཡང་ཡིན་ཚུལ་ཐག་རྦད་ཆོད་པའི་གསུང་དང་། ངོས་སུ་འཕྲད་དགོས་ཚུལ་གྱི་ཕྲིན་བྱུང་ཡང་དེ་སྐབས་འཕྲད་པ་ནི་མ་ཤར། སྤྱིར་ཡང་གང་ཟག་གི་ཚོད་གང་ཟག་གིས་འཛིན་དཀའ་བ་དང་། སྐྱེས་བུ་དམ་པ་རྣམས་ཀྱིས་ཀྱང་སྐྱེས་བུ་དམ་པ་རྒྱུད་ཚོད་མ་རྟོགས་པའི་ཚུལ་བསྟན་མང་དུ་བྱུང་བ་མཐོང་ཞིང་ཐོས་ན། བདག་ལ་ཡང་ཁོང་གིས་སྣ་ཚོགས་གསུང་དགོས་པ་བྱུང་བ་ཡང་ཐུགས་བདེན་པར་མཆིས་སོ། །<br>སྨྲས་པ། ཁོ་བོ་ལ་ཚེ་དབང་ནོར་བུ་སྐད། །ཡང་དག་གི་དོན་ལ་གཏད་པ་མེད། །བཟང་ན་ཡང་ཆོས་ཉིད་གཤིས་ལུགས་ཡིན། །ངན་ན་ཡང་ཆོས་ཉིད་རོལ་རྩལ་ཡིན། །བཟང་ངན་ཀུན་རང་སེམས་ཀྱི་བླ་བཏགས་ཡིན། །ངེད་རང་གི་རང་ངོ་རང་གིས་ཤེས། །མ་ཤེས་ཀྱང་བློ་བདེ་ཁོང་ནས་རྙེད། །གཞན་ཟེར་གྱི་ཁ་ལ་རྒྱུག་དགོས་ཆུང་། །ཡིན་ལུགས་ནི་སུས་ཀྱང་ཤེས་པར་དཀའ། །ཤེས་ཤེས་པོར་བྱེད་ལ་གཏད་ས་ཅི། །མི་ཤེས་པར་བཏང་སྙོམས་གནས་ན་མཚར། །ཡིད་ཆེས་ཞིག་བྱུང་ན་དངོས་སུ་བཞེས། །དྭངས་ལེན་ཚོ་རང་དང་བསྐལ་མཐུན་ངེས། །སྐལ་མེད་ཚེ་ལོག་ལྟ་ཅི་ཆེ་འཚལ། །ང་རང་ལ་ཁྱད་པར་ཡོད་དོགས་ཆུང་། །ཡོད་ན་ཡང་གཏད་མེད་དབྱིངས་ནས་སྤྲུལ། །མེད་ན་ནི་ངོ་བོའི་གནས་ལུགས་གདའ། །ཇི་ལྟར་ཡང་རང་བློ་བདེ་མོར་མཆིས། །འུད་སྒྲོག་ཞིག་ཐག་པ་མ་ལགས་སམ། །སྟོང་ཤོབ་ཞིག་མཛད་ན་དེ་འདྲ་མཆིས། །ཞེས་སོ། །དེ་ལྟར་ངོས་པདྨ་མ་ཎིའི་སྤྲུལ་སྐུ་ཡིན་པའི་གླེང་ཅི་རིགས་བྱུང་བར་བརྟེན། གོང་མའི་དབོན་རིགས་ནས་བླ་མ་ཀུན་བཟང་བྱ་བ་ཞིག་ཡོད་པ་དེ་གནས་བསྐོར་དང་སྟབས་སུ་ངེད་ཀྱི་གནས་ཚུལ་དྲི་བར་ཐོག་མ་རིག་འཛིན་ཆེན་པོ་ནུས་ལྡན་སྟག་ཤམ་ཅན་གྱི་ཞབས་ལ་གཏུགས་ཏེ་བཀའ་ལུང་ཞུས་པ་ན་ཞལ་སྔ་ནས་བཙན་རི་བཀྲ་དང་ཉེ་བའི་དུང་དཀར་རི་ཁྲོད་དུ་སྐྱེ་བ་དེ་ནི་གཞན་ཕན་འཕྲིན་ལས་ཅན་ཞིག་ནི་ཡོང་ངེས་གདའ་ལ། ངེད་ཀྱི་ཡོན་ཏན་གྱི་གདུལ་བྱ་སྐྱོང་བ་པོ་ཕྱོགས་དེར་འབྱུང་བའི་ལུང་བསྟན་ཡོད་པ་དང་ཁྱེད་རང་རྣམས་ཀྱི་བླ་མའི་སྐྱེ་བ་ཡང་ཡིན་ཤས་ཆེ་ཞེས་གསུང་པ་ཙམ་བྱུང་ཞིང་། དེ་ནས་མི་རིང་བར་རིག་འཛིན་རྗེ་སྟག་ཤམ་ཅན་སྐུ་ཞི་བའི་དབྱིངས་སུ་གཤེགས་པ་ལ་བརྟེན་སླར་ཡང་རིག་འཛིན་རྩལ་འཆང་གཏེར་སྟོན་རོལ་པའི་རྡོ་རྗེ་འཆང་ཆེན་པོའི་སྐུ་མདུན་དུ་དོན་འདིའི་ཆེད་དུ་བཅར་བ་ན་གང་དེའི་ཞལ་སྔ་ནས་རྗེ་བཙུན་པདྨ་མ་ཎི་དང་རྒྱུད་གཅིག་ཅིང་གང་སྤྱིར་རིག་འཛིན་རྩལ་འཆང་སྔགས་ཀྱི་བདག་པོ་ཞིག་གིས་བྱིན་གྱིས་རླབས་པའི་སྤྲུལ་པ་འཁྲུལ་མེད་དུ་དབུགས་དབྱུང་བར་མཛད་སྐད་དོ། །དེ་ཡང་དེང་སང་གཞན་ཁ་ཅིག་སྤྲུལ་སྐུ་ལ་བརྟག་དཔྱད་མེད་པ་རི་བོང་ཅལ་སྒྲོགས་ཀྱི་རྗེས་སུ་འབྲང་བ་ལྟ་བུ་མ་ཡིན་པར་ཇི་བཞིན་དམ་པར་གྱུར་པ་ལ་ནན་ཏན་གྱི་དྲི་བར་བྱེད་པ་པོ་དེ་ནི་དབོན་པོ་གཞུང་བཞུགས་སྤྱིར་བཏང་དང་མི་འདྲ་བ་དེ་ལྟ་དམ་པའི་རིགས་དབོན་དུ་འོས་པའི་ཡ་རབས་ཀྱི་ངང་ཚུལ་འཛིན་པ་ན་རྗེས་སུ་ཡི་རངས་པའི་གནས་སུ་སྣང་ངོ་། །དབོན་པོ་ཀུན་བཟང་དེ་ངེད་ལ་གུས་ཤོག་མེད་ཀྱང་ཁོང་དབུས་གཙང་ནས་རང་གནས་སུ་ལོག་བྱོན་དུས་ངེད་གདན་སར་སླེབ་མ་ཐག་པའི་སྐབས་ཡིན་ལ། ངོས་ལ་སྔར་དང་མི་འདྲ་བའི་སྙིང་ནས་དགའ་གུས་བྱེད་ཀྱི་འདུག་པ་དོན་འདིའི་ཡིན་པར་སྣང་ཡང་དེ་སྐབས་གང་ཡིན་སྙམ་པ་ལས་མ་བྱུང་། ཕྱིས་གོང་གི་ལོ་རྒྱུས་འདི་རྣམས་ནི་རིག་འཛིན་རོལ་པའི་རྡོ་རྗེའི་ཉེ་གནས་སོགས་ཁུངས་ལྡན་དུ་མའི་ངག་ནས་ཐོས་ཤིང་ཁོང་ལ་རིག་འཛིན་ཆེན་པོ་དེ་ཡི་ཞབས་ནས་ཚུལ་འདིའི་བཀའ་ལུང་ཡི་གེར་ཡང་གནང་ཡོད་ཚོད་འདུག་རུང་ད་ལྟ་ཕན་ངེད་ཀྱི་ལག་ཏུ་ནི་མ་བྱུང་ངོ་། །དེ་ལྟ་ན་ཡང་སླར་ནི་རང་གིས་རང་ལ་མ་ཁྲེལ་ཞིང་ལྐོག་གྱུར་གནས་གཞན་མེད་པའི་གདེང་ཆུང་ཞིག་མེད་ན་བརྟག་པ་ཡིན་ཡིན་མོ་དང་། ལུང་བསྟན་ཡིན་ཡིན་མོ་གཅིག་པུས་ཀྱང་དགོས་པ་དབེན་གྱི། ངེད་ལ་ནི་དེ་ཙམ་གྱི་ཁྱད་པར་ཡང་མི་བདོག་གོ །དེ་ལྟ་ན་ཡང་འཕགས་པའི་ས་ལ་ངེས་པར་བཞུགས་པའི་དམ་པ་ལས་ཀྱང་དམ་པ་སྤྲུལ་པའི་གཏེར་སྟོན་རིག་འཛིན་རྩལ་འཆང་དེ་རྣམས་ཀྱི་རྡོ་རྗེའི་གསུང་གི་མགྲིན་གཅིག་ཏུ་ཁོ་བོ་ལྟ་བུའི་སོ་སྐྱེས་ཐ་ཆད་གྱུར་ཀྱང་རྗེས་སུ་བཟུང་ཕྱིར་སྐྱེས་བུ་དམ་པར་དབུགས་དབྱུང་བར་མཛད་པ་ལ་ནི། རང་ཉིད་ཁེངས་ནས་ལྟོས་མེད་ཀྱི་ང་རོ་ནི་མ་ཡིན་ལ་བདག་ཉིད་བསྐལ་པ་བཟང་པོ་ནི་ཡིན་པར་བྱེད་དོ། །<br>འདིར་སྨྲས་པ། རྟ་མཆོག་ཧེ་རུ་ཀ་དཔལ་སྟག་ཤམ་ཅན། །རྡོ་རྗེ་ཁྲག་འཐུང་ངོ་བོ་བདེ་ཆེན་གླིང་། །གསང་བདག་རྡོ་རྗེ་ཆོས་མཆོག་རོལ་རྡོ་རྗེ། །རྣམ་གསུམ་ལུང་གི་སཱ་ར་ཛའི་མེ་ཏོག །བསྐལ་བཟང་ཁྱབ་འཇུག་སྤྱི་བོར་བཅིངས་པ་ན། །རང་འདོད་བཅོས་མའི་མཚོན་གྱིས་འཇིགས་མིན་པའི། །དོན་གཉིས་བདུད་རྩིའི་དགའ་སྟོན་ཅིར་ཡང་ཐོབ། །ནུས་ལྡན་འདི་ཀོ་གང་གི་དྲིན་ལས་བྱུང་། །ཞེས་སོ། །གང་ལྟར་ན་ཁོ་བོ་ཅག་སུ་ཞིག་གི་སྐྱེ་བར་ངོས་ཟིན་ཀྱང་རུང་ལ་མ་ཟིན་ཀྱང་རུང་། མཛུབ་བུ་འཛུགས་ས་ཡོད་ཀྱང་འདྲ་མེད་ཀྱང་འདྲ། མིང་སྤྲུལ་སྐུའམ་སྐུ་སྐྱེར་གྲགས་པ་འདི་ནི་མ་ཡི་ལུས་ལ་མངལ་ཆགས་ནས་བརྩམ་རང་བཞིན་གྲགས་པ་དང་། རང་གི་ཡང་ལོ་ལྔ་མར་བཏགས་སུ་སྔོན་གནས་ཀྱི་གཏམ་ཅི་རིགས་གླེང་བར་བརྟེན་རྩ་ཁམས་ཅུང་ཟད་དྭངས་བས་སྔོན་གནས་དྲན་རྒྱུ་ཡོད་པའི་རིགས་ཞིག་ཡིན་སྣང་བ་ལས། ཚེ་འདིའི་ཕ་མ་གཉེན་ཚན་སོགས་ཀྱིས་ལྐོགས་སུ་བསླབ་པའི་བཅོས་མ་དང་། རང་བཞིན་སྤོམ་ཡོར་གྱི་བཟང་རྫུན་བྱོ་ཟོལ་དུ་བཞག་པ་དེ་འདྲ་ནི་མིན། དེ་བཞིན་གྲྭ་འཁོར་སྦྱིན་བདག་གི་བཅོས་པ་ཡང་མེད་ལ། གོང་མའི་སྐུ་ཉེ་གྲྭ་དབོན་གྱིས་བཅོས་དགོས་ནི་དེ་བས་ཀྱང་སྤུ་རྩེ་བརྒྱར་གཤག་ཙམ་ཡང་མ་དགོས་པ་གོང་དུ་གསལ་བ་དེར་གདའ། ཚུལ་འདི་དག་འོག་ཏུ་ཡང་ཅི་རིགས་འཆད་པར་འགྱུར་རོ། །<br>འདིར་སྨྲས་པ། དེས་ན་འཇིག་རྟེན་གྱི་གཏམ་དཔེ་ལྟར། །སུ་ཡི་ཡང་བཅས་བཅོས་མ་བྱས་པའི། །རང་ཉིད་ལ་བྱུང་བའི་རང་བྱུང་དེ། །རང་བྱུང་གི་རྡོ་རྗེ་ཟེར་ན་གྱིས། །འོན་ཀྱང་ནི་ངེས་ཏིག་ཅི་ཞིག་ཡོད། །བདེན་རྫུན་ཀུན་རྣམ་རྟོག་བརྟག་པ་བ། །ཁྲིག་ཁྲིག་དང་ཁད་ཁད་ཡོད་དོགས་ཆུང་། །རང་རིག་ལ་བདེན་རྫུན་གོས་མ་མྱོང་། །ཡང་དག་གི་དོན་ལ་དེ་ཙམ་ལས། །སྲིད་ཞི་ཀུན་རྫུན་པར་ཟད་ཅེ་ན། །ང་བདེན་འདི་རྫུན་གྱི་མཐིལ་ལ་ཐུག །དེ་བས་ན་གུ་ཡངས་མི་བདེའམ། །ཞེས་སོ། །ལར་ནི་དེང་སང་དབང་གིས་མཆོག་དམན་བར་མ་གང་ཟག་སྣ་ཚོགས་པའི་སྐྱེ་སྲིད་ཡིན་ནོ་ཞེས་པ་ལ་མ་ཉུང་ཙམ་ནི་ཡོང་ཞིང་འདུག་པ་ཡི། ཁོ་བོ་དེ་འདྲར་སྔ་སོར་ནས་དག་སྣང་འབྱོང་པོ་ཞིག་ཡོངས་ཀྱི་མེད་དེ། ཇི་ཕྱིར་སྐྱེ་བ་དྲན་པའི་མཐུ་ལ་བསྟན་ཏེ་བླ་མའི་གོ་འཕང་ལ་བསྒྲོད་རྒྱུ་ཡིན་ན། དྲན་དགོས་ངེས་པའི་དཀོན་མཆོག་གསུམ་ལ་དད་པ་རྣམ་པར་དག་པ་དང་། དེ་བཞིན་གཏོང་བ་དང་དགེ་སྡིག་ལས་འབྲས་ཀྱི་འདོར་ལེན་ཚུལ་ཁྲིམས་དང་བླ་མ་ལ་མོས་གུས་དམ་ཚིག་ངོས་ལྐོག་མེད་པ་དང་དམ་པའི་ཆོས་ཤེས་པ་དང་། བསམ་གཏན་སོགས་དགེ་བའི་བག་ཆགས་ཚུལ་བཞིན་དུ་དྲན་ཞིང་སྤྱོད་དགོས་རྒྱུ་འདྲ་བ་ལ། དེ་ལྟ་མ་ཡིན་པར་ཁ་ཅིག་ནི་སྟེས་དབང་གིས་ཚིག་ཙམ་པར་སྐྱེ་བར་གྲགས་པ་དང་། གཞན་ནི་གཉེན་ཚན་ངོ་ཤེས་པ་དང་རྫས་ནོར་ཙམ་ཞིག་ངོ་ཤེས་དྲན་ཡུལ་བྱས་ནས་མིང་སྐུ་སྐྱེར་འབོད་པ་འདི་ཡང་དག་པའི་སྐྱེ་བར་ཇི་ལྟར་འགྱུར་རམ་སྙམ་པར་རང་དང་རང་འདྲ་ཀུན་ལ་དེ་ལྟར་སེམས་ཞིང་ཡི་མུག་ལྡང་བ་ཁོ་ན་བྱུང་མོད། དུས་ཕྱིས་བརྟགས་ཤིང་དཔྱད་པ་ན་རྣམ་རྟོག་ལ་འདི་ལྟར་ཤར་ཏེ། རྒྱལ་བས་གདུལ་བྱ་འདུལ་ཚུལ་ཐབས་ལ་མཁས་པས་བྱིན་གྱིས་རླབས་ཚུལ་གྱི་ཁྱད་པར་ལས། དཔལ་ལྡན་ཀརྨ་པ་ཡབ་སྲས། འབྲི་འབྲུག་སོགས་བཀའ་བརྒྱུད་ཀྱི་སྤྲུལ་པའི་སྐུ་སྐྱེ་བ་རིམ་ཅན་དང་། བསྟན་པའི་མངའ་བདག་དཔལ་རི་བོ་དགའ་ལྡན་རྗེ་རིན་པོ་ཆེའི་བསྟན་འཛིན་མཆོག་འཇམ་དཔལ་ཚངས་པ་ལྷ་ཡི་མེ་ཏོག་གི་སྤྲུལ་པའི་སྐྱེ་འཕྲེང་གཙོ་བོར་གྱུར་པ་ཡབ་སྲས་བླ་ཆེན་པོ་རྣམས་ཏེ། གང་ཆེ་དེ་རྣམས་ཀྱང་ཨོ་རྒྱན་གུ་རུའི་ལུང་གིས་ཟིན་ཅིང་མར་མེ་གཅིག་ལ་གཅིག་མཆེད་པའང་བརྐོས་ཕོར་གཅིག་ནས་བྱུང་བའི་སཱཙྪ་བཞིན་དམ་པའི་རྣམ་ཐར་འབྲི་བ་མེད་པ་བརྒྱུད་མ་ནས་བརྒྱུད་མར་སྟོན་པར་མཛད་པ་བྱུང་བ་ནི་ངོ་མཚར་མཆོག་གི་ཡུལ་ཡིན་མོད། དེ་བས་གཞན་ཡང་སངས་རྒྱས་སྐྱེས་བུ་འཕགས་པའི་སར་བཞུགས་པས་འགྲོ་བའི་དོན་དུ་སྨོན་ལམ་དབང་གི་སྐྱེ་བ་སྤྲུལ་སྐུར་བསྟན་ནས་མ་ཉམས་རིག་པའི་མཐུས་སྐྱེ་སྲིད་བརྒྱུད་མ་གསལ་པོར་གཟིགས་པ་སྤྲུལ་པའི་སྐུ་མཆོག་དམ་པ་ནི་གསར་རྙིང་ཀུན་ལ་སྔོན་རབས་ད་ལྟ་ཀུན་ཐོར་རེ་བ་འབྱོན་པ་དེ་རྣམས་ནི་སངས་རྒྱས་སུ་མཚུངས་པ་ཙམ་དུ་མོས་ཤིང་དད་པ་གཞན་གྱི་མི་ཕྱེད་པ་ཡོད་ལ། རང་ཉིད་དེ་ལྟའི་གོ་འཕང་ཐོབ་འདོད་པས་གཉིས་མེད་ཡེ་ཤེས་ཀྱི་སྐུ་འགྲུབ་པའི་རྒྱུ་ཚོགས་ལ་རབ་ཏུ་བརྩོན་པར་བློ་འདུན་ཡང་དག་པར་མཆིས་བཞིན་པ་འདི་ཡིན། གཞན་ཡང་མོས་སྤྱོད་པ་སྐྱེ་སྲིད་དྲན་ཞིང་དགེ་འབྲས་བསྒྲུབ་པ་ལ་འབད་པ་ཅན་ཡང་འཕགས་པའི་ས་ལ་ཉེ་བས་དེ་དང་མཚུངས་པར་བཅོས་མིན་གྱི་དད་པ་བརྟན་པོ་ཡོད་ཅིང་སྤྱིར་མོས། འཕགས་ནང་གི་རྒྱུད་ཚོད་ཇི་ལྟ་བ་ནི་རྒྱལ་དང་རྒྱལ་ཚབ་སར་གནས་པའི་སྤྱོད་ཡུལ་ལས་གཞན་གྱིས་དཔག་པར་མི་ནུས་ཤིང་རྩོད་བྲལ་ལུང་གིས་ཟིན་པའི་སྐྱེས་ཆེན་རྣམས་ཀྱིས་ནི་ཅི་མཛད་ཡེ་ཤེས་རོལ་པར་གྱུར་པས་དཔྱད་གཞི་ལས་འདས་མོད། གཞན་དུ་ན་སོ་སྐྱེ་ཡི་སྐྱེ་བར་གྲགས་ཀྱང་ཆོས་བཞིན་སྤྱོད་པ་ལ་ཡང་བསམ་གྱིས་མི་ཁྱབ་པར་དྲན་ནས་དད་པའི་སྤུ་གཡོ་བ་ཞིག་ནི་ཁོ་བོའི་རྒྱུད་ལ་ཤར་བ་བྱུང་ངོ་། །<br>འདིར་སྨྲས་པ། ཨེ་མ། སངས་རྒྱས་རྣམས་གདུལ་བྱའི་དོན་ཕྱིར་དུ། །གང་འདུལ་གྱི་སྤྲུལ་སྐུ་ཅིར་ཡང་ཤར། །འཕགས་ཆེན་གྱི་ས་ལ་བཞུགས་པ་རྣམས། །སྐྱེ་སྲིད་ནི་དུ་མར་ཅིས་མི་སྟོན། །རྒྱ་ཆེ་ལ་རྒྱུན་ཆད་མེད་པ་འདི། །རྒྱལ་བ་དང་རྒྱལ་སྲས་རྣམ་ཐར་རྟོགས། །སྣ་ཚོགས་ཀྱི་གཟུགས་སྐུ་བསམ་ཡས་ན། །སྒམ་སྒམ་པོའི་དཔྱད་པ་པྲ་ཆལ་ཡིན། །འཕགས་པ་ཡི་སྒྱུ་འཕྲུལ་ཚད་བཟུང་འདས། །གང་གང་ལ་དེར་འདུལ་རོལ་བར་སྟོན། །མཁས་པར་ཡང་བརྫུ་ལ་རྨོངས་པར་བརྫུ། །བཙུན་པ་དང་འཆལ་པ་ཅིར་ཡང་བརྫི། །ཞི་བ་དང་ཁྲོ་ཡང་དེ་བཞིན་སྟོན། །རྩིང་པོ་དང་ཞིབ་མོ་ཅིར་ཡང་སྤྱོད། །འདོད་དགུ་ལ་དབང་བསྒྱུར་སྒྱུ་འཕྲུལ་ཆེ། །ཟེར་མོད་ཀྱི་ཐོས་བསམ་ཨ་ལ་ལ། །རང་བློ་ནི་དག་སྣང་ལམ་ནས་དྲངས། །མོས་གུས་ཀྱི་ཡུལ་གྱུར་བསམ་ཡས་མོད། །གཞན་སྣང་དང་བསྟུན་ནས་ཚིགས་བཅད་ལ། །བྲག་ཆ་ལྟར་ཤེས་ན་མི་ཚར་རམ། །འོན་ཏེ་ཡང་ལྷག་བསམ་དག་པས་ན། །འགལ་འདུ་ཡི་ཡུལ་མེད་ངེས་པར་བདེན་ཞེས། །ཞེས་པའོ། །སྤྱིར་འདི་ལྟར་དུ་གོ་དགོས་ཏེ། དེ་ཡང་སྐྱེ་བ་སྔ་མ་ཞིག་བཟང་པོ་ཡིན་ཞེས་པའི་སྒྲིབས་ཤིང་ལ་མ་བརྟེན་པར། སྐྱེ་ཐོགས་དེར་ལུང་བསྟན་ཚད་མས་ཟིན་ངེས་པ་ནི་ཇི་མཛད་ཡེ་ཤེས་རོལ་པར་དག་སྣང་སྦྱངས་ལ་གལ་ཏེ་སྐྱོན་དུ་སྣང་བ་ལྟར་ཡང་རང་སྣང་གི་སྐྱོན་དུ་ཤེས་པར་བྱ་དགོས། ལུང་བསྟན་ཚད་མ་ནི་གང་ཞེ་ན་རྒྱལ་བས་མདོ་རྒྱུད་ནས་ལུང་བསྟན་པ་མང་དུ་འབྱུང་ཡང་གསལ་ཁ་ཅན་རེ་རེ་ཙམ་ལས་དགོངས་པ་ལེན་ལུགས་ཀྱི་དབང་གིས་གསལ་པོར་རྟོགས་དཀའ། གང་ཟག་མངོན་ཤེས་ཕྱོགས་རེ་བའི་ལུང་ལ་ནི་རྒྱལ་བའི་གསུང་ལྟར་གྱི་དཔང་པོ་མི་ཐུབ་མོད། དེས་ན་གུ་རུ་པདྨའི་གསུང་ནི་རྒྱལ་བའི་བཀའ་དང་ཐ་དད་དུ་མི་དམིགས་པས་ན་དེ་ཡི་ལུང་ཡིན་ངེས་རྩོད་བྲལ་བར་སྐབས་ཀྱི་བཅོས་ལྷད་མ་བྱུང་བ་དེ་ནི་ཡིད་བརྟན་གདེང་ཐུབ་ཡིན་པས་ན། ཡིན་མིན་གོང་མའི་ལུང་གིས་ཟིན་ལ་བྱེད༔ གསུངས་པ་ལྟར། གཏེར་ཁ་ཚད་མ་ནས་ལུང་བསྟན་ཅིང་མངོན་ཤེས་ཅི་རིགས་ལྡན་པའི་སྐྱེས་བུ་གཟུར་གནས་པས་ངོས་བཟུང་བ་དེ་ནི་དམ་པ་སྟེ་ཅི་མཛད་ཡེ་ཤེས་རོལ་པར་དག་སྣང་སྦྱངས་དགོས་པ་ཞེས་པ་དེ་ཡིན། གཞན་ནི་དེང་སང་དུས་སྙིགས་ཀྱི་ལང་ཚོ་ངོམ་པ་ཉིད་ཀྱི་ལུང་བསྟན་ཡིན་ཞེས་ཞལ་གཟིགས་རྣལ་ལམ་ཐུགས་མཁྱེན་དང་གཏེར་ཤོག་ནས་ཕབ་ཁུལ་གྱི་བསླད་ཅན་མང་པོ་རླུང་ལྟར་འཚུབ་ཅིང་འདིར་སྣང་གི་རེ་དོགས་དབྱར་ཆུ་ལྟར་འཁྲུགས་ནས་ཁ་བསག་ངོ་འཇོ་༼ངོ་བསྟོད༽གཅམ་བུའི་ལྷ་བདུད་དུ་ལུང་བསྟན་པར་བྱེད་པ་རྣམས་ནི་སྦང་ཟན་ཅང་རེ་ཡི་དོ་ཟླར་ཡང་མི་འཇོག་གི་དེ་ལས་གཞན་ནི་སྨྲ་བར་མི་བྱའོ། །འོན་ཀྱང་གསེར་ལ་ཞན་ནས་ར་གན་གསེར་བསྒྲུབ་དང་། ར་གན་མང་བའི་ཤན་ཤོར་གྱི་གསེར་ར་གན་དུ་བསྒྲུབ་པ་གཉིས་ཀ་མི་བྱ་སྟེ་བརྟགས་ཤིང་དཔྱད་པ་རང་གལ་ཆེ་འོས་སུ་གདའ། འོན་ཀྱང་དེང་སང་བརྟག་ལོང་མེད་པར་བླུན་པོ་གྲགས་རྗེས་སུ་འབྲང་བ་འབའ་ཞིག་གོ །དེ་ལས་གཞན་ནི་སྐྱེས་ཆེན་དམ་པ་སྐྱེ་བའི་ཕྲེང་བར་མཁས་བཙུན་བཟང་པོའི་རང་བཞིན་ཅན་ཡོངས་ཀྱི་བླ་མར་གྱུར་པ་རྣམས་ལ་ནི་དཔྱད་དུ་མི་རུང་མོད། དེ་མིན་སྐྱེ་བ་ཡིན་མིན་ཙམ་ལ་རགས་མ་ལུས་པར་ཚེ་འདིར་སྡོམ་གསུམ་རྣམ་པར་དག་ཤེས་རབ་གསུམ་གྱི་རྩལ་ཁ་རྫོགས། རང་འདོད་མེད་པའི་ལྷག་བསམ་གྱིས་གཞན་ཕན་རྒྱལ་བསྟན་སྤེལ་ལ་བརྩོན་ཤིང་ཆོས་རྣམ་ཐར་གྱི་སྟོན་ནུས་པ་དེ་ལྟ་བུ་ནི། རང་སྐད་བརྒྱབ་ཅིང་བྱང་ཆེན་གྱི་ཤུལ་དུ་ཞུགས་འགྲོ་བ་ལ་སྐལ་ལྡན་འཚོ་འདུ་ཞིང་སྐལ་མེད་ཚོ་བྱེར་བ་ལས་ལུང་བསྟན་བཟང་ངན་གྱི་དཔྱད་པ་གང་ཡང་བྱར་མེད་ཅིང་བྱས་ཀྱང་དགག་སྒྲུབ་ཀྱི་ནུས་པ་དེ་ལ་མངོན་པར་མི་ནུས་པ་ཉིད་དོ། །<br>སྨྲས་པ། ཁ་གཅིག་ནི་གྲགས་ལྡན་སྐྱེ་བའི་སྲིད། །བསམ་བཞིན་པར་ཡང་ཡང་འགྲོ་དོན་མཛད། །སྐྱེ་རྒུ་སྤྱིའི་བླ་མར་མངོན་པར་འཕགས། །སྐྱེས་བུ་མཆོག་དེ་ལ་ཅིས་མི་སྨྲ། །འགའ་ཞིག་ནི་བསླབ་གསུམ་རྩལ་ཁ་རྫོགས། །དོན་གཉིས་པོ་ལྷུན་གྲུབ་རང་གདང་ཐོབ། །རྒྱལ་བསྟན་གྱི་སྲོག་ཤིང་ཉམས་མེད་འཛིན། །རྐང་གཉིས་ཀྱི་སེང་གེར་དེ་ངེས་མོད། །དེ་ལྟ་ཞིག་མིན་ཀྱང་ཡང་དག་གི །རྫོགས་སངས་རྒྱས་པདྨ་འབྱུང་གནས་བཀའ། །ཇི་བཞིན་པར་ལུང་གིས་ཟིན་པ་ན། །ཅི་མཛད་ཀྱང་ཡེ་ཤེས་ལོས་རང་བལྟ། །ཞེས་སོ། །དེ་ལྟར་ལས་ཁོ་བོ་ཅག་སོགས་སྐུ་སྐྱེར་གྲགས་པ་རྣམས་ནི་ད་ལྟའི་དལ་འབྱོར་གྱི་རྟེན་ཐོབ་པ་འདི་ཀ་ཆུད་མ་ཟོས་པར་རྒྱལ་བའི་བཀའ་བཞིན་དུ་ཆོས་མཐུན་མ་བྱུང་ན་སྐྱེ་བ་རབ་རིབ་ཞིག་དྲན་པར་ངོ་མཚར་མི་ཆེ་བར་རང་གིས་རང་ལ་ངེས་པ་རྙེད་ཀྱི། སྐྱེ་བ་རབ་རིབ་དྲན་པ་གཅིག་པུས་ཕན་ཐོགས་ན་ཕལ་པ་འགའ་ཞིག་རྟ་དང་བ་ལང་བྱ་རོག་སོགས་སུ་སྐྱེས་པ་དང་། གཞན་ལྷོ་བལ་གྱི་མི་ཁ་ཅིག་ནི་སྦྲུལ་སྦྲམ་ཆེན་དང་གླང་ཆེན་སྐྱེས་པ་དྲན་པ་སོགས་དང་མིར་སྐྱེས་པའི་ནོར་རྫས་གཉེན་ཚན་གསལ་པོར་དྲན་པ་ཆེས་མང་དུ་ངོས་རང་ནས་མཐོང་མོད། དེ་དག་ཚེ་འདིར་ཆོས་མ་སྤྱད་ན་བྱང་ཆུབ་སྙིང་པོར་སྤུ་རྩེ་བརྒྱ་སྟོང་གཤག་པའི་ཚལ་པ་ཙམ་ཡང་ཉེ་མི་འགྲོ་བར་མངོན་སུམ་དུ་གྲུབ་པ་ལ་སྐྱེ་བ་ཉི་ཚེ་བ་དེ་ལྟ་བུ་ལས་ཆེར་ལྷག་པའི་མུ་སྟེགས་ཀྱི་རྣལ་འབྱོར་པ་མཐུ་ཆེ་བ་ལ་ལས་སྐྱེ་བ་བརྒྱད་ཁྲི་མར་བཏགས་ཙམ་རེ་དྲན་པར་བཤད་པ་དེ་རྣམས་ཡང་བདག་མེད་པ་མ་རྟོགས་པས་བྱང་ཆུབ་ཀྱི་རྒྱུར་མི་འགྲོ་བར་གསུང་ན། སྐྱེ་བ་མག་མོག་ཙམ་རེ་དྲན་པར་ངོ་མཚར་ཆེ་བ་རུ་མི་སེམས་མོད། ཅི་ཕྱིར་ཟག་མེད་རྡོ་རྗེའི་སྐུར་གཤེགས་པའི་སྐྱེས་བུ་དང་གྲུབ་པ་མཆོག་ཐོབ་པ་ཕལ་མོ་ཆེ་དང་། དེ་བཞིན་རྒྱལ་བའི་བསྟན་འཛིན་སྐྱེས་བུ་ཆེས་ཆེ་བ་མཆོག་ཏུ་མཁས་པ་དང་བཙུན་པ་དང་དམ་པར་གྱུར་པ་རྣམས་ནི་དེ་རྣམས་ཀྱང་མང་ཞིག་སྐྱེ་བ་དྲན་པ་ཡང་གཞིར་བཅས་དེ་བས་ཀྱང་མཆོག་གི་སྤྲུལ་པའི་སྐུ་ཆེན་པོའི་རོལ་པར་གྱུར་པ་ཡང་ཡོད་མོད། འོན་ཀྱང་ཐོག་མ་ཉིད་ནས་སྐུ་སྐྱེ་དང་སྤྲུལ་སྐུར་མིང་བཏགས་ནས་བག་མེད་དཀོར་གྱི་འདམ་དུ་བྱིང་བ་མི་མཛད་པ་ཁོ་ན་ནི་དམ་པ་མཆོག་རྣམས་ཀྱི་རྣམ་ཐར་ལོ་རྒྱུས་མཐུན་པར་བྱུང་བ་དག་བལྟས་པས་ཤེས་པ་ཉིད་དོ། །ཚུལ་དེ་ཡང་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་མཐུས་འཕགས་པའི་ས་ལ་གནས་པ་འགའ་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པ་དང་སྦྱང་བའི་ཕྱིར་དུ་ཐོག་མར་སྐྱེ་བ་དང་སྤྲུལ་སྐུའི་ཐ་སྙད་མེད་པར་མི་ཕལ་པའི་ཚུལ་དུ་བྱིན་གྱིས་བརླབས་ནས་རིགས་མཐུན་གྱི་འགྲོ་བ་མངོན་གྱུར་དང་ལྐོག་གྱུར་གྱི་དོན་ཤིན་ཏུ་རྒྱ་ཆེ་བར་སྤྱོད་ཅིང་དེ་དག་གི་ངང་ཚུལ་ཡང་ལ་ལ་ནི་གཞན་གྱིས་གཏན་ནས་མི་ཤེས་པ་ཤས་ཆེ་བ་དང་། ལ་ལ་ནི་གཤེགས་ནས་འགྱང་ཙམ་ནས་དང་། ལ་ལ་ནི་གཤེགས་པའི་འོག་ཙམ་ནས་ཤེས་པ་ཡང་ཡོད་ལ། དེ་བཞིན་བདུད་ཀྱི་སྤྲུལ་པ་ཡང་དགྲ་བཅོམ་པའམ། གྲུབ་པ་ཐོབ་པ་དང་བྱང་འཕགས་ཆེན་པོའི་ཚུལ་སྟོན་ཏེ། ཆོས་ལྟར་དུ་སྣང་ཞིང་ཆོས་ཀྱི་གནད་བཅོས་ཏེ་བསྟན་འགྲོ་མང་པོ་ལ་གནོད་པར་བྱེད་པ་ཡང་གནས་སྐབས་བདུད་ཀྱི་བྱིན་གྱིས་གཞན་གྱིས་རྟོགས་པར་དཀའ་ཞིང་། འགའ་ཞིག་ནི་གཤེགས་པའི་འོག་ཙམ་ན་རྟོགས་པ་དག་ཡོད་དེ། སྔོན་རྒྱ་གར་ཡུལ་དགེ་སློང་ལྷ་ཆེན་པོ་དང་བདུད་ཀྱི་སྤྲུལ་པ་དགེ་སློང་བཟང་པོར་གྲགས་པ་ཡང་ནམ་འཆི་བར་ཚུལ་དེ་གཞན་གྱིས་མ་ཤེས་པ་ལྟ་བུའོ། །གཞན་ཡང་སྐྱེས་བུ་དམ་པ་རྣམས་ཀྱི་སྤྲུལ་སྐུ་དངོས་གནས་སྐྱེ་བ་ཧ་ཅང་གི་མི་གསལ་བའི་ཚུལ་དང་། འདྲ་མིན་བརྫུ་མ་དག་ནག་ཕྱོགས་གདོན་རིགས་ཀྱིས་བརླམ་ནས་སྔོན་གནས་གསལ་པོ་བཤད་ཤེས་པ་སོགས་འཕྲལ་དུ་དབྱེ་གསལ་གྱི་གནས་ཤིན་ཏུ་དཀའ་བ་ཡང་ཤེས་ཤིང་གོ་དགོས་པ་དང་། ཡང་ཁ་ཅིག་ཚིག་ཟུར་རེས་སྟབས་ལེགས་ཏེ་སྐྱེས་བུ་དམ་པ་མཆོག་རྣམས་ཀྱི་སྐྱེ་བར་སྨོས་ཏེ་དེ་ཡི་རྐང་དྲངས་བ་སོགས་ནི་མིང་ཙམ་དུ་ཟད་ལ། ཡང་རེ་རེ་ཙམ་ནི་སྐྱེ་བ་ཇི་བཞིན་པ་ལ་རྟེན་འབྲེལ་གྱི་གནད་ཁ་ལས་དེ་ལྟར་བྱུང་བར་ཡང་མཐོང་ངོ་། །ཡང་གཞན་ནི་སྐྱེ་བ་ཡིན་སྐད་ཐོག་རེ་ཟུང་ལེགས་རབ་བྱུང་རུང་། ཐོག་ཅིག་ནས་ཇེ་ངན་དུ་འགྲོ་བ་ཡང་མང་དུ་མཐོང་བ་ཚུལ་དེ་ལྟ་ནི་སོ་སྐྱེས་ཀྱི་རང་མཚང་དང་རི་བོང་ཅལ་སྒྲོགས་ལ་བརྟེན་པ་སྟེ་ཨ་ཐང་ཆད་པའི་རྒྱུ་ཉིད་དོ། །དེ་བས་ན་བདག་ལྟ་བུ་བླ་ཆུང་དཀོར་ཟན་མཁན་སྐྱེ་བར་མིང་བཏགས་ཤིང་སྐྱེ་བ་འོལ་ཅི་ཞིག་དྲན་པ་ལས་སྐྱེ་བའི་བླ་བཏགས་མེད་པ་ཁོ་ན་ལེགས་པར་སྙིང་ནས་སེམས་པ་ལགས་སོ། །<br>འདིར་སྨྲས་པ། སྔར་བྱིས་པ་ནས་མནོ་ཤེས་པར་སྐབས་ཤིག །སྔོན་སྐྱེ་དྲན་ལ་ཡིད་ཆེས་དགའ་ཚོར་བྱས། །དེ་ཨེ་དྲན་གྱི་བལྟ་བསྒུག་ཡང་ཡང་བཏང་། །དེ་མི་དྲན་ཚེ་རང་ལ་ཡི་མུག་ཤར། །ད་བསམ་བཞིན་དུ་རང་ལ་ཞེ་ཁྲེལ་ཤོར། །སྐྱེ་དྲན་གྱི་བྱང་ཆུབ་མི་ཉེ་ན། །དྲན་པ་ཡི་དགའ་ཚོར་ཅི་ཕྱིར་བྱེད། །རློམ་སེམས་ཀྱི་ལས་ངན་སླར་ལ་བསགས། །དེ་བས་ནི་བྱང་ཆུབ་བསྒྲུབ་པ་ལ། །སྐྱེ་དྲན་གྱི་དགོས་ཆུང་མ་དྲན་ལེགས། །ཅིའི་ཕྱིར་ན་རློམ་སེམས་ང་རྒྱལ་ཆུང་། །དེ་ཡི་ནི་བྱང་ཆུབ་འགྲུབ་ལ་ཉེ། །སྔོན་བསགས་ཀྱི་ལས་འཕྲོ་རྣམ་དཀར་ལ། །འཕྲོ་མཐུད་ཀྱི་དམ་ཆོས་སྒྲུབ་ནུས་ན། །སྔོན་གནས་ཀྱི་སྐྱེ་སྲིད་དྲན་ཀྱང་རུང་། །མ་དྲན་ཀྱང་བདེའོ་ཅི་བྱེད་ལེགས། །དེང་སང་གི་སེར་སྐྱ་ཕལ་ཆེ་ཀུན། །བཟང་བཟང་དང་ཆེ་ཆེའི་སྐྱེ་བར་འདོད། །ནན་ཏན་གྱིས་བརྟག་དཔྱད་བྱས་པ་ན། །དགོས་མེད་ཀྱི་པྲ་ཆལ་མ་ལགས་སམ། །དགྲ་བཅོམ་མཆོག་འཕགས་པ་རབ་འབྱོར་ནི། །རི་རབ་ཀྱི་བང་རིམ་ལ་གནས་པའི། །ཀླུ་སྦྲུལ་གྱི་སྐྱེ་བ་ཡིན་ནོ་ཞེས། །ཚད་མ་ཡི་བཀའ་འདུལ་ལུང་ན་བཞུགས། །བོད་ཡུལ་གྱི་རྒྱན་གྱུར་མི་ལ་རྗེ། །སྐྱེ་དྲན་དང་སྤྲུལ་སྐུར་མ་བཞེད་ཀྱང་། །མོས་གུས་དང་དཀའ་སྤྱད་དམ་ཚིག་གིས། །གངས་ཅན་གྱི་གྲུབ་ཐོབ་གཙོ་བོར་གྱུར། །སྤྱིར་བཏང་ཡང་གྲུབ་དང་མཁས་པ་མཆོག །རྒྱལ་བསྟན་གྱི་སྒྲོན་མེ་མཆོག་ཕལ་ཆེ། །བྱིས་པ་ནས་དཀོར་གྱི་འདམ་བྱིང་བའི། །སྐུ་སྐྱེ་ཞེས་བླ་གཟུགས་བཟུང་བ་ཉུང་། །སྐྱེ་སྐྱེ་དང་སྤྲུལ་སྤྲུལ་གྲགས་པ་དང་། །མཁས་རློམ་དང་གྲུབ་པར་བརྫུ་འགའ་ཞིག །སྟོང་ཉིད་དང་སྙིང་རྗེ་དམན་པའམ། །བསླབ་སྡོམ་མམ་དམ་ཚིག་མ་དག་པས། །མཁའ་རྒྱུ་ཡི་ཡི་དྭགས་གདུག་འདྲེ་རུ། །སྐྱེས་པ་ཡིས་འགྲོ་བ་མནར་རོ་ཞེས། །སྔོན་དུས་ནས་ད་ལྟའི་བར་དག་ཏུ། །བྱུང་སྐད་འདི་བསམ་ཞིང་སྙིང་རླུང་ལྡང་། །ཟོལ་མེད་ཀྱི་སྐྱེ་བ་དྲན་པ་ཡི། །སྐུ་སྐྱེ་རུ་གྲགས་ཤིང་ཁེང་འགའ་ཡང་། །རྒྱུ་འབྲས་དང་དམ་ཚིག་རྩིང་གྱུར་པས། །ངན་སོང་གི་འདམ་དུ་མཆོངས་ལ་སྐྱོ། །དེ་བས་ནི་བཟང་བཟང་སྐྱེ་རློམ་ལས། །དལ་འབྱོར་གྱི་རྟེན་མཆོག་ཐོབ་དུས་འདིར། །རྒྱུ་འབྲས་ཀྱི་བླང་དོར་མ་ནོར་ཞིང་། །དམ་ཚིག་ལ་བརྩོན་པ་ཁོ་ན་ལེགས། །གླུ་དབྱངས་འདི་ལེགས་པར་གཞིག་མཛོད་དེང་། །བདེན་གཏམ་ལས་རྫུན་གྱུར་ཅུང་ཟད་མེད། །སྐྱེ་དྲན་གྱི་དགོས་མེད་དེ་ལྟ་ལ། །བསམ་བྱས་ནས་རློམ་པ་མེད་པར་འཚལ། །ཞེས་སོ། །སྐྱེ་བ་འོལ་ཅི་དྲན་པ་ཡང་ངོ་མཚར་མི་ཆེ་བ་དེ་འདྲ་ན། དེ་བས་གཞན་ཁ་ཅིག་ཕ་མའི་བཅོས་བསླབ་ཀྱི་སྐུ་སྐྱེར་བཏགས་པ་དང་། ལ་ལ་ནི་ཟོག་པོ་བྱུང་རྒྱལ་སྨྲ་བའི་ལུང་ལ་བརྟེན་པ་དང་། དེ་བཞིན་རང་གི་དྲན་ཁུལ་གྱི་རྫུན་ཚིག་གིས་སྐྱེ་བར་བསྒྲགས་པ་སོགས་ནི་ཚེ་འདིའི་བྱ་བ་ཐམས་ཅད་མི་ཆོས་བླ་མའི་རྫུན་གྱིས་རྒྱས་ཐེབས་ནས་མཐར་ཐུག་མནར་མེད་པའི་དམྱལ་མེའི་བུད་ཤིང་དུ་འགྱུར་བ་ལས་གཞན་ཅི་ཞིག ཡང་ཚིག་ཟུར་སྟབས་ལེགས་རེ་ཙམ་ལ་བརྟེན་ནས་མི་སྤྱིའི་ཕོ་ཚོད་ཀྱི་སྒོ་ནས་སྒྲོགས་པ་ལ། དེར་རང་ཡང་རློམ་འཛིན་གྱི་ཆོས་མིན་གྱི་རྒྱུར་གྱུར་ནའང་ཉེས་པ་སྔ་མ་དང་ཆ་མཚུངས་སམ་སེམས་སོ། །ཞེས་རྣམ་གྲངས་དེ་དག་ཀྱང་རང་ལྟ་བུའི་རིགས་ཅན་རྣམས་ལ་གོ་གལ་ཆེ་བར་བསམ་ནས་ལྷག་བསམ་གྱིས་སྨོས་པར་བདག་ལ་འདི་ཕྱི་བར་དོར་ཉེས་པར་མ་གྱུར་ཅིག སླར་ཡང་བསྡུས་ཏེ་ཚིགས་སུ་བཅད་པ།<br>དེ་སྐད་རང་ཉིད་སྐྱེ་བའི་མིང་ཙམ་པར། །བརྩམས་ཏེ་སྐྱེ་བའི་ངང་ཚུལ་ཅུང་ཟད་ཞིག །གླེང་འདི་རང་ཚུལ་ངོམ་ཕྱིར་ཁོ་ནའང་མིན། །གཞན་ལ་འགྲན་པའི་ཆེད་དུ་ཡང་མ་ཡིན། །རང་གི་དངོས་པོའི་གནས་ལུགས་ཇི་བཞིན་ནི། །དམ་པའི་སྤྲུལ་པར་གྱུར་པ་སྨོས་ཅི་འཚལ། །སྐྱེ་བ་འདི་ཀའི་སྔོན་གནས་གསལ་བར་ཡང་། །རྔོ་མ་ཐོགས་ན་གཞན་ཚུལ་དེ་བས་ཅི། །དེས་ན་སྒྲོ་བཏགས་ཁོ་ན་ཙམ་མ་གཏོགས། །དངོས་པོ་སོ་སྐྱེ་ལས་དང་པོ་རུ་ངེས། །དེས་ན་བདག་ལ་དམ་པའི་ཡོན་ཏན་ཅི། །ཚུལ་འདི་རང་གི་གནས་ལུགས་ཇི་བཞིན་ཡིན། །སངས་རྒྱས་འཁོར་ལོས་བསྒྱུར་བ་པདྨ་འབྱུང་། །སྒྱུ་འཕྲུལ་ཀཧྣ་པ་ནམ་མཁའི་སྙིང་། །གང་དེ་རྩ་བའི་བླ་མའི་ངོ་བོར་གྲུབ། །དེ་ནི་ཚེ་རབས་ཡོངས་ཀྱི་འདྲེན་པ་སྟེ། །བཀའ་དྲིན་འཁོར་ཐབས་མེད་པ་ཉིད་ཤེས་ཤིང་། །བྱང་ཆུབ་སྙིང་པོར་གནས་ཀྱང་རིགས་ཀྱི་བདག །མི་ཕྱེད་དད་འདུན་གདུང་ཤུགས་དྲག་པོ་ཡིས། །སྤུ་ལོང་གཡོ་ཞིང་མཆི་མ་འཁྲུག་བཞིན་དུ། །གང་གི་སྤྲུལ་པ་སྐྱེ་འཕྲེང་ཚུལ་སྟོན་མཚན། །ཁ་ཤས་བཀོད་པ་ཐོས་པས་དོན་ལྡན་ཕྱིར། །རང་དང་བསྐལ་མཉམ་གདུལ་བྱར་གྱུར་པ་རྣམས། །དད་དང་མགུ་སྐྱེས་གསོས་སུ་གླེང་བ་ལས། །རང་ཉིད་དེ་ཡི་སྐྱེ་བར་རློམས་པ་ནི། །རང་སེམས་དྲི་མ་འདིས་ནོངས་བརྗོད་པ་མེད། །ཚེ་རབས་རྟག་ཏུ་མགོན་དེའི་ཕྲིན་ལས་ཀྱི། །འབངས་སུ་འགྱུར་བར་སྨོན་དེ་བཀོད་པ་ཡིན། །ཞར་བྱུང་སྐྱེ་བའི་མིང་ལ་ལེགས་དང་ཉེས། །རང་འདྲ་བློ་དམན་འཇུག་སྒོ་མི་ནོར་ཞིང་། །མ་འོངས་དྲན་པའི་གསོས་དང་འགྲོ་བ་འགའ། །དགེ་བའི་ལམ་ལ་གཞུག་པའི་སླད་དུ་ཡིན། །དེ་ཡང་རྩུབ་མོའི་བསམ་པས་མ་ཡིན་ལ། །ལྷག་བསམ་དག་པས་སྨྲས་ལ་ཉེས་པ་ཅི། །འོན་ཀྱང་གཞན་གྱི་ཐུགས་ལ་མི་རན་ན། །དེ་དེའི་སྤྱན་སྔར་བདག་གིས་ཐལ་སྦྱར་བཤགས། །བདག་ནི་འཁོར་བ་ཐོག་མ་མེད་པ་ནས། །བྱས་པ་དོན་མེད་ལས་ལ་ཡི་ག་ཆད། །ལུས་རྟེན་འདི་ཡང་སྐུ་སྐྱེར་མིང་ཐོབ་པས། །ཆོས་བརྒྱད་ཞགས་པས་འཆིང་འདིར་སྐྱོ་ཞིང་འཁྲུགས། །རང་དོན་ཚགས་སུ་མ་ཆུག་ཆོས་པའི་གཟུགས། །གཞན་དོན་ནུས་པས་དབེན་པ་བླ་མའི་ཟོལ། །ཆོས་བརྒྱད་ཆོས་སུ་བརྫུ་བའི་ངང་ཚུལ་འདི། །མཐོང་དང་བསམ་པས་རང་ལ་རང་ཉིད་སྐྱོ། །འོན་ཀྱང་ཀླུ་རྒྱལ་ཨེ་ལེའི་ལྗོན་ཤིང་བཞིན། །དེ་ལྟ་མཐོང་ཞིང་སྤྱོད་འདི་ལས་ཀྱི་མཐུ། །དེས་ན་རང་ལ་རང་ཉིད་མ་རངས་བས། །སླད་མའི་དུས་ཀྱི་སྨོན་ལམ་བརྗོད་བྱས་པ། །བདག་ནི་མི་སྐྱེ་བཟོད་པ་མཆོག་ཐོབ་པར། །སྐྱེས་མ་ཐག་ཏུ་སྡིག་ལྡན་དཀོར་རྫས་ལ། །བག་མེད་སྤྱོད་བྱེད་སྐུ་སྐྱེར་མིང་བཏགས་པའི། །ལུས་སུ་ཚེ་རབས་རྟག་ཏུ་མ་གྱུར་ཅིག །ཕ་མ་འབྱོར་ལྡན་ཚོགས་པའི་བུར་སྐྱེ་ཞིང་། །སྐྱེ་བའི་གྲགས་པ་ཕྲལ་དུ་མི་སྒྲོགས་པར། །ཡོན་སྦྱང་བར་དུ་དཀོར་གྱིས་མི་ནོངས་པའི། །དམ་པའི་རྟེན་གྱུར་དེ་ལ་རྟག་སྐྱེ་ཤོག །སྔོན་གྱི་ཟས་གོས་ཡོ་བྱད་གཉེན་ཚན་སོགས། །འཁོར་བར་རིང་གོམས་ལོག་ཤེས་བག་ཆགས་གང་། །ཡད་ཡུད་དྲན་ལ་སྤྲུལ་པར་སྒྲོ་བཏགས་པའི། །ཐར་པའི་གེགས་བྱེད་ལུས་སུ་མ་གྱུར་ཅིག །སྔོན་གྱི་མཁན་སློབ་བླ་མ་དམ་པ་དང་། །དམ་པའི་ཆོས་ཐོས་དེ་ཡི་དོན་སེམས་པ།།སངས་རྒྱས་ཡོན་ཏན་རྗེས་དྲན་མི་ཕྱེད་པའི། །དད་པ་ཚེ་རབས་རྟག་ཏུ་མི་བརྗེད་ཤོག །གཞོན་ནུའི་སྐབས་སུ་ཐོས་བསམ་གེགས་གྱུར་པའི། །ཕྱོགས་ཞེན་འཁོར་དང་ཆེན་པོའི་གོ་ས་དང་། །ཟང་ཟིང་མི་ཆོས་ངོ་བསྲུང་གིས་གཡེངས་པའི། །ཆོས་མིན་སྤྱོད་པར་སྐྱེ་བར་མ་གྱུར་ཅིག །མི་ཆོས་ངོས་འཛིན་གཡེང་བས་མ་གོས་པར། །དགེ་བའི་བཤེས་གཉེན་དཀོན་མཆོག་མཆོད་པའི་རྫས། །མ་ཚང་མེད་འབྱོར་ཐོས་དང་བསམ་པ་ལ། །གེགས་མེད་བརྩོན་པའི་ལུས་སུ་རྟག་སྐྱེ་ཤོག །གཞན་ཕན་གདེངས་དང་མི་ལྡན་བླ་མའི་ཚུལ། །ཟང་ཟིང་འདུ་ལོང་རྒྱས་པ་བདུད་ཀྱི་ལས། །བག་མེད་དཀོར་ལ་སྤྱོད་པ་དམྱལ་བའི་རྒྱུ། །ཆུང་ནས་བླ་གཟུགས་དེ་ལྟ་མ་གྱུར་ཅིག །ཆུང་ངུའི་དུས་སུ་མངོན་མཚན་མི་ཆེ་བར། །དམན་པའི་ཚུལ་གྱིས་ཐེག་ཆེན་དོན་ལ་སྤྱོད། །ཇི་བཞིན་གཞན་དོན་ནུས་ཚེ་འགྲོ་བའི་དོན། །རླབས་ཆེན་སྤྱོད་པར་རྟག་ཏུ་སྐྱེ་བར་ཤོག །བདག་མཐུས་ཆོས་ལ་འགོད་པར་མི་ནུས་ཚེ། །ཕ་མ་ཆོས་ལ་མི་གུས་སྡིག་ཅན་དང་། །ཆོས་མིན་སྡུག་པའི་གྲོགས་ཀྱིས་ཁེབ་པ་ཡིན། །ལུས་སུ་ཚེ་རབས་རྟག་ཏུ་མ་གྱུར་ཅིག །ཡ་རབས་ལས་སྤྱོད་ཆོས་མཐུན་ཕ་མ་དང་། །བློ་རྒྱུད་དགེ་ལ་ཕྱོགས་པ་ཐར་པའི་གྲོགས། །བྱང་ཆུབ་སྤྱད་པ་མཐུན་པར་སྤྱོད་བྱེད་པའི། །གནས་སུ་སྐྱེ་བ་རྟག་ཏུ་ལེན་པར་ཤོག །ཐོས་བསམ་དབུལ་ཞིང་སྒོམ་པའི་གདེང་མེད་པར། །སྐྱེ་བའི་མིང་གི་དྲེགས་ཤིང་ང་རྒྱལ་བས། །ཆོས་མིན་བག་མེད་ཐོ་ཅོ་སྤྱོད་པ་ཡི། །ལུས་སུ་ཚེ་རབས་རྟག་ཏུ་མ་གྱུར་ཅིག །གཞོན་ནུ་ཉིད་ནས་ཕྱི་མཛེས་ནང་དུལ་ཞིང་། །འདོད་ཆུང་ཆོག་ཤེས་སྦྱངས་པའི་ཡོན་ཏན་ལྡན། །ཉིན་མཚན་འཁོར་མོར་ཆོས་སྤྱོད་བཅུར་སྤྱོད་པའི། །དམ་པའི་རྟེན་གྱུར་ཚེ་རབས་རྟག་སྐྱེ་ཤོག །རིགས་དང་གོ་སས་ཁེངས་ནས་གཞན་དག་ལ། །བག་མེད་བརྙས་པས་དགེ་འབྲས་བཅོམ་བྱེད་ཅིང་། །རྣམ་སྨིན་མི་བཟད་དམྱལ་བའི་ལས་བསགས་པའི། །ལུས་སུ་ཚེ་རབས་རྟག་ཏུ་མི་སྐྱེ་ཤོག །མངོན་མཐོ་འབྱོར་པའི་དཔལ་གྱིས་བརྒྱན་ཐོབ་ཅིང་། །དེ་ལ་ཞེན་དང་ཁེངས་པ་མི་སྐྱེ་བར། །རྒྱལ་བས་བསྔགས་ཤིང་དད་དང་དག་སྣང་ལ། །བར་མེད་སྤྱོད་པ་རྟག་ཏུ་སྐྱེ་བར་ཤོག །གཙུག་ལག་མཆོད་དང་དགེ་འདུན་སྤྱི་ཡི་རྫས། །འཕྲི་གཞོག་ཟུར་བཀོལ་ཐུབ་ཐུབ་སྤྱོད་པ་ཡི། །འཚོ་བའི་རིགས་དང་དེ་ལྟ་བླ་མའི་ཚུལ། །ཚེ་རབས་རྟག་ཏུ་སྐྱེ་བར་མ་གྱུར་ཅིག །སྡིག་མེད་རང་གི་ལས་མཐའ་ལ་སྤྱོད་པའི། །འཚོ་བས་འཚོ་ཞིང་དཀོན་མཆོག་དཀོར་རྫས་ལ། །དུག་ལྟར་འཇིགས་ནས་ཤིན་ཏུ་སྤང་བ་ཡི། །བློ་ལྡན་ལུས་སུ་རྟག་ཏུ་སྐྱེ་བར་ཤོག །སྐྱེ་བ་ཡད་ཡུད་ཙམ་ཞིག་དྲན་པ་ལ། །གདིང་ཆ་འདི་སྣང་ཡུད་ཙམ་ཁོ་ན་ཡི། །རྙེད་དང་གྲགས་པའི་ཟོང་རིན་བླ་མའི་གཟུགས། །འཁོར་བའི་གཏིང་རྡོ་སྐྱེ་བར་མ་གྱུར་ཅིག །ཅི་སྟེ་སྐྱེ་བ་ཙམ་ཞིག་གྲགས་གྱུར་ཀྱང་། །དེ་ལ་ཞེན་མེད་ཅིར་སྣང་སྒྱུ་མར་རྟོགས། །འཇིག་རྟེན་རྙེད་གྲགས་དོན་དུ་གཉེར་མིན་པར། །དམ་ཆོས་ཁོ་ན་དོན་གཉེར་རྟག་སྐྱེ་ཤོག །བྱིས་པའི་བརྗོད་སྒོ་སྟབས་ལེགས་རེ་ཙམ་མམ། །མོ་རྩིས་པྲ་སྒྲུབ་རྣོ་མཐོང་མཁན་པོ་སོགས། །ཟག་བཅས་མངོན་ཤེས་ཙམ་གྱི་ལུང་བསྟན་ལ། །བརྟེན་ནས་སྤྲུལ་སྐུར་མིང་བཏགས་མ་གྱུར་ཅིག །གཞན་གྱི་སྒྲོ་བཀུར་ཙམ་ལ་བརྟེན་མིན་པར། །རང་སྟོབས་ཉིད་ཀྱི་དམ་པའི་རྣམ་ཐར་ལ། །རྩེ་གཅིག་གཡེལ་མེད་བྱང་ཆེན་ལམ་བཟང་པོར། །སྤྱོད་པའི་ལས་ཅན་དག་ཏུ་སྐྱེ་བར་ཤོག །མདོར་ན་སེམས་ནི་བྱང་ཆེན་ཡོངས་བསྐྱེད་མཐུས། །ཕྱིར་མི་ལྡོག་པའི་གོ་འཕང་མ་ཐོབ་ཀྱང་། །སྐྱེ་སྲིད་འཛིན་གང་དྲན་ཤེས་བསམ་བཞིན་དུ། །འགྲོ་དོན་རྒྱ་ཆེན་ཁོ་ནའི་ཆེད་འཇུག་ཤོག །སྐྱེ་ཀུན་སོ་སོ་ཐར་པའི་སྡོམ་པ་བརྟན། །བྱང་ཆུབ་སྤྱོད་པ་ནམ་ཡང་ཉམས་མ་གྱུར། །རིག་འཛིན་སྔགས་ཀྱི་དམ་ཚིག་མཆོག་ཏུ་བརྟན། །སྡོམ་གསུམ་སྲོག་ལྟར་རྩ་བ་རྟག་སྐྱེ་ཤོག །རིག་གནས་ཤེས་བྱ་རྒྱ་མཚོར་མ་རྨོངས་པ། །ཐོས་པའི་བང་མཛོད་དེ་དོན་ཚུལ་བཞིན་དུ། །བསམ་པའི་ནོར་བུ་རིན་ཆེན་གྱིས་ཁེངས་པའི། །བློ་ལྡན་སྐྱེ་བ་རྟག་ཏུ་འཛིན་པར་ཤོག །བླ་མ་མཉེས་བྱས་ཟབ་མོའི་གདམས་ཐོབ་གང་། །འདུ་འཛི་དབེན་པའི་གནས་སུ་རྟོག་ཚོགས་ཀྱི། །དབེན་པའི་ཟག་པས་ཡོངས་སུ་དབེན་པ་ཡི། །སྟོང་ཉིད་སྙིང་རྗེ་ཟུང་འཇུག་རྟག་བསྒོམ་ཤོག །བདག་གི་བསམ་པ་དག་པས་འདུས་བྱས་དང་། །འདུས་མ་བྱས་དགེ་བྱང་ཆེན་རྒྱུར་བསྔོས་ཏེ། །སྐྱེ་བ་ཕྱི་མའི་སྨོན་ལམ་མཚོན་ཙམ་འདི། །རང་གི་ངང་ཚུལ་ཉིད་ལ་སྐྱོ་བས་སྨྲས། །ཞེས་པ་ཡང་སྨྲས་སོ། །<br>དེ་ལྟར་རང་མྱོང་ཆ་ཤས་དམ་པའི་ཆོས་ཀྱི་གྲོས་འདེབས་རྟོགས་བརྗོད་རི་ཐང་མཚམས་ཀྱི་སྨན་མཆོག་ལས། ཚེ་འདིར་སྐུ་སྐྱེར་གྲགས་པའི་གཏམ་འོལ་ཅིའི་རྗེས་སུ་འབྲངས་ཏེ་སྔོན་གནས་ཅུང་ཟད་སྤྱི་དོན་དང་བཅས་པ་གླེང་བའི་སྐབས་དེ་དང་པོའོ། །</p><p class=\"tibetan-text\">ཨ་ཐ། ད་ནི་སྤྱི་དོན་གཉིས་པ་སྔོན་གྱི་ལས་སྨོན་དང་འཕྲལ་གྱི་རྐྱེན་ལ་ཡང་བརྟེན་ཏེ་ཚེ་འདིར་ལེགས་ཉེས་ཀྱི་འཇུག་སྒོ་སྣ་ཚོགས་པར་དཔྱད་པའི་ཚུལ་ཆུ་རྒྱུན་ལས་ཐིགས་པ་ཙམ་ཞིག་འཆད་པར་བྱ་ན། <br>དེ་ཡང་ཁོ་བོ་སྐྱེ་བའི་ཡུལ་ནི་རི་ཁ་བ་ཅན་གྱི་ལྗོངས་བོད་དང་བོད་ཆེན་གྱི་ཟླས་ཕྱེ་བའི་བོད་ཆེན་དེ་ལ་སྟོད་སྨད་བར་གསུམ་གྱི་མདོ་སྨད་ཀྱི་ཆ། གུ་རུའི་གནས་ཀྱི་གཙོ་བོ་ཀཿཐོག་རྡོ་རྗེ་གདན་གྱི་ལྷོ་མདོ་ཁམས་སྟག་ཚང་སེང་གེ་བསམ་འགྲུབ་ཀྱི་བྱང་སྒང་ཆེན་ལྔའམ་དྲུག་ཏུ་དབྱེ་བའི་བུམ་པོར་སྒང་སྨར་ཁམས་སྒང་དང་ཟླ་རྒྱུད་སྒང་གསུམ་གྱིས་བསྐོར་བའི་དབུས་སུ་གྱུར་ཞིང་ཅུང་ཟད་ཙམ་གྱིས་བུམ་པོར་སྒང་དང་ཉེ་བ་འཕགས་མ་དམ་ཚིག་སྒྲོལ་མ་ཡི་སྐུ་བརྙན་བྲག་ལ་རང་བྱུང་དུ་གནས་པ་ལས་ཆུ་རྒྱུན་བབ་པས་མིང་ལྗང་ཆུ་གཤིས་སུ་གྲགས་ཤིང་ལུང་པ་ཁ་བྱང་དུ་ཕྱོགས་པའི་མདོར་གསེར་གྱིས་འདྲེན་པའི་ཆུ་ཀླུང་ཆེན་པོ་རྒྱུ་བ་ལས་ལྗང་ཆུའི་གཡོན་ཡུལ་དེའི་ས་ཡི་ཐིག་ལེ་མདོ་ཁམས་ཀྱི་རི་བོ་བཀྲ་བཟང་ངམ་བཙན་རྒོད་རི་བཀྲ་དང་བཙན་རི་རྡོ་རྗེ་བྲག་ཞེས་ཀྱང་བརྗོད་པ་དང་། འཇིག་རྟེན་སྐྱེ་བོ་རྣམས་ཀྱི་ངག་རྒྱུན་དུ་རི་དེ་རྒྱ་གར་ནས་བོད་དུ་བྱོན་པ་སྟེ་སླར་རྒྱ་གར་དུ་ལྡོག་དོགས་རི་གཞན་གྱི་དབུས་སུ་བཅུག་པ་ཡིན་ཞེས་ཟེར་ལ། སྤྱི་དེ་འདྲ་ཡི་གནའ་གཏམ་ཅི་རིགས་ཡོངས་ཀྱི་འདུག་པར་ངེད་བྱིས་པའི་སྐབས་སུ་ནི་ཡིད་ལ་ཤིན་ཏུ་མི་འཐད་མོད། །ཕྱིས་མངོན་བརྗོད་ཀྱི་གཞུང་རྣམས་སུ་སྔོན་གྱི་བསྐལ་པར་འཛམ་བུ་གླིང་གི་རི་རྣམས་ཕན་ཚུན་དུ་རྒྱུ་འགྲུལ་བྱེད་པས་སེམས་ཅན་ལ་ཤིན་ཏུ་གནོད་པ་ཆེས་ཆེ་བ་བསྐྱལ་བ་ལ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་རྡོ་རྗེས་རི་རྣམས་ཀྱི་རྐང་པ་བཅག་སྟེ་རྒྱུ་འགྲུལ་མེད་པར་བྱས་ཤིང་། དེ་སྐབས་རི་ཁ་ཅིག་རྒྱ་མཚོའི་གཏིང་དུ་བྲོས་ཏེ་ཡོད་ལ། བརྒྱ་བྱིན་གྱི་རྡོ་རྗེའི་མིང་རི་འཇོམས་སུ་དེས་བཏགས་པ་ཡིན་ཞེས་དང་།དེ་བཞིན་རི་བོ་གངས་ཅན་གྱི་བུ་རི་བོ་ཉ་ཅན་དང་རི་བོ་ངུར་པ་གཉིས་འཁྲུག་པ་ལ་རི་བོ་གཞན་གྱིས་བསྡུམ་ཡང་དུམ་པར་མ་ནུས་པས་གྲུབ་པའི་ལྷ་རྣམས་ཀྱི་གདོང་དྲུག་ལ་གསོལ་བ་བཏབ་པས་གདོང་དྲུག་གི་བསྡུམ་པས་ཀྱང་མ་ཉན་པར་མདུང་ཐུང་འཕང་ནས་རི་བོ་ངུར་པ་ཚལ་པར་བཀས་པ་ཡིན་ཞེས་ཀྱང་བརྗོད་པར་མཐོང་བས། དེས་ན་ཚིག་འདི་དག་ཕྱི་རོལ་མུ་སྟེགས་རིག་བྱེད་གཞུང་ལས་བྱུང་བའི་གཏམ་དང་མཐུན་པ་ཞིག་སྔར་དུ་བྱུང་བར་སྣང་བས་གསར་དུ་དགག་སྒྲུབ་བྱར་མེད་དོ། །བཙན་རྒོད་རི་འདི་ལ་བླ་མ་གོང་མ་རྣམས་ནས་ཁམས་ཀྱི་པཎ་ཎེ་རི་བཀྲ་ཡང་ཡིན་ཞེས་གསུང་རུང་ཁམས་ཀྱི་པཎ་ཎེ་རི་བཀྲའི་མིང་ཅན་གཅིག་བར་ཁམས་ཁྱུང་པོར་ཡང་ཡོད་རུང་། དོན་དུ་ནི་བདག་གི་རྩ་བའི་བླ་མ་རྡོ་རྗེ་འཆང་གི་ཞལ་སྔ་ནས་འབྲི་རྒྱུད་རེ་ཁེ་ལྗོངས་ཀྱི་ཡུལ་ལྷ་སྟྭ་མ་སྟེའུ་སོའམ་ཡོན་ཏན་རི་བཀྲར་གྲགས་པ་འདི་པཎ་ཎེ་རི་བཀྲ་ཡིན་གསུང་པས་རི་དབང་སྤུན་དགུའི་ཡ་གྱལ་ནི་དེ་ཁོ་ནར་ངེས་པས་བཙན་རྒོད་རི་བཀྲ་དང་མི་གཅིག་གོ །གཞན་ཁམས་ཀྱི་རི་བོ་བཀྲ་བཟང་ཡིན་པ་ནི་དམ་པ་རྣམས་ཞལ་མཐུན། གང་ལྟར་ཨོ་རྒྱན་གུ་རུའི་བྱིན་གྱིས་བརླབས་པའི་གནས་ཆེན་ཟབ་གཏེར་བཅུ་གསུམ་ཙམ་བཞུགས་པ་ཞིག་སྟེ། རི་དབྱིབས་རྡོ་རྗེ་རྩེ་ལྔ་ལྟ་བུ་ལ་རྒྱབ་ངོས་ཀྱི་ཆ་ཅུང་ཟད་ཙམ་ལས་མཐའ་སྐོར་དུ་ཆུ་མིག་བར་མི་ཆད་པ་བརྒྱ་ཕྲག་དུ་མས་བསྐོར་བ་རི་ངོས་སུ་གྱེན་དུ་དྷེ་ཝ་དྷ་རུ་དང་། ས་ལ་དང་། ནི་ཙུ་ལ་དང་། ཨ་ཤྭ་ཏ་ཐ་དང་ཨ་ཀ་རུ་ལ་སོགས་པའི་ནགས་ཚལ་གྱི་འཕྲེང་བ་བཟང་པོ་སྟེ་ཤིང་སྣ་བརྒྱ་དང་བརྒྱད་ཡོད་པར་གྲགས་ཤིང་། ཀུན་ཏུ་འཐུག་པ་དང་། དེ་རྣམས་ཀྱི་བར་མཚམས་བྲག་རི་དཀར་དམར་གྱི་འཕྲེང་བ་དང་། གྲོག་པོ་དང་ཤ་ལ་དཀར་པོའི་གྱེན་འགྲེང་བ་གདུགས་ཀྱི་རྩིབས་མ་ལྟར་སྤེལ་ཞིང་ཤིན་ཏུ་མཛེས་པ་སྟག་གཟིག་དོམ་དྲེད་གུང་སྲམ་གསའ་སྤྱང་འཕར་བ་སོགས་བོད་འདིར་མཆིས་པའི་གཅན་གཟན་མ་ཚང་བ་མེད་པ་ལྟ་བུ་དང་། དེ་བཞིན་བྱ་རྒོད་ཁྲ་གླག་ནེ་ཙོ་བྱ་ཝང་ཁུ་ལིང་གུང་མོ་སོགས་བྱ་རིགས་ཀྱང་སྣ་ཚོགས་པ་དང་མི་རྒོད་སྤྲེའུ་ཕྱི་བ་དང་རི་དྭགས་ཀྱི་རིགས་རྣ་བ་གླ་བ་རི་བོང་སོགས་སེམས་ཅན་རིགས་མི་གཅིག་པ་དུ་མ་རྟག་ཏུ་འཕྱོ་བ་བག་དྲོ་ཞིང་བྱིན་ཆེ་བ་སྐྱི་ཟ་ཞིང་ཡ་ང་བ་ཡ་མ་ཆ་ཡི་གནས་རི་བོ་དེའི་ངོགས་སུ་མི་རྣམས་རྒྱུ་འགྲུལ་ཆེས་དཀའ་བ་ཨོ་རྒྱན་ཆེན་པོས་རྒྱ་གར་དུར་ཁྲོད་བསིལ་བའི་ཚལ་དང་མཚུངས་ཞེས་པ་དང་། གཏེར་ལུང་ཁ་ཅིག་ཏུ་ཨོ་རྒྱན་དྷཱ་ན་ཀོ་ཤ་དང་ངེས་པར་མཉམ་ཞེས་གསུང་བ་དེ་ཡི་ནུབ་བྱང་གི་མཚམས་བྲག་རིའི་ངོས་སུ་འདབ་ཆགས་མགོན་པོ་ཀླུ་སྦྲུལ་འཛིན་ཏེ་ནམ་མཁའ་ལ་ལྡིང་བའི་གཟུགས་བརྙན་ཤིན་ཏུ་གསལ་བ་རི་བོ་བྱ་ཁྱུང་དུ་གྲགས་པའི་མདུན་དུ་བྲག་དུང་གཡས་སུ་འཁྱིལ་བ་ལྟ་བུའི་གོང་སྔོན་རྣལ་འབྱོར་སྒྲུབ་པ་པོ་མང་པོས་བསྟི་བར་བྱས་པའི་དུང་དཀར་རི་ཁྲོད་དུ་གྲགས་པའི་འདབས་བསམ་གཏན་གྱི་སྤྱིལ་པོ་ཆུང་ངུ་ཞིག་ཏུ་བཙས་པ་ཡིན་འདུག་སྟེ། དེ་ཡང་ཨོ་རྒྱན་ཆེན་པོའི་ལུང་ལས༔ དུས་ངན་བར་གྱི་ཚིགས་པ་ལ༔ བསྐལ་པ་དུམ་བུ་རྩོད་པ་དར་བ་ཡི༔ སེམས་ཅན་ཞེ་སྡང་རགས་པའི་དུས་སུ༔ མོན་བུ་སྤྱི་རིང་སྐྲ་ཡི་ལྭ་བ་ཅན༔ ཞེས་པ། རི་བོ་ཁྱུང་ཆེན་ལྡིང་བའི་དྲུང་དུ་འབྱུང་ངོ་༔ ཞེས་གསུངས་པ་ལུང་ཚིག་དེ་ནི་སྔོན་གུ་རུ་ཇོ་བོ་རྩེ་མོ་དང་། བར་དུ་རཏྣ་གླིང་པ་རྣམས་ལ་ཡང་མཐུན་པར་སྣང་ལ། ཕྱི་མའི་དུས་འདིར་བདག་ཀྱང་ཚུལ་དེ་འགྲིགས་པ་ལྟར་གྱུར་པ་ཞིག་གོ །བདག་གི་དལ་འབྱོར་གྱི་ཡོན་ཏན་ཕུན་སུམ་ཚོགས་པའི་ལུས་རྟེན་འདི་བསྐྱེད་པར་བྱེད་པའི་མ་ནི་ཞིང་སྐྱེས་ཀྱི་མཁའ་འགྲོ་མ་ཡི་རིགས་སུ་གྱུར་པ་མི་ཆོས་སུ་དགྲ་གཉེན་ལ་ཆགས་སྡང་གི་རུས་ཐོན་པ་དཀོན་མཆོག་གསུམ་ལ་མཆོག་ཏུ་དད་གུས་དང་ལྡན་ཅིང་རྡོ་རྗེ་སེམས་དཔའི་སྙིང་པོ་ཡིག་བརྒྱ་འབའ་ཞིག་ལ་ཡི་དམ་དུ་བྱེད་པས་བཅོམ་ལྡན་འདས་དཔལ་རྡོ་རྗེ་སེམས་དཔའི་ཞལ་མཇལ་བ་བཛྲ་ས་མུ༔ཞེས་བྱ་ལ། ཕ་ནི་འཇིག་རྟེན་ཐུན་མོང་དུ་ད་ལྟ་གྲགས་ཚོད་ཀྱི་རིགས་ནི་ཁམས་མི་ཉག་གི་ཡུལ་དུ་དཀར་པོ་སྒོ་ཡི་རིགས་ལས་སྒོ་བཟའ་ལྷ་མོ་ཞེས་ལྷའི་བུ་མོ་ལ་འགྲན་པར་བཟོད་པ་ཞིག་བྱུང་ཞིང་། ཡུལ་དེའི་ལྷ་མཐུ་བོ་ཆེ་བཞག་བྲ་ལྷ་རྩེའི་རྩེར་ནམ་མཁའི་ལྷ་ཞིག་རྨུ་ཐག་ལ་བརྟེན་ནས་བབ་སྟེ་སྒོ་བཟའ་ལྷ་མོ་དང་བཤོས་པའི་བུ་རྒྱུད་ཡིན་ཞེས་པ་ལ་ཀུན་སློང་ཅན་དུ་མ་དཔུང་དུ་འཚོགས་ནས་ལན་བརྒྱར་བསླད་ཅིང་སྦས་ཀྱང་སྙོགས་པར་མ་ནུས་ཤིང་། སྔོན་རབས་ཉིད་ནས་གྲགས་པའི་གཏམ་གསར་དུ་འགོག་མ་སྤོབས་པས་ད་ལྟ་ཡང་རླུང་ལྟར་ཀུན་གྱི་ངག་སྒོར་གནས་ཤིང་རྒྱུ་བ་འདིའོ། །འོན་ཀྱང་ཁ་ཅིག་གིས་སྒོ་བཟའ་ལྷ་མོ་དེ་བུད་མེད་བཟང་མོ་མི་མ་ཡིན་རྣམས་དང་རྟག་ཏུ་རྩེན་ནུས་པ་ཞིག་སྟེ། རེ་ཞིག་ན་བཞག་བྲའི་གཞི་བདག་དེ་སྐྱེས་བུ་མི་ལས་འདས་པའི་མཚར་སྡུག་དུང་གི་གོ་ཆ་ཅན་ཞིག་ཏུ་རྫུས་པ་དང་བཤོས་པས་སང་ཕོད་དུས་སུ་ཁྱེའུ་ཞིག་བྱུང་ཞེས་རང་གི་བློ་ལ་ནི་ཕྱི་མ་འདི་ནི་རིགས་མཐུན་གཞན་དག་གིས་ངེས་པས་འཐད་ལ་གང་ལྟར་ལྷ་ཡི་ཁྱེའུ་བཙས་ནས་མི་རིང་བར་མ་དང་བྲལ་ནས་བ་ཡི་འོ་མས་བསྐྱེད་སྲིངས་ཤིང་མིང་ལ་ངུ་རྒུ་ཞེས་སུ་བཏགས་ཏེ་འདི་ནི་མི་ཉག་གི་སྐད་དུ་མངོན་པས། ཡུལ་དེའི་མི་ལ་དྲིས་ཚེ་ངུ་རྒུ་མེ་ཞེས་བོད་སྐད་དུ་བ་ཡི་འོ་མ་འཐུང་བའི་དོན་ཡིན་ཟེར་ལ། ཁྱེའུ་དེ་ལང་ཚོ་ལ་བབ་པ་ན་ཚོ་ཆེན་པོ་བཅོ་བརྒྱད་ཀྱི་བདག་པོར་གྱུར་ཅིང་ཕུལ་བྱུང་ཙམ་དུ་ཡུལ་བྱ་རྒོད་ཀྱི་ཉིན་ལམ་བཅོ་བརྒྱད་ལ་དབང་བྱས་པ་ཡིན་ཞེས་འུད་ཆེ་བར་སྒྲོགས་པས། དེས་ན་རྒྱལ་རིགས་སུ་གཏོགས་པ་ཞིག་གོ །འདི་དང་མི་ཉག་གྷ་ཡི་རྒྱལ་པོའི་ལོ་རྒྱུས་ཕྱོགས་མཐུན་ཅིང་ངུ་ཞེས་མིང་ཡང་གཅིག་རུང་གྷ་ཡི་རིགས་ཁུངས་སྨོན་ཉི་ཤུའི་གཞི་བདག་ཡིན་པར་འདོད་པས། དེ་ནི་བཞག་བྲའི་བློན་པོ་མཐུ་ཤིན་ཏུ་བཙན་པ་ཞིག་ཡིན་ཟེར་རོ། །བཞག་བྲ་ནི་རྨ་རྒྱལ་སྤོམ་རའི་བུ་དགུ་ཡི་ཐུ་བོར་གྲགས་ལ། སྤོམ་ར་རང་ཉིད་གནོད་སྦྱིན་གྱི་དབང་པོ་རྣམ་ཐོས་བུ་ཡི་སྲས་སུ་གྱུར་པ། དེ་ཡང་ནོར་སྦྱིན་གྱི་ངོ་བོར་གནས་ཞེས་གུ་རུ་པདྨ་ཀ་རས་གསུངས་པས་དེས་ན་འདོད་ལྷ་རྒྱལ་ཆེན་བཞིའི་རིགས་ལས་བྱུང་བར་སྨྲའོ། །དེ་ཡང་དཀར་པོ་སྒོ་ནི་ངུ་རྒུ་མེའི་ཞང་པོ་ཡིན་ཅིང་ངུ་རང་ཉིད་ཀྱི་རིགས་ནི་དེ་ལས་གཞན་པར་ངེས་དགོས་སོ། །གང་ལྟར་ངུ་ཡི་རིགས་དེ་ལས་ནང་ཚན་གོ་པ་ཟེའུ་ཞེས་པའི་རྒྱུད་དུ་སྐྱེས་པའི་ཁྱིམ་བཙུན་དགེ་བསྙེན་ལྷ་ཆོས་སུ་ལོ་མང་པོའི་བར་དུ་ཡི་དམ་གྱི་བསྙེན་བསྒྲུབ་ཐེམ་པར་བྱས་ཤིང་། མི་ཆོས་སུ་རྒྱུད་དྲངས་ཤིང་ཁྲོ་གཏུམ་ཆེ་ཞིང་དཔའ་བརྟུལ་སྙིང་སྟོབས་ཀྱི་ངར་དང་ལྡན་པ་ཨ་ཏི་ནཱ་ཐ་རམ་ཀ་ཞེས་པ་ཡིན་པར་སྒྲོགས་ཏེ། དེ་ཚེ་འཕགས་པ་ཤཱ་རིའི་བུའི་སྨོན་ལམ་དང་མཐུན་པ་ཡིན་ལ། ཐུན་མོང་མ་ཡིན་པའི་ཕ་ནི་གོང་དུ་སྨོས་པའི་གནས་ཆེན་རི་བོ་བཀྲ་བཟང་གི་ཞིང་སྐྱོང་གཙོ་བོ་དེ་ཡིན་ཞེས་རང་གི་ཨ་ཕྱི་དང་ཨ་མ་ནས་རྒྱུ་མཚན་ཞིབ་མོ་ཡང་ཡང་བསྙད་ཀྱི་འདུག་པ་དང་། རྗེ་བཙུན་བླ་མ་མཆོག་ནས་ཀྱང་དེ་ལྟར་དགོངས་སོ་ཞེས་ཐོས་ལ། དེས་ན་ཡུལ་ལྷ་ཆེན་པོ་དེ་ནི་བླ་མ་གོང་མ་རྣམས་ཀྱི་ཆོས་བོན་སྐྱེ་བོས་གསོལ་བའི་མིང་ཐ་དད་ཅན་དྲེགས་བྱེད་སྟོང་སྡེའི་རྗེ་བོ་ཡིན་ཞེས་དང་། མཆོག་གི་བདག་ཉིད་ཆེན་པོར་གྱུར་པའི་གཏེར་ནས་བྱོན་པའི་སྒྲུབ་ཐབས་དང་མཐུན་པར་གཟིགས་སྣང་དུ་གཏེར་བདག་གནོད་སྦྱིན་དབང་པོའི་སྒྱུ་འཕྲུལ་ལྟར་བཞེད་པ་སོགས་གང་ལྟར་མཐུ་དང་རྫུ་འཕྲུལ་ཆེ་བ་ཞིག་གོ །ཡང་ཁ་ཅིག་ནས་མིང་གི་རྣམ་གྲངས་རྡོ་རྗེ་བྲག་བཙན་ཞེས་ཀྱང་འདོད་ན། དེ་ནི་ཀློ་དང་ཀོང་ཡུལ་སོགས་སུ་གྲགས་ཆེ་ཞིང་ཆགས་པའི་གནས་དང་མིང་གི་རྣམ་གྲངས་ཁུངས་ལྡན་ཅི་རིགས་སྣང་ཡང་དགོས་པ་མི་ཆེ་བས་ན་འདིར་མ་སྨྲས་ལ། སྤྱིར་ཡང་ཁོ་བོ་ཅག་མི་མ་ཡིན་དེ་ལྟའི་བུ་རུ་སྨོས་པ་འདི་ཡང་འཕྱར་བའི་གནས་ནི་ནམ་ཡང་མ་ཡིན་ཏེ། ཅི་ཕྱིར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱང་བརྒྱ་བྱིན་དང་ཉེ་དབང་ངམ་དབང་ལྡན་བདག་པོ་ལྟ་བུའི་ལྷ་ཆེ་ཆེ་བའམ་དེ་བཞིན་ཀླུ་དང་། ཡི་དྭགས་ཀྱི་རྒྱལ་པོ་ཆེན་པོ་སོགས་མི་མ་ཡིན་མཐུ་ལྡན་གྱི་སྲས་སུ་སྣང་བར་མ་མཛད་ཅིང་། རྫོགས་སངས་རྒྱས་པའི་རྟེན་ནི་མི་ཁོ་ནར་ངེས་པ་དང་། བཀའ་ལས་ཀྱང་བྱང་ཆུབ་ཀྱི་ལམ་སྡོམ་པ་སྐྱེ་བའི་རྟེན་དང་སངས་རྒྱས་མྱུར་དུ་བསྒྲུབ་པའི་རྟེན་མཆོག་ཏུ་གྱུར་པ་ནི་ལྷ་ལས་ལྷག་པའི་མི་ཡི་ལུས་ཁམས་དྲུག་ལྡན་པ་ཁོ་ན་ཆེ་ཐང་དུ་མས་བསྔགས་པ་མཛད་ན་རིགས་རུས་བསྐྱེད་པའི་ཕ་མི་ལས་ལྷག་པ་གཞན་ནམ་ཡང་ཡོད་པ་མ་ཡིན་ན་དེ་ལས་ལྡོག་སྟེ་བདག་ནི་འབྱུང་པོ་ཤ་བརྗེན་བཟའ་བའི་རིགས་སོ་ཞེས་པ་ནི་གནོང་པར་བྱེད་པའི་ཚིགས་སུ་ཟད་མོད། གཞན་སྐྱེ་བོ་ཕལ་པ་དྲག་རྩལ་ཅན་ཁ་ཅིག་ཡུལ་ལྷ་སོགས་ཀྱི་བུ་རུ་རློམས་ཤིང་འཕྱར་བ་ནི་འཇིག་རྟེན་ཕལ་པའི་ལུགས་ངན་ལས་དམ་པའི་ཆོས་ལ་སྤྱོད་པ་རྣམས་ཀྱི་རྒྱང་རིང་པོ་དོར་བྱར་ཤེས་སོ། །དེ་ལྟ་ན་ཡང་རང་གི་མ་ཡི་གཏམ་སྟེ་རྫུན་མེད་ངེས་པ་ཡི་སེམས་ཅན་ལས་ཚུལ་འགོག་པ་མེད་པ་དང་ཡིན་ལུགས་ཇི་བཞིན་བརྗོད་ན་མི་མ་ཡིན་དེ་ཡང་མགུ་བ་སྐྱེས་ཏེ་བྱང་ཆུབ་ཀྱི་སྤྱོད་པ་བརྟས་པའི་རྒྱུར་ཡང་སྲིད་དོ་སྙམ་ནས་སྨྲས་པ་སྟེ། དཔྱོད་ལྡན་དམ་པ་རྣམས་ཀྱི་ཐུགས་ཀྱིས་མི་ཁྲེལ་བ་སྙིང་ནས་གསོལ་བ་འདེབས་སོ། །<br>འགྲོ་དྲུག་སེམས་ཅན་ཐམས་ཅད་ཕ་མ་ཉིད། །ལས་ཀྱི་ཚུལ་ཡང་བསམ་གྱིས་མི་ཁྱབ་སྟེ། །བྱས་གཟོ་དྲིན་དུ་ཤེས་པའི་ངང་ཚུལ་གྱི། །ཐོག་མེད་དུས་ནས་ཚེ་འདིར་ཕ་མའི་བར། །ཀུན་གྱི་སྡུག་བསྔལ་མཐའ་དག་སེལ་སླད་དུ། །བྱང་ཆུབ་མཆོག་གི་ཤུལ་ལམ་འདིར་ཞུགས་པས། །བྱང་ཆུབ་སྤྱོད་བརྩོན་རིང་མིན་རྫོགས་སངས་རྒྱས། །ཕ་མའི་ཚོགས་ཀྱང་སངས་རྒྱས་སར་སྒྲོལ་ཤོག །ཉམ་ཐག་ཕ་མའི་སྡུག་བསྔལ་མི་ལྟ་བར། །རང་ཉིད་ཁོ་ན་ཞི་བདེ་ཙམ་གྱི་བློ། །ཁྲེལ་མེད་ངོ་ཚ་བོར་བ་མ་རབས་ལུགས། །རྒྱལ་དང་དེ་སྲས་རྣམས་ཀྱིས་སྨད་པའི་གནས། །ཞི་བ་ཕྱོགས་གཅིག་མྱ་ངན་འདའ་བའི་སེམས། །རང་རྒྱུད་རྣམ་རྟོག་ནམ་ཡང་མི་སྐྱེ་ཞིང་། །ཚད་མེད་སྙིང་རྗེ་ཕ་མའི་སྡུག་བསྔལ་ཀུན། །ཇི་སྲིད་བར་དུ་སེལ་བའི་བྱེད་པར་ཤོག །འགྲོ་བ་ཐམས་ཅད་ཕ་མར་ཤེས་པ་དང་། །ལས་ཀྱིས་ཚེ་འདིའི་ཕ་མའི་ཚུལ་ཇི་འདྲ། །ཆ་ཙམ་བརྗོད་ལ་ཉེས་པ་མེད་སྙམ་ཡང་། །ཉེས་ན་དམ་པ་རྣམས་ལ་བཟོད་ཀྱང་གསོལ། །ཞེས་པ་ཡང་སྨྲས་སོ། །</p><p class=\"tibetan-text\">རིགས་ཀྱི་མཚན་ཉིད་ཕ་མ་དེ་ལྟ་བུའི་བུ་རུ་ཕྱུགས་བདག་གི་ལོར།<br>མངལ་ཆགས་ནས་འབྲས་བུ་སྣ་ཚོགས་རྒྱས་པའི་ལོ་རྒྱལ་གྱི་ཟླ་བའི་དམར་ཕྱོགས་ཀྱི་ཚེས་དགེ་བར་པདྨ་ཌཱཀྐི་རྒྱུ་བའི་དུས་སུ་བདག་སྐྱེས་ཤིང་སྐྱེས་པའི་ཉི་མ་དེར་ནམ་མཁའ་མཐིང་ཞུན་སྔོན་པོས་ཁེབས་ཤིང་ཉི་མའི་འོད་ཟེར་རབ་ཏུ་བཀྲ་བར་གྱུར་ཞེས་ཀྱང་གྲགས་ལ་སྐྱེས་ནས་ཟླ་བ་གསུམ་ལོན་པ་ཙམ་ནས་ཚིག་གི་བརྡའ་ཅུང་ཟད་སྦྱོར་ནུས་ཤིང་། ལོ་རུ་ལོངས་པ་ན་རེ་ཞིག་གི་ཚེ་རིག་འཛིན་པདྨ་མ་ཎིའི་ཕྱག་བྲིས་བླ་མ་ལོངས་སྐུ་གསུང་རྡོ་རྗེ་ཚེ་དཔག་མེད་ཀྱི་སྒྲུབ་ཐབས་དཔེ་གོང་མའི་གྲྭ་རིགས་ཞིག་གི་ལག་ཏུ་ཐོག་པ་ཁོ་བོས་བླངས་བ་མ་གཏད་པར་ཡིད་སྐྱོ་ཚུལ་གྱིས་འདི་ནི་ངེད་རང་གི་དཔེ་ཡིན་ཞེས་སོགས་ངེས་ངེས་འདྲ་བ་མང་ཞིག་སྨྲས་པས་ཁོས་ཀྱང་རིག་འཛིན་གོང་མ་དེ་རྗེས་སུ་དྲན་པའི་དད་པས་མཆི་མ་འཁྲུག་ཅིང་ཕྱིན་ཆད་བྱམས་པར་བྱས་ཞེས་གྲགས་ལ་པདྨ་ནོར་བུའི་སྤྲུལ་སྐུ་ཡིན་མིན་ཇི་ལྟར་ཡང་ཚེ་འདིར་སྔོན་ནས་རྗེས་དྲན་གྱི་ཁུལ་གཞན་ལ་སྨྲས་པའི་ཐོག་མ་དེ་ཡིན་པར་ཐོས་ལ་དེ་ནས་བརྩམ་སྔོན་གྱི་ངང་ཚུལ་ཅི་རིགས་པ་སྨྲ་བ་ཞིག་བྱུང་བར་སྣང་ལ། དེར་ལྷན་ཅིག་སྤྱོད་པ་རྣམས་ཀྱིས་ནི་སྐྱེ་བ་ཤིན་ཏུ་གསལ་བར་དྲན་པ་ཞིག་གོ་སེམས་ཤིང་ཡིད་མགུ་ཞིང་སིམ་པར་བྱེད་དོ། །གཞན་ཁ་ཅིག་ནས་དེ་ལ་ངན་སྨྲ་དང་མུ་ཅོར་སྣ་ཚོགས་བརྗོད་པར་གྲགས་ཀྱང་ངེད་ལ་ནི་ཁྱད་པར་གང་ཡང་མ་བྱུང་ངོ་། །སྔོན་ཚེ་ཡུལ་གྲུ་ཉི་ཚེར་གྱུར་དེ་རུ། །དམ་པའི་གྲགས་ལྡན་དེ་ཙམ་ཡང་སྲིད་དུ། །ཐོས་ཀྱང་ངན་སྨྲས་ལ་གོམས་བླུན་རྣམས་ཀྱིས། །དེ་ཡི་ཡང་སྲིད་མིན་ཞེས་མགྲིན་རྔ་བརྡུང་། །ད་ནི་འཛམ་གླིང་བོད་འདིར་ཕྱག་རྒྱ་ཆེའི། །རིག་འཛིན་མཆོག་བརྙེས་གང་དེའི་སྒྱུ་འཕྲུལ་ཞེས། །གྲགས་པ་རིན་ཆེན་དོ་ཤལ་གངས་ཅན་གྱིས། །ཕྱོགས་མཚམས་བུ་མོའི་རྣ་ཆར་ཡོངས་འཁོད་ཚེ། །ངེད་ཀྱི་ཕ་མཚུན་མིན་ཞེས་བདག་བཟང་པོར། །བགྱིད་འོས་དེ་ཡི་མཚན་ཡང་མེ་ཁྱེར་སྲིན། །ཇི་བཞིན་རང་གནས་འཇག་ཟིལ་གསེབ་ཡིབ་པའི། །བྱེད་པོ་རྟ་བདུན་མཐོང་ཚེ་ཅི་སྨྲ་སེམས། །བདག་ནི་སོ་སོ་སྐྱེ་ཡིན་དམ་པ་མིན། །དེས་ན་གྲུབ་པའི་སྒྱུ་འཕྲུལ་ཅི་ཞིག་འགྱུར། །འོན་ཀྱང་དགེ་འབྲས་སྨིན་འོས་རྣམ་ཤེས་ཤིག །མགོན་དེས་བྱིན་གྱིས་རླབས་སམ་ཡང་སྤྲུལ་གྱུར། །ད་དུང་རང་གིས་དཔག་པར་མི་ནུས་ན། །རང་མཚུངས་གཞན་གྱི་བརྟག་པའི་ཡུལ་མ་གྱུར། །ནམ་ཡང་དད་ལྡན་མི་བསླུའི་གདེངས་ལྡན་ན། །བརྟག་དཔྱད་དགོས་མེད་ཆུ་ཡི་རི་མོར་མངོན། །འདི་འདྲའི་ཚུལ་ལ་ཅིས་ཀྱང་བརྟག་འདོད་ན། །ཡེ་ཤེས་སྤྱན་ལྡན་འཕགས་པའི་ས་སྒྲུབ་འཚལ། །ཞེས་སོ། །<br>དེ་ནས་རིམས་ཀྱི་ནར་སོན་ཏེ་ལོ་གསུམ་བཞིའི་སྐབས་སུ་གནས་མལ་ངེས་པ་མེད་པའི་དབང་གིས་རྡོ་གྲམ་ཞེས་པའི་གྲོང་ཆུང་དེར་སྡོད་ཀྱི་ཡོད་སྐབས་རང་གི་ཨ་ཕྱི་འཕགས་མས་བྱིན་གྱིས་བརླབས་པར་གུ་རུའི་ལུང་གིས་ཟིན་པ་དེ་ཡི་དཀར་ཁྲིད་ཀྱི་རྣལ་འབྱོར་བྱེད་པ་མཐོང་བས་རྐྱེན་སད་དེ་ཕྱིན་ཆད་ཚུལ་དེ་ལ་ཡིད་རབ་ཏུ་ཞུགས་པར་གྱུར་པ་ཡི་སྐྱོང་བའི་རྣམ་འགྱུར་ཁོ་ན་བྱས། དེ་འཕྲོས་ལོ་ལྔའི་སྣེ་ཟིན་ཙམ་པར་བྲག་དམར་དགོན་དུ་ཕྱིན་པར་ཚད་ཐུབ་གཏེར་སྟོན་མང་པོའི་ཞབས་ལ་ཐུག་ཅིང་། གནུབ་ཆེན་བུདྡྷ་ཛྙཱ་ནའི་སྤྲུལ་པར་གྲགས་པ་ཀུན་བཟང་ཁྱབ་གདལ་ལྷུན་གྲུབ་ཞེས་རང་གི་རིགས་ཀྱི་ཁུ་བོར་བསྙེག་པ་ཞིག་ཡོད་པ་དེ་དང་ཡུད་ཙམ་མཇལ་བ་ན་དགྱེས་པས་བདག་གྲལ་གྱི་གོང་དུ་བཞག བཞེས་པའི་ཕུད་ནས་དྲངས་བ་སོགས་དགོངས་ཡུལ་དེའི་ཡང་སྲིད་བདག་ཡིན་མིན་ཅི་ལྟར་ཡང་བུས་པ་ཤེས་མ་བྱེ་བ་ཞིག་ལ་སྔར་གྱི་གོ་སའི་བབ་ཕྱོགས་མཚུངས་ཙམ་ཁྲེལ་ཡོད་ངོ་ཚ་ཤེས་ནས་མཛད་པ་ཁོང་ཁོ་ནར་ངེས། གཞན་རང་རང་ཕྲལ་ཆོས་བརྒྱད་སུ་རེམ་ལས་སྔར་གྱི་གོ་ས་མནོ་མཁན་མེད་པ་སྤྱིར་ངོ་ཚ་ཆུང་བར་མ་ཟད་ལྷག་ཏུ་བདག་གི་སྐྱེ་བའི་ཡུལ་ཕྱོགས་དེར་དེ་འདྲ་ཤིན་ཏུ་གང་ཞིང་དེ་ཡང་མི་སྐྱའི་གནས་ལས་ཆོས་གཟུགས་བཙུན་པ་རྣམས་ལྷག་པར་ཁྲེལ་ལ་མི་གནས་པར་ཐུབ་ཆོསཁོ་ནར་སྤྱོད་པ་ཞིག་གོ །སྤྱོད་ལྡན་ཁྲེལ་ཡོད་སྔོན་རབས་བཟང་པོའི་སྲོལ། །དེང་སང་དུས་སུ་མིང་ཙམ་ཁོ་ནར་གྱུར། །ལྷག་པར་མཐའ་འཁོབ་རེ་ཁེ་ལྗོངས་དེ་རུ། །འདི་སྣང་དྲེགས་པས་ཆོས་བརྒྱད་སུ་རེམ་ལས། །གོ་སའི་ཚུལ་ལ་དམིགས་པ་ཡེ་མ་མཐོང་། །གང་ཞིག་རྟེན་གྱི་ཁྱད་པར་དགེ་སློང་ངམ། །ཡི་དམ་ནུས་པ་རྙེད་པ་མ་ཡིན་པར། །རིགས་རུས་སྐྱེ་བས་ཐོབ་པའི་གོ་ས་ལ། །ཟང་ཟིང་ཁུར་གྱིས་དྲེགས་ནས་འགོང་མི་རུང་། །ཅི་ཕྱིར་གཏོང་འཛིན་ལྷ་ཡི་ཞེ་ཁྲེལ་ཞིང་། །བསོད་ནམས་ལས་ཉམས་མི་ཤིས་རྒྱུ་རུ་བཤད། །དེ་ལྟ་ན་ཡང་དེང་སང་དུས་དབང་གིས། །ཕྱོགས་དེར་མི་ནག་སྐྱེ་བོ་ཡ་རབས་ལས། །ཆོས་གཟུགས་འཛིན་རྣམས་ལྷག་པར་ཆགས་སྡང་ཆེ། །བག་མེད་ཆང་དང་བརླང་པོའི་བརྟུལ་ཞུགས་ཀྱིས། །བཟང་པོའི་སྲོལ་རྣམས་ཕལ་ཆེར་དྲི་མར་བྱས། །ཞེས་སོ། །དཀྱུས་སུ་འཇུག་པ་བཞུགས་གྲལ་དེར་བདག་བྱིས་པར་སོང་བའི་བློ་བྲིད་པའི་སླད་དུ་གུ་རུ་པདྨའི་སྐུ་ཞིག་ཕྱག་གིས་བྲི་བར་གནང་ཞིང་བདག་གི་སྔོན་གནས་རྗེས་སུ་དྲན་པའི་ཚུལ་ལས་བརྩམས་གསུང་གླེང་མང་དུ་བྱུང་བས་ཀྱང་རྐྱེན་བྱས་འོད་གསལ་རྡོ་རྗེ་སྙིང་པོའི་མན་ངག་སྐྱོང་ཚུལ་ཅི་རིགས་ཤིག་དེ་དུས་ནས་ཤེས་ཤིང་དྲན་ཏེ་ད་ལྟ་བར་མོས་པ་ལམ་བྱེད་ཙམ་དུ་སྙིང་གི་དབུས་སུ་བཟུང་སྟེ་གནས་མོད། དེང་སང་ཕལ་ཆེར་ཚོགས་དབུས་འཕྱོར་རྒྱན་ངོམ་ཆོས་སུ་བྱེད་ཀྱི་འདུག་ཀྱང་བདག་ནི་བཅོམ་ལྡན་འདས་དཔལ་ཀུན་ཏུ་བཟང་པོ་དང་རིག་འཛིན་མཆོག་དགའ་རབ་རྡོ་རྗེ་ཡིས་ལན་གཅིག་མ་ཡིན་པར་ཡང་ནས་ཡང་དུ་ནན་ཏན་ཆེན་པོ་ཡིས་ཤིན་ཏུ་གསང་བར་གདམས་ཤིང་གལ་ཏེ་འཕྱར་ན་སྙིང་ཁྲག་སྐྱུགས་ཏེ་ཚེ་ཡི་དུས་བྱས་ཤིང་རྡོ་རྗེ་དམྱལ་བར་བསྐལ་པ་བདུན་འབུམ་དུ་གནས་པའི་དམོད་པར་འཇིགས་པས་ཚུལ་འདི་བབ་ཆོལ་གྱི་བྱིས་པ་ནས་ད་ལྟའི་བར་ནམ་ཡང་སྨྲ་མ་མྱོང་ངོ་། །ལར་སངས་རྒྱས་ཀྱི་གསུང་ཀུན་གྱི་བདེན་པར་འཛིན་ན་དམོད་པ་འདི་ནི་ཤིན་ཏུ་གཉན་པར་རྟོགས་དགོས་སུ་སྣང་ལགས་སོ། །འདི་ལྟ་བུའི་དམོད་པ་ལ་མི་འཇིགས་ན་རྒྱུ་འབྲས་དམ་ཚིག་གཞན་ལ་ཅི་ཕྱིར་འཇིགས། དེ་བས་ཚུལ་འདི་ལ་བག་ཡོད་པར་བྱོས་ཤིག ཞེས་སྙིང་ཁོང་རུས་པའི་གཏིང་ནས་ཐལ་མོ་སྦྱར་ཏེ་གསོལ་བ་ལགས། <br>སྨྲས་པ། སྔོན་སངས་རྒྱས་བསྟན་པ་རྫོགས་ལྡན་སྐབས། །མི་ཀུན་ཀྱང་ཤིན་ཏུ་གསང་བ་བསྲུང་། །གནད་དེ་ཡི་འབུམ་ཕྲག་འགྲོ་བ་ཡང་། །དུས་གཅིག་ཆར་གྲོལ་བ་ཁོ་ནར་གྱུར། །བོད་འདིར་ཡང་ཆོས་རྒྱལ་བྱང་སེམས་སྐབས།།རྗེ་གུ་རུས་དབང་བསྐུར་མཛད་པའི་མིང་།།གསང་སླད་དུ་དབང་ལ་རིམ་པར་བཏགས། །མིང་ཁོ་ནར་དོགས་པ་དེ་ཙམ་ན། །དབང་གདམས་པ་དངོས་ལ་སྨོས་ཅི་འཚལ། །དུས་དེང་སང་སྙིགས་མའི་མར་གཤམ་གྱུར། །ཆོས་ཟབ་དགུ་ཁྲོམ་དུ་ཟོང་ལས་འབོལ། །སྔགས་གྲུབ་པ་ཐོབ་པ་སྨོས་ཅི་འཚལ། །སེམས་ངོ་བོ་ཆ་མཐུན་མཐོང་ཡང་དཀོན། །དཔལ་ཀུན་བཟང་པདྨ་འབྱུང་གནས་ཀྱི། །བཀའ་གསང་རྒྱས་བཏབ་པ་རྒྱབ་ཀྱིས་ཕྱོགས། །ཆོས་མ་ཡིན་སྒྲིབ་ཤིང་ཆོས་ལ་བཅོལ། །རི་ཀླུང་ཀུན་གློ་སྐམ་ཐུག་པ་བཞིན། །ངེད་གྲུབ་ཐོབ་འཁྲུལ་ཞིག་ཡིན་ནོ་ལོ། །གསང་ཁྱད་གསོད་ཐུགས་ཀྱི་དམ་ཉམས་པ། །ཚུལ་འདི་འདྲས་ཁེངས་འདི་ཀྱེ་མ་ཧུད། །ཞེས་བར་སྐབས་ཀྱི་འཕྲོས་ཏེ། དེའི་རྗེས་ཚེས་བཟང་བ་ཞིག་ལ་བྲག་དམར་བུ་བྲང་དུ་གདན་བཤམས་བཟོས་སྒོ་ཆེ་བར་མཛད་དེ་ངེད་འབོད་མི་གནང་བྱུང་ཡང་རང་ཉིད་བྱིས་པའི་རྟགས་ཀྱིས་འགྲོ་མ་ཐུབ་པ་ཕྱོགས་དེར་རྟེན་འབྲེལ་ཁ་ཤས་ལ་གནོད་རུང་སྔོན་གྱི་ལས་ཚུལ་ཞིག་ཏུ་སྣང་། ལོ་དེ་ཡི་དཔྱིད་དེར་བླ་མ་གོང་མའི་དབོན་རིགས་ཁ་ཤས་པས་སྤྲུལ་སྐུ་ངོས་འཛིན་གྱི་ཁུལ་དུ་རྩེ་རུ་བལ་ལན་གཅིག་བོས། ལམ་བར་དུ་སྔོན་གནས་རྗེས་དྲན་ཁ་ཡར་བསྙད་པར་དེ་སྐབས་མི་མགུ་བའི་གཏམ་མང་དུ་སྨྲས་ཀྱང་། ངེད་རང་ནས་ནི་སུ་ཞིག་དྲན་པ་ཡིན་ཡང་རུང་ཕྱོགས་དེར་མི་འཚོགས་བརྒྱ་ཕྲག་ཉེ་བ་ཞིག་ལ་དབང་བསྐུར་བྱས་པ་ནི་ད་ལྟ་ཡང་ཡིད་ལ་ཝལ་ཝལ་དྲན་ངེས་ཡིན། དེ་གང་ཡིན་མཛུབ་མོ་བཙུགས་ཏེ་སྨྲ་མ་དགོས་ན་ཁྱེད་རྣམས་སེམས་མ་འཁྲུག་ཅིག གང་ལྟར་རུ་བར་སླེབ་བསྙེན་བསྐུར་ནང་དེ་ནས་ནི་ཁོང་རང་ཚོའི་ཆུ་འབབ་དེ་བྱས། ངེད་ལ་སྒེར་དུ་བཀུར་བཟོས་མ་དགོས་པ་གཞི་གྲུབ་གཞན་ནས་ནི་འབྲེལ་འབྲེལ་མེད། ཕྱིས་ངེད་ལོ་བཅུ་བདུན་ལོན་པར་ས་དམར་ཕྱོགས་སུ་ཕྱིན་སྐབས་དེ་དུས་ཁྱིམ་མཚེས་བུད་མེད་ཞིག་གིས་སྔར་བྱིས་པ་ཆུང་ངུ་ཞིག་བྱུང་བ་དེ་བླ་མ་འདི་འདྲ་ཨེ་ཡོང་མ་ཤེས་དེ་ཤེས་ན་ལན་ཅིག་བོས་ཏེ་འོ་མ་ཕོར་གང་ཙམ་བྱིན་ཆོག་རྒྱུ་ཡིན་འདུག་ཀྱང་མ་བྱུང་ཟེར་བ་དེ་སྐབས་ཡིན། གོང་མའི་སྐུ་གཉེན་ཚོས་ངེད་ལ་མཐོང་ཅི་ཙམ་བྱས་མཐའ་དག་དེས་མཚོན་ནུས་སོ། །དེར་ཞག་ཤས་བསྡད་སླར་རང་གནས་ལོག་ཡོང་སྐབས་སྐྱེལ་མཁན་གྲུལ་བཏུབ་མེད་པས་ཞོན་རྟ་ལས་བརྡབ་དལ་འབྱོར་རྟེན་ཆུད་ཟོས་དོས་ཤོར་བྱས། སྐུ་སྐྱེ་སྤྱི་ལ་མེད་པའི་ངེད་ལ་དགོས་ཆོས་མགྲོན་ལན་གཅིག་པུ་དེ་ཡི་སྐབས་སུ་ཡང་ངོ་མཚར་ཅན་དེ་འདྲ་བརྡོག དེ་ནས་བརྩམ་ངེད་ལོ་བཅུ་གསུམ་སྐབས་ཟུར་བཞུགས་ཕྱིས་གདན་ས་གྱུར་པ་བླ་མ་སྐལ་བཟང་དྲུང་ནས་གདན་སར་བོས་པའི་བར་ཁོང་རྣམས་དང་ལན་གཅིག་འཕྲད་པ་ཙམ་ཡང་མ་བྱུང་ངོ་། །གཞན་ཡང་དེ་མཚུངས་ཀྱི་གཏམ་ཤིན་ཏུ་མང་བ་ཞིག་ཡོད་པ་ནི་རང་གི་སྔོན་གྱི་ལས་དང་འཕྲལ་གྱི་རྐྱེན་ལས་གྲུབ་པར་གདའ། ཨོཾ་མ་ཎི་པདྨེ་ཧཱུྃ་ཧྲཱི། བླ་གཟུགས་གཞན་རྒྱུད་ཤེས་གྲགས་ལུང་བསྟན་དང་། །མཁྱེན་དཔྱོད་བློ་གྲོས་ཆེར་རློམ་མང་ཞིག་གིས། །ཁ་ཚོན་གཅོད་འགའ་སྔ་ཕྱི་མི་མཚུངས་པ། །རང་གི་མཚན་ཉིད་སྟོན་ལས་ཅི་ཞིག་གུ། །ཕྱོགས་རིས་དབང་གིས་བསྟོད་པ་འགའ་མེད་ཅིང་། །སྨད་ཚིག་མང་ཡང་བྲག་ཆ་ལྟ་བུར་ཡལ། །བཅོས་མས་མ་ཡིན་རང་བཞིན་གཤིས་ཉིད་དུ། །སྤྲུལ་པའི་མིང་ཙམ་གྲགས་ལ་ཆེས་སྡང་ན། །བཅོས་མར་གྱུར་རྣམས་ཐལ་བར་བརླག་ངེས་ཀྱང་། །དགའ་འཛུམ་མདངས་ཀྱིས་བསུ་འདི་ཡ་མ་ཆ། །རྗེ་བཙུན་བླ་མ་པདྨ་མ་ཎི་དེ། །སྐྱེས་མཆོག་ཡོན་ཏན་དུ་མས་ཆེ་མོད་ཀྱང་། །རྣམ་པ་ལུང་ཆུང་ཀྱོག་པོའི་བས་མཐའ་རུང་། །གནས་པའི་སྦས་ཚུལ་གྲུབ་བརྙེས་བཞུགས་ཤིག་གོ །བདག་ནི་གཞན་དྲིང་མི་འཇོག་རང་ལམ་དུ། །རང་སྐད་རྒྱབ་ནས་རྒྱལ་ཁམས་བགྲོད་པ་པོ། །མིང་གོག་དེ་གསོབ་འཇུག་རིན་ཅི་ཕྱིར་ཆོག །མིང་དེ་བདག་གི་བེད་སྤྱོད་བྱས་མིན་ན། །མིང་གོག་དེ་ལ་ཐུགས་རྩིས་མཛད་པ་པོ། །སོ་སོས་ཅི་བདེར་ཐུགས་ཚེགས་མཛོད་ཅིག་གུ །ཕ་ཤུལ་བུས་འཚོབ་གསེར་གྱི་འཕྲེང་བ་བཞིན། །གོང་མའི་རྣམ་ཐར་འཛིན་ནུས་འཆང་ཐུབ་ཀྱི། །བདག་ལ་རྟག་ཏུ་སྤྱོ་བར་མཛད་སྲིད་ཀྱང་། །བདག་སྐྱོན་ཉིད་ངེས་མི་མགུ་ཅི་ཞིག་འཚལ། །ཕ་མེས་ཙནྡན་བུ་ཚ་འགལ་དུམ་ཤིང་། །བསྟན་འཛིན་སྐྱེས་བུའི་ཤུལ་དུ་བསྟན་འཚོང་མཁན། །དེ་འདྲས་བདག་ལ་དམོད་པར་བྱེད་པ་འདི། །མཚན་ཉིད་ཅི་འདྲ་གཟུར་གནས་ཀྱིས་བལྟས་གསལ། །ཕ་མྱེས་བླ་འཚོང་གོང་མའི་རྐང་འདྲེན་པ། །རང་སྐྱོན་རི་བོའི་ཁུར་ལ་མི་ལྟ་བར། །གཞན་སྐྱོན་སྐྲ་རྩེའི་ཉག་མས་གཞལ་མཁས་པའི། །མ་རབས་དེ་འདྲར་སྙིང་རྗེས་མཆི་མ་འཁྲུག །ཀྱེ་མ་འཁོར་བའི་གནས་ཚུལ་འདི་ལྟ་སྟེ། །དགྲ་ལ་གཉེན་དང་གཉེན་ལ་དགྲ་རུ་མཐོང་། །འཁྲུལ་སྣང་དྷ་དྷུ་ར་ཡིས་མྱོས་པ་བཞིན། །བསམ་བཞིན་ངེས་པར་སྙིང་ནས་སྐྱོ་བ་འཕེལ། །ཀྱེ་མ་སྒྱུ་མ་མཁན་གྱི་འཁྲུལ་འཁོར་བཞིན། །འདི་ལ་ནམ་ཡང་ཞེན་པའི་ཡུལ་མ་གྱུར། །འོན་ཀྱང་བྱས་འབྲས་སེམས་ལ་འཆར་སྨིན་པ། །ཀུན་རྫོབ་ངང་ཚུལ་གཏམ་དུ་དེ་སྐད་སྨྲས། །ཞེས་སོ། །<br>ད་ནི་དཀྱུས་སུ་འཇུག་པར་བྱ་སྟེ། དེ་ནས་མི་རིང་བར་རྡོ་གྲམ་ཞེས་སུ་ཕྱིན་ཅིང་སྡོད་པའི་སྐབས་གཏེར་སྟོན་བླ་རབས་ཁ་ཤས་ཀྱི་ཞལ་ཐང་མཐོང་བས་རྐྱེན་བྱས་དུས་རེ་ཞིག་ན། ཉིན་གཅིག་བྱིས་པའི་རྩེ་མོར་ནས་ཀྱི་སོག་སྦུག་གཅིག་གཤག་པའི་ཕྱེད་ཚལ་གྱི་ནང་དུ་གཏེར་སྟོན་རིན་པོ་ཆེ་རཏྣ་གླིང་པ་ཞིག་པོ་གླིང་པ་ནུས་ལྡན་རྡོ་རྗེ་ཀློང་གསལ་སྙིང་པོ་སྟག་ཤམ་རྡོ་རྗེ་སྟེ་གྲུབ་པའི་སྐྱེས་བུ་དེ་ལྔ་གྲལ་སྟབས་སུ་བཞུགས་ཤིང་སྐུའི་རྣམ་པ་ཤིན་ཏུ་གསལ་བ་ཞིག་བྱུང་སྟེ། མངོན་སུམ་ནི་ཅི་ལ་ཡིན། སྟོང་གཟུགས་ལྟ་བུ་ཡང་མ་ཡིན། གསལ་ནི་ཤིན་ཏུ་རང་ཡིད་ངོར་གསལ་བས་ད་ལྟ་བརྟག་ན་བསྐྱེད་རིམ་གྱི་གསལ་སྣང་ཤར་བ་ལྟ་བུ་ཞིག་འདུག་ཀྱང་། དེ་དུས་གསལ་སྣང་ཐེབས་དོན་ནི་མེད་ལ་གང་ལྟར་ཡ་མཚན་པ་བྱུང་། དོན་དུ་ནི་དེ་དག་གི་བྱིན་རླབས་ཞུགས་པའི་ལྟས་ཤིག་ཡིན་ནམ་སྙམ། གོང་གི་དེ་རྣམས་དང་ལྷན་དུ་གཞན་ཡང་འགའ་རེ་འདུག་སྙམ་རིབ་རིབ་སྣང་ཡང་ངེས་གསལ་མི་དྲན་པས་སྨྲ་མ་ནུས་སོ། །གཞན་ཡང་དེ་སྐབས་ཕལ་ཆེར་ཞིག་ཡིད་ཀྱི་ངོར་གུ་རུ་པདྨའི་སྐུ་ཡི་བཀོད་པ་ཁོ་ན་ལམ་ལམ་པར་བྱེད་ལ་ལྷག་ཏུ་སློབ་དཔོན་པདྨ་ཆ་ལུགས་སྤྱི་དང་འདྲ་བ་ལས་ཕྱག་གཡས་ས་གནོན་རྡོ་རྗེ་གཡོན་མཉམ་བཞག་ཐོད་པ་གྲུ་མོར་ཁ་ཊཱཾ་ཀ་འཛིན་པ་ཞིག་ཡང་ཡང་དུ་ལོ་ངོ་གཅིག་ཙམ་གྱི་བར་དུ་བྱུང་སྟེ། དེ་ཡང་ཆུ་བུར་མིག་གི་སྤྱོད་ཡུལ་ཅན་ནི་མ་ཡིན་མོད། མ་བསམ་པར་ཡིད་ངོར་མངོན་སུམ་ལྟ་བུར་ལམ་ལམ་པར་ཤར་བ་ཞིག་གོ །མེ་ལོང་ལ་པྲ་ཕབ་ཇི་བཞིན་དུ། །ཡོད་མེད་གཉིས་མཐའ་ལ་མ་ལྷུང་བར། །རང་སེམས་ཀྱི་ཡུལ་ན་སྣང་བའི་གཟུགས། །རྡོ་རྗེ་ཡི་སྐུ་དེ་ཅིས་མི་མཚར། །ནམ་མཁའ་ནི་ནམ་ཡང་རྒྱར་མ་ཆད། །འགྲོ་ཀུན་ལ་ནམ་མཁའ་ཁྱབ་པར་སྣང་། །རྒྱ་ཆད་དུ་འཛིན་པ་བླུན་པོའི་བློ། །ཁྱབ་གདལ་དུ་ཤེས་འདི་ངོ་མཚར་ཆེ། །ལོ་ལྔ་པའི་མཇུག་དེར་སྐྱབས་མཆོག་འཁོར་ལོའི་མགོན་པོ་རྡོ་རྗེ་འཆང་ནས་ཀ་ཁ་ཡི་སྦྱོར་ཀློག་སློབ་པའི་དབུ་ཚུགས་ཤིང་དེ་འཕྲོར་རྒན་རབས་ཀྱིས་ཅུང་ཟད་ལས་གཅུན་མ་དགོས་པར་ད་ལྟའི་ཀློག་ཡིག་འབྲིང་ཙམ་འདི་ལོ་དྲུག་སྐབས་ཉིད་དུ་ཚེགས་མེད་པར་ཁོང་དུ་ཆུད་པ་ཡིན་ནོ། །ལོ་དྲུག་ལོན་པའི་དཔྱིད་དེར་ཞང་པོའི་རྗེས་སུ་འབྲང་ནས་ཁྲོ་རྒྱལ་དགོན་དུ་འཁོར་ཙམ་ཕྱིན་ཞིང་སླར་རང་གནས་ལྡོག་པའི་མཚམས་གཞན་རྐྱེན་གྱི་ཟེར་རེ་མང་པོ་ལ་བརྟེན་ཡུལ་ངེས་པ་མེད་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་དགོས་པ་བྱུང་། དེ་དག་གི་བར་སྐབས་རྣམས་སུ་བཀྲེས་སྐོམ་དང་ཚ་གྲང་གི་སྡུག་བསྔལ་ཡང་ཅི་རིགས་པ་ཉམས་སུ་མྱོང་། བདག་ལོ་བདུན་པའི་སྐབས་དེར་རྗེ་བཙུན་འཁོར་ལོའི་མགོན་པོ་ཡང་རེ་ཁེ་སྨད་བསྭོ་ལྕི་རོང་རོལ་ལམ་དགོན་དུ་གདན་ཕབ་པར་མཛད་ཅིང་། བདག་ཅག་ལྟོས་བཅས་རྣམས་ཀྱང་དེ་མཐུན་ཕྱོགས་དེར་སྡོད་གནས་བྱེད་པར་ཤར། དེ་སྐབས་རང་ལོ་བདུན་བརྒྱད་པའི་མཚམས་རྣམས་སུ་དཔལ་ཆེ་མཆོག་རྡོ་རྗེ་ཁྲོ་ལོད་ཀྱི་ལས་བྱང་ནོར་བུའི་འཕྲེང་བ་ཀློག་འཛིན་ཡི་དམ་བགྱིས་པས་བར་ཆད་སེལ་བ་དང་། ཐོག་མར་དངོས་གྲུབ་ལྟས་ཅི་རིགས་པར་ཤར་ཡང་ཕྱིས་བསྙེན་བསྒྲུབ་འཕྲོ་འཐུད་རྒྱུ་མ་བྱུང་བས་དངོས་གྲུབ་ཀྱི་མཚན་མ་ཕྱིར་ཕྱོགས་སོང་། །དེས་ན་ཕྱིས་འབྱུང་གིས་བྱིས་པའི་དུས་ནས་ཡི་དམ་ལྟེམ་རྐྱང་མི་རུང་ཚུལ་སྨྲ་དགོས་རྒྱུར་གདའ་ཡང་ངེད་ལ་དེ་འདྲ་སྨྲ་མཁན་མ་བྱུང་བའི་སྐྱོན་ནོ། །སྤྱིར་རང་ལོ་བརྒྱད་པའི་སྐབས་དེར་རྨི་ཉམས་ཀྱི་རང་བཞིན་ཅི་རིག་པ་ཅིག་བྱུང་ཞིང་ལྷག་ཏུ་ཚེ་འདིར་ཨོ་རྒྱན་ཆེན་པོའི་ཟབ་གཏེར་གྱི་སྒོ་འཕར་འབྱེད་པ་དང་མི་འབྱེད་པའི་ལྟས་རྣམས་ཀྱང་གསལ་པོར་ཤར་བ་ཡིན་འདུག ལོ་དེའི་སྔ་ཕྱིའི་ཁོངས་སུ་སྣང་བ་འདི་ཡང་བདེན་ཞེན་མེད་པ་དངོས་དང་རྨི་ལམ་དབྱེ་གསལ་མི་བཏུབ་འལ་མ་འོལ་ཞིག་ཤར་ཏེ། དེ་དུས་ངོ་སྤྲོད་ཞིག་ཐོབ་ན་རྩལ་ཤིན་ཏུ་ཆེ་བ་ཡོང་རྒྱུར་འདུག་སྟེ་མ་བྱུང་། ལོ་བཅུ་གཅིག་པར་རྗེ་བཙུན་རྡོ་རྗེ་འཆང་ལ་བླ་མ་དམ་པ་ཀུན་རིན་པས་ཉམས་རྟོགས་ཀྱི་ངང་ཚུལ་ཞུ་གནང་མཛད་པ་ཐོས་པས་སེམས་ཀྱི་འཇོག་ཕྱོགས་ཆ་ཤས་ཤེས་ནས་བསྒོམ་པ་གནས་ཉམས་ཅི་རིགས་པ་སྐྱེས། ལོ་བཅུ་གསུམ་ལོན་པ་རྒྱལ་བའི་དུས་ཆེན་ས་ག་ཟླ་བའི་ཚེས་བཟང་པོར་བཀའ་དྲིན་ཅན་བྱིན་རླབས་ཅན་ཐུགས་རྗེ་ཅན་རྩ་བའི་བླ་མ་རྡོ་རྗེ་འཆང་པད་འབྱུང་བདེ་ཆེན་གླིང་པའི་ཞབས་པད་ལ་སྤྱི་བོས་བཏུད་ནས་དུས་གསུམ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་བསྒྲོད་པ་གཅིག་པའི་ལམ་གྱི་མཐར་ཐུག་གནས་ལུགས་རྫོགས་པ་ཆེན་པོའི་ཁྲིད་བཀའི་སྔོན་འགྲོ་དལ་འབྱོར་རྙེད་དཀའ་མི་རྟག་འཆི་བ་འཁོར་བའི་ཉེས་དམིགས་ཐར་པའི་ཕན་ཡོན་ལས་རྒྱུ་འབྲས་ཀྱི་ཁྲིད་སྐྱབས་འགྲོ་སེམས་བསྐྱེད་དེ་སྐྱེས་བུ་གསུམ་གྱི་ལམ་རིམ་མ་ཚང་བ་མེད་པ་དང་། མཎྜལ་རྡོར་སེམས་བསྒོམ་བཟླས་བྱིན་རླབས་བླ་མའི་རྣལ་འབྱོར་ཐུན་མོང་དང་ཐུན་མོང་མ་ཡིན་པ་བཅས་སྨིན་ཁྲིད་དུ་བཏང་བའི་རྗེས་སུ་སེམས་འཛིན་ནས་བརྩམ་དམིགས་པའི་སྤེལ་བསྒྱུར་རིམ་པར་གནང་བ་ལས་རྟོགས་འབུལ་གཉིས་ཟིན་པའི་སྐབས་སུ་རིན་ཆེན་ཟངས་ཀྱི་སྣོད་རྒྱ་ཇ་ངད་ལྡན་བསིལ་མས་བཀང་སྟེ་ཐོག་མར་བཅུད་དང་མཐར་སྣོད་ཀྱང་བསྩལ་ཞིང་གནས་འགྱུ་རིག་གསུམ་ཇི་བཞིན་ངོས་ཟིན་པའི་དབུགས་དབྱུང་བ་རྡོ་རྗེའི་བཀའ་ཡིས་གནང་བླ་མའི་བྱིན་རླབས་མཐུས་རིང་པོར་མ་ཐོགས་པར་སེམས་ངོ་ཆ་མཐུན་པ་གནས་འགྱུ་རིག་པ་ཡིད་ཆེས་རྐང་ཚུགས་སྐྱེས་ཀྱང་ལོ་དེའི་གཞུག་ལ་རིག་འཛིན་ཆེན་པོ་པདྨ་མ་ཎིའི་རིགས་དབོན་རིན་པོ་ཆེ་སྐལ་བཟང་ཨོ་རྒྱན་བསྟན་འཛིན་དྲུང་ནས་ཀཿཐོག་གི་མངའ་རིས་སྤྱི་དང་བྱེ་བྲག་ལྷོ་ཕྱོགས་རེ་ཁེ་ལྗོངས་ཀྱི་ཆར་རྒྱལ་བསྟན་འཛིན་གྱུར་ཡོངས་ཀྱི་སྤྱི་ཕུད་ཚད་སྐྱོབ་དཀར་པོའི་རྩེ་མོའི་དབལ་ལྟར་མངོན་པར་མཐོ་བ་ཀུན་མཁྱེན་པདྨ་བློ་གྲོས་ཀྱི་གདན་སར་བསུ་བའི་དགོངས་བཞེད་ཀྱིས་ཆེད་དུ་མངགས་ཏེ་གཉེར་པ་ལྕི་རོང་རོལ་ལམ་དུ་བྱུང་བར་བརྟེན་རྩ་བའི་བླ་མ་ལ་དགོངས་པ་ཞུས་ཏེ་གཟའ་སྐར་ལེགས་པ་ལ་ལམ་དུ་ཞུགས་ཤིང་རིམས་ཀྱིས་གསེར་གྱི་འདྲེན་པའི་ཆུ་ཀླུང་གནམ་སྔོན་ཞུ་བ་ལྟ་བུ་གཙང་ཐལ་དུ་ཀོ་བ་ལ་བརྟེན་ནས་བརྒལ་ཏེ་གསལ་སྨད་དུ་རྗེ་བླ་མ་ཡང་ངེད་བསུ་བར་ཕེབས་འདུག་པ་དང་མཇལ་བའི་ཐོག་མ་དེ་ཀར་རིག་འཛིན་གོང་མ་ཉིད་དུ་དགོངས་བཞིན་ཡུལ་ཕྱོགས་དེའི་སྐྱེ་རྒུ་མཆོག་དམན་ཐམས་ཅད་ཀྱི་གཙུག་ཏུ་ལུགས་གཉིས་ཀྱི་མངོན་པར་མཐོ་བ་འཇིགས་མེད་སེང་གེའི་ཁྲིར་བྱིན་གྱིས་བརླབས་གྱུར་རྟེན་འབྲེལ་བཟང་པོའི་གདན་དགེ་བ་ལ་བདག་བཞག་ནས་གུས་པའི་ཕྱག་དང་དགྱེས་པའི་བཀུར་གཟོ་ཆེ་བར་མཛད་ཀྱང་ངེད་ཀྱིས་ནི་ལྡང་བ་དང་ཕྱག་ལན་སོགས་དེ་སྐབས་ཆོས་འབྲེལ་མེད་པས་འབུལ་མ་ཐུབ། སྤྱིར་ངེད་ཆུང་ངུའི་སྐབས་ལྟག་ཚུག་ཟིན་མདོག་ཁ་བ་ཞིག་ཡོད་པས་ལོ་ཉི་ཤུ་རྩ་གཅིག་མར་བཏགས་ཆོས་འབྲེལ་མེད་པའི་བླ་མ་ལ་ཕྱག་མ་བཙལ། ཅི་ཕྱིར་བླ་མ་མིན་པ་ཕྱག་མི་བཙལ་ཞེས་རྒྱ་གར་གྱི་ཡུལ་ཆོས་སུ་ཡང་དེ་ལྟར་ཡོད་པར་ཐོས་པས་ཡིན་ལ། དེ་ལྟ་ཅི་དགའ་བྱ་ཆོག་པ་ནི་རང་གི་སྐྱེས་ཡུལ་ལུང་ཁྱོག་ཏུ་སོང་བའི་ཕན་ཡོན་ཙམ་དུ་སྣང་། ཕྱིས་རྒྱལ་ཁམས་གནས་སྐོར་ལ་ཕྱོགས་ནས་ཆོས་འབྲེལ་མེད་ཀྱང་གོ་ས་དང་ངོ་བསྲུང་དབང་གིས་ཕྱག་དང་ཕྱག་ལན་ཅི་རིགས་བྱེད་དགོས་ལྷུན་གྱིས་གྲུབ། དེར་ཡང་མ་ཟད་མེ་རྟ་ལོ་གཞུག་བལ་པོའི་གནས་སྐོར་ཕྱིན་སྐབས་དམན་པའི་ས་བཟུང་དག་པའི་སྣང་བ་སྦྱངས་རྒྱུའི་རྩིས་ཀྱིས་ལོ་ངོ་གསུམ་ཙམ་བླ་གཟུགས་ཆེ་ཆུང་མཆོག་དམན་མེད་པ་ཀུན་ལ་ཕྱག་དང་ཕྱག་ལན་ལྷུར་བླངས། རྗེས་སོར་མཐའ་ནི་མ་འཁྱོངས་པར་དམན་ས་བཟུང་དག་སྣང་ཕྱོགས་མེད་འབྱོངས་ན་ལེགས་མོད་ཀྱང་མཐའ་མི་འཁྱོངས་ཕྱིན་གོ་བབ་མ་རྩིས་པའི་ཕྱག་དང་ཕྱག་ལན་དེ་ཡང་ངོ་མཚར་དུ་མ་སོང་ཕྲལ་སྣང་ངོར་མ་མཛེས་ཤིང་ཕུགས་རྟེན་འབྲེལ་ལ་གནོད་པར་གོ །ཉང་སྟོད་ཨཱརྱ་བས་རྒས་ཆལ་སྔ་མ་དེ་ལོ་ཉི་ཤུ་ཙམ་ནས་སླེབ་ཡོང་ཟེར་བའི་གསེར་བྱུང་སོང་། །དེ་ནས་རྗེ་བླ་མའི་ཞབས་ཕྱིར་དཀྲིས་ཏེ་ལྗང་ཆུའི་གྲོང་ཚོ་ཅི་རིགས་པར་ཕྱིན། འགྲུ་སྲིབ་ཏུ་འབྱོར་བ་ན་ཚེ་དབང་རྒྱལ་བ་འདུས་པའི་ལྷ་དབང་གཏོར་མའི་བྱིན་རླབས་ཅིག་ཞུས། །དེ་ནས་བརྩམས་ཕུད་བླ་མ་ལ་ཞུས་ཞེས་པ་ཅི་ནུས་སུ་བགྱིས། དེ་ནས་བཙན་རི་གནས་ནང་དུ་སླེབ། དགུན་ངོ་དེ་དང་ལོ་ཕྱི་མའི་དབྱར་སྟོན་གྱི་བར་དུ་དེར་བསྡད་ནས་འཕྲལ་ཉེ་མཁོ་བློ་འཛིན་ཐན་ཐུན་བླ་མའི་བཀའ་ལྟར་བགྱིས་རུང་། གྲྭ་ཚང་མིག་སྲོལ་གཡེང་བས་བསླད་དེ་སྔར་གྱི་ཉམས་ཕྲན་བུ་དེ་ཡང་ཇེ་ཡལ་དུ་སོང་། དེར་ཡང་མ་ཟད་ཀྱི་ལོ་བཅུ་གསུམ་མར་བཏགས་མཚན་མོ་སྟོང་གཟུགས་དང་འབྲེལ་བའི་ལྷ་སྐུ་ཡི་སྣང་བ་འབྱམས་ཀླས་པར་ཤར་བ་དང་། མི་མ་ཡིན་མང་པོའི་གཟུགས་བརྙན་རྒྱུན་དུ་མཐོང་ཞིང་། རྨི་ལམ་གྱི་སྣང་བ་ཡང་མདུན་པ་གཏད་རེས་ཀྱིས་ཟིན་པས་ལྷ་འདྲེ་མང་པོ་དམ་ལ་འདོགས་པ་དང་། ལེགས་ཉེས་ཀྱང་ལྐོག་གྱུར་བའི་གནས་རྣམས་གསལ་པོར་རྔོ་ཐོག་པ་སོགས་སྒྲིབ་པ་ཅུང་ཟད་སྲབ་ཅིང་གཞོན་ནུ་རྩ་ཁམས་དྭངས་པའི་ནུས་པ་བརྗོད་ཀྱི་མི་ལང་བ་ཡོད་པ་ཐམས་ཅད་མེ་ལོང་ལ་སྣུམ་གྱིས་བྱུགས་པ་ལྟར་གདན་སར་སླེབ་ནས་བཟུང་རིམ་གྱིས་འགྲིབ་པའི་དབུ་ཚུགས་སོང་། དེ་ཡང་གྲྭ་ཚང་ནང་ནས་ནི་བརྙས་ཆོས་དང་ཁྱད་གསོད་ཀྱི་ཡུལ་ཉམས་ཐག་པའི་གནས་སུ་འཁོད་པ་ཡིན་ཡང་ཕྱི་རོལ་ནས་བླ་མར་དམིགས་ཏེ་དཀོར་རྫས་འདྲ་ཅི་རིགས་སྦྱིན་མཁན་བྱུང་བ་ཡི་སྐྱོན་ཀྱང་ལོས་ཡིན། གང་ལྟར་ཚེ་འདིར་དགོས་གལ་ཆེ་བ་མང་ཞིག་མི་འགྲུབ་པའི་སྣེ་ཟིན་པ་དེར་གདའ། དེས་ན་བསམ་བཞིན་སྲིད་པར་སྐྱེ་བ་འཛིན་པ་རྣམས་མ་གཏོགས་བདག་ལྟའི་སྐྱེ་བོ་ལ་མིང་དུ་སྐུ་སྐྱེར་བཏགས་ཏེ། དེ་ལ་བླུན་ཞེན་ཅན་རྣམས་འཚོགས་ནས་འདི་ངེད་ཀྱི་བླ་མའི་སྐྱེ་བའོ་ཞེས་དང་། འདི་ངེད་ཀྱི་མེས་པོའི་སྐྱེ་བའོ་ཞེས་དང་འདི་ཨ་ཁུའི་སྐྱེ་བའོ་འདི་ཨ་ཞང་གི་སྐྱེ་བའོ་ཞེས་སྒྲོགས་ཤིང་བྱིས་པ་སྭོ་མ་རྫོགས་པ་ནས་དཀོར་ལ་རྐང་རྫོངས་སུ་བཅོས་ཤིང་ནམ་ཞིག་ནར་སོན་ནའང་། རང་ཡང་དེ་ཀ་ཡིན་རྒྱུའི་ཁུལ་གྱིས་མི་ཚེ་སྟོང་ཟད་དུ་སོང་བ་དེ་རང་གིས་ནི་མ་མནོས། གཞན་རྐྱེན་དགེ་བའི་བཤེས་གཉེན་མཚན་ལྡན་གྱིས་ནི་མ་ཟིན། རིམ་གཉིས་དགེ་སྦྱོར་ནི་མ་ནུས། དམ་ཚིག་རྒྱུ་འབྲས་ཀྱི་སྤང་བླངས་ནི་གུ་ཡང་སེ་བ་ཞིག་ལ། ཧམ་པ་ཕོ་བཟོ་མཐོ་ཙམ་ཞིག་བྱས་ཤིང་། འཇིག་རྟེན་ཆོས་བརྒྱད་ཀྱི་གོ་ཆ་སྲ་བརྟན་རེ་བགོས་ནས་གཤིན་དཀོར་གསོན་གླུད་ལ་ལོངས་སྤྱད་དེ་མཐར་སྐྱེ་བ་སྔ་མའི་དགེ་འབྲས་ཅི་རིགས་པ་ཚེ་འདིར་རྫོགས་པས་ཐར་པའི་དཔྱང་ཐག་ཆད་ནས་འཁོར་བ་མཐའ་མེད་ཀྱི་གཡང་སར་ལྷུང་ཚབས་ཆེན་པོར་སྤྱོད་པ་ལ་ཨ་ཙ་མ་ཡ་རེ་ང་། དེ་ཕྱིར་བདག་ནི་སྐྱེ་བ་འདི་ནས་བཟུང་བླ་མེད་ཡང་དག་འཕགས་པའི་ས་མཆོག་དམ་པ་མ་ཐོབ་བར་དུ་སྐྱེ་བར་མིང་བཏགས་ནས་རང་དོན་ཚགས་སུ་མ་ཚུད་བཞིན་རྣམ་གཡེང་འཁོར་བའི་ལས་ལ་སྤྱོད་པ་འདི་ལྟ་བུར་གཏན་ནས་མ་གྱུར་ཅིག དེ་ནས་དཀྱུས་སུ་འཇུག་པར་བྱ་སྟེ། རི་བཀྲ་གནས་ནང་དུ་སྡོད་པའི་ལོ་དེའི་དབྱར་དུས་དེར་ཀཿཐོག་རྒྱལ་སྲས་བསོད་ནམས་ལྡེའུ་བཙན་དང་མཇལ་ནས་དབང་བཀའ་ལྗགས་ལུང་མང་དུ་ནོས་ནས་བྱིན་རླབས་ཀྱི་རྒྱུ་ཁྱད་པར་ཞིག་ནི་གྱུར་འདུག སྟོན་ཁ་ཤར་ཙམ་ནས་གདན་དྲུང་རྗེ་དབོན་རིན་པོ་ཆེར་བཀའི་ཁྲོལ་ཆ་ཞུས་ནས་བླ་མ་ཀུན་འདུས་ཀྱི་ངོ་བོ་རྡོ་རྗེ་འཆང་བདེ་བ་ཆེན་པོའི་ཞབས་པད་བསྙེན་པར་ལྕི་རོང་གི་དབེན་པར་སོང་སྟེ། དེ་ཡང་གདན་ས་ནས་ཚུར་འོང་སྐབས་སུ་ད་ལམ་ཆོས་གཤའ་མ་ཞིག་ཅིས་ཀྱང་བྱེད་དགོས་ལ། ལྷག་ཏུ་རང་གཞན་གྱི་དོན་གཉིས་ཕུན་སུམ་ཚོགས་པའི་གཞི་རྩ་ཡང་དག་པ་ནི་ལྟ་སྒོམ་རྟོགས་པའི་གདེང་དང་ལྡན་དགོས་ངེས་སུ་འདུག་པས། དེ་སྟོན་པར་བྱེད་པ་རྩ་བའི་བླ་མ་མཚན་ཉིད་ལྡན་པ་ལ་རག་ལས་པས། རྩ་བའི་བླ་མ་ནི་འདི་ལྟ་བུ་ཆེས་ཆེར་མཇལ་དཀའ་བ་ནི་ཨུ་དུམ་ཝ་རའི་མེ་ཏོག་ལས་ཀྱང་དཀོན་ཞིང་། གདུལ་བྱ་བསོད་ནམས་དམན་པས་ཡུན་དུ་བཞུགས་པར་ཡང་ཁ་ཚོན་མི་ཆོད་ཀྱི། ད་ལྟའི་སྐབས་བསྒོམ་པ་ལ་བརྩོན་འགྲུས་ཉིན་མཚན་ཁ་སྦྱོར་དུ་བྱས་དགོས་སོ་ཞེས་བློར་བཏགས་ཏེ་འོང་ན་ཡང་། རང་གནས་སུ་སླེབས་སྐབས་རང་གི་རང་ལ་དཔའ་གདེངས་ཐེར་ཚུགས་ཀྱི་བསྒོམ་བསྒྲུབ་བྱེད་པའི་བློ་བརྟན་གླིང་ནི་ན་ཚོད་བྱིས་པར་སོང་ཞིང་སྐལ་བ་དམན་པས་འགྱངས་། གཞན་རྐྱེན་གྲོགས་ནི་བསྒོམ་བསྒྲུབ་བྱེད་དགོས་ཚུལ་གྱི་གཅུན་ཐག་བླང་མཁན་སུ་ཡང་མེད། དེས་ན་ཆོས་གཤའ་མ་ཞིག་བྱེད་པའི་བློ་བཞི་ཡོད་ཀྱང་ལག་ཐོག་འགེལ་ནུས་པའི་མཐུ་མ་ཐོབ་པར་བསྒྲུབ་པ་ཡང་དག་ཅིག་སང་བགྱིད་དོ་གནངས་བགྱིད་དོ་སྙམ་པའི་ངང་ལ་བྱས་པ་དོན་མེད་ཀྱི་རོ་སྲེགས་འཕོ་འདེབས་དབང་བསྐུར་གྱི་བྱ་བས་སངས་མེད་བདུད་ཀྱི་ཕྱེ་གཏོར་ལ་གཡེངས་ཏེ་ལོ་གཅིག་གཉིས་ངང་དུ་རྫོགས་ནས་རྒྱལ་བ་དགྱེས་ཤིང་འགྲོ་དོན་ནུས་པའི་གཞི་རྩ་རང་དོན་ཚགས་སུ་ཚུད་པའི་བསྒོམ་བསྒྲུབ་ཀྱི་བླ་མའི་དགོངས་པ་མཉེས་པ་ཅིག་བྱེད་བསམ་པའི་ངང་དུ་མ་འགྲུབ་པ་འདི་ནི་ད་ལྟ་འགྱོད་པ་ཆེ་བ་ལས་ཀྱང་ཆེས་ཆེ་བས་མཆི་མ་འཁྲུག་ཅིང་ཀྱེ་མ་ཀྱེ་ཧུད་ཅེས་སྨྲེང་བ་ལགས་སོ། །<br>ཀྱེ་མ་དལ་འབྱོར་ཐོབ་པ་དོན་ལྡན་བསྒྲུབ་བསམ་ཀྱང་། །བདུད་ཀྱི་བྱིན་གྱིས་ཕྱི་བཤོལ་དུས་ཀྱིས་འགྱངས་། །མི་ཚེ་མདོ་ཤོར་དོན་མེད་ངང་དུ་འཁྱམས། །བསམ་ཞིང་སྙིང་རླུང་དེ་ལ་ཅིས་མི་ལྡང་། །དེས་ན་བསྒོམ་བསྒྲུབ་ཕྱི་བཤོལ་མ་ཤོར་བར། །ཆེ་བཞག་ཆུང་བཤོལ་གནམ་ས་གོ་བཟློག་ཀྱང་། །རང་ཐག་རང་གཅད་ཕ་མ་གཉེན་ཚན་དང་། །གྲོགས་འཁོར་དབང་དུ་ནམ་ཡང་མི་གཏོང་བར། །རྩེ་གཅིག་དབེན་པར་ངེས་དོན་སྙིང་པོ་ལ། །ལེ་ལོ་མེད་པར་བསྒོམ་བསྒྲུབ་ནན་ཏན་བརྩོན། །ཆོས་ཀྱི་སྲོག་ཤིང་བླ་མའི་དམ་ཚིག་སྟེ། །རང་སྲོག་ཆད་སླ་དེ་ཉིད་མི་ཉམས་བསྲུང་། །</p><p class=\"tibetan-text\">ད་དུང་སྐབས་ཀྱི་འཕྲོས་སུ་བརྗོད་ན།<br>དེ་ལྟར་བསྒོམ་སྒྲུབ་ཀྱི་བསམ་པ་སྐྱེས་ཕྱིན་རང་ཉིད་ན་ཚོད་རྒན་རུང་གཞོན་རུང་ལྷག་བསམ་སྐྱེས་ཤིང་ཆོས་པའི་གྲལ་དུ་ཚུད་པ་ཡིན་པས་དེ་ལས་བློ་གཞན་དུ་འགྱུར་བ་མེད་པའི་ཞེ་གདེངས་འཆའ་སྟེ་དེ་ལ་གཞན་རྐྱེན་སྟེང་ནས་རི་ཉིལ་འོག་ནས་མཚོ་རྡོལ་ཀྱང་རང་གི་ལྷག་བསམ་དེ་ཁོ་ནར་ཐེར་བཙུགས་ཏེ་དེ་ལ་ཕ་མ་གཉེན་ཚན་གྲོགས་འཁོར་གང་གི་དབང་དུ་མི་གཏོང་བར་རབ་མི་ཚེ་སྒྲུབ་པར་བསྐྱལ་བ། འབྲིང་བཅུ་གཉིས་ལོ་སྐོར། ཐ་མ་ཡང་ལོ་སྐོར་ཕྱེད་དེ་དྲུག ཡང་མཐའ་ཡང་ལོ་གསུམ་ཕྱོགས་གསུམ་གྱིས་མཐའ་བརྟེན་པ་རེ་དམ་བཅས་ཤིང་། རང་ཉིད་འཆི་ཡང་མཚམས་ཁང་དུ་འཆི་ནུས་པ། ན་ཡང་མཚམས་ཁང་དུ་ན་ནུས་པ་སེམས་ལྷོང་སྡུག་བསྔལ་བློ་མི་བདེ་བ་ཅི་བྱུང་ཡང་ལམ་དུ་འཁྱེར་ཞིང་ཉིན་མཚན་ཐུན་དྲུག་ཏུ་བགོས་ནས་རིམ་གཉིས་ཀྱི་ཉམས་ལེན་ལ་ལྟེམ་རྐྱང་ལེ་ལོ་ཡུད་ཙམ་ཡང་མ་ཤོར་བ་བྱ་དགོས་ཀྱི་ཕྱི་མཚམས་བསྒྲུབ་ཀྱི་ཁུལ་ལ་ནང་རེ་ཉལ་རྐང་བརྐྱངས་གཉིད་དང་སེམས་རྣམ་རྟོག་གི་ཕྲེང་བ་བསྒྲང་ན་ཕྱི་བ་ཁུང་དུ་ཉལ་བའི་དཔེ་ཟླར་མ་ཡིན་པར་བསྒོམ་བསྒྲུབ་བྱས་པའི་རྗེས་ཡོད་ངེས་པ་རང་གི་ཡིད་རང་གིས་ཆེས་ཐག་ཆོད་ཅིག་བྱིས་པ་ཆུང་ངུ་ནས་བརྩོན་དགོས་པར་འདུག་གོ །<br>དེ་ལྟར་བསྒོམ་བསྒྲུབ་བྱ་དགོས་ཀྱི་ལྷག་བསམ་སྐྱེས་པ་ཙམ་ནས་བདུད་ཀྱི་བར་ཆད་བརྩམ་ཞིང་བསྒོམ་བསྒྲུབ་ལ་ཞུགས་པར་ཐག་ཆོད་ཚེ་ལྷག་པར་བར་དུ་གཅོད་ལ། དེ་ཡང་རང་གི་ཕ་མ་ལ་སོགས་གཉེན་དུ་བརྫུས་ནས་བཤོལ་འདེབས་པ་དང་། དེ་བཞིན་མཛའ་བའི་གྲོགས་དང་གྲྭ་འཁོར་སྦྱིན་བདག་ཞེན་ཡོད་ཡོད་པོ་དང་། རང་བཞིན་གྱི་བཏང་སྙོམས་གནས་པས་ཀྱང་ཞལ་ལྕེའི་ཚུལ་དུ་དང་། མཁན་པོ་སློབ་དཔོན་དང་ཁྲིམས་ཀྱི་ཞལ་ལྟ་བ་སོགས་གང་ལ་གང་འཚམས་སུ་བརྫུས་ནས་བསྒྲུབ་པ་བཤོལ་ཏེ། ད་ལྟ་ན་ཚོད་གཞོན་གྱི་བསྒྲུབ་པ་སླད་མར་བྱ་ལོང་ཡོད་ཞེས་པ་དང་། ལ་ལས་ད་རེས་གདུལ་བྱ་འཕྲིན་ལས་ཀྱི་མགོ་ཚུགས་ཚེ་རེ་ཞིག་དེ་སྐྱོང་གལ་ཆེ་ལ་མཐར་སྒྲུབ་པ་བྱེད་ཆོག་ཅེས་པ་དང་། ལ་ལས་ནི་ངེད་ཀྱི་ཤ་ཚའི་གྲོས་འདེབས་འདི་ལྟར་བྱེད་ཀྱང་མི་ཉན་པར་ཀྱེ་ཧུད་ཞེས་སྙིང་བརྩེ་བརྩེ་ཉམ་ཐག་ཁུལ་གྱིས་བསྲུང་བ་དང་། ལ་ལས་ནི་བསྒྲུབ་པ་ལ་ཞུགས་ན་ངེད་འཁྱམས་སམ་ལྕེབས་སམ་བྱེད་ཞེས་པ་དང་། ལ་ལས་ནི་ཁྱོད་བསྒྲུབ་པ་བྱེད་ན་ངེད་ཀྱི་འཚོ་བ་དང་གཡོག་ནི་བྱེད་མི་གཏུབ་ཀྱི་ཁྱོད་རང་ཅི་དགའ་ལ་རྒྱུགས་ཞེས་དང་། རེས་ནི་འདི་ལོ་བྱ་བ་ལ་གལ་ཆེན་ག་གེ་མོ་དང་ཆེ་གེ་མོ་འདི་རྣམས་གྲུབ་པར་གྱིས་ལ། སང་ནས་བསྒྲུབ་པ་ལ་ངེས་པར་ཞུགས་ཆོག་ཅེས་པ་སོགས་མདོར་ན་ཞི་བས་བློ་བྲིད་ཀྱི་བསླུ་བ། ཁྲོ་བས་བསྡིག་སྟེ་དྲག་པོ་བྱེད་པ། ཞི་ཁྲོས་གྲོས་འདེབས་སྣ་ཚོགས་པ་འོང་བས་མཐའ་དག་བརྗོད་ཀྱིས་མི་ལོང་སྟེ། དེ་ལྟར་ཆོས་ཀྱི་བཤོལ་འདེབས་དེ་ཀུན་ཀྱང་སྒྱུ་མ་ལྟ་བུར་ཤེས་ཤིང་མི་དགའ་ཁྲོ་བའི་རྣམ་པ་ཡང་མི་བྱེད་པར། དེ་དབང་དུ་མི་ཤོར་བའི་ཐབས་ལ་འབད་དགོས་ཏེ། དེ་ཡང་ཕ་མ་ལ་སོགས་ཀྱིས་བཤོལ་ཚེ། ངེད་རྨི་ལམ་ལྟ་ལོགས་ཤིང་མིག་ལྟས་ངན་པ་མང་དུ་མཐོང་བས་འདི་ལོ་བསྒྲུབ་མ་བྱུང་ན་ངེད་འཆི་ངེས་པར་ཡོད་པས་བརྩེ་བས་རེ་ཞིག་དགོངས་པ་གནང་མཛོད། སླད་མར་ཕ་མའི་ཅི་གསུང་བསྒྲུབ་ཞེས་ཐབས་མཁས་པོས་བྲིད་པ་སོགས་དགོངས་པ་ཁྲོལ་ཐབས་ལ་བརྩོན་པ་ཡིན་ཏེ། ཅི་ཕྱིར་ཕ་མ་ནི་ཚེ་འདིར་རང་ལ་བཀའ་དྲིན་ཆེས་ཆེ་ཞིང་ལུས་རྟེན་འདི་ཐོབ་པའི་རྒྱུ་ཡིན་པས་འཕགས་པ་རྣམས་དང་ཆ་མཚུངས་ཙམ་དུ་བསྙེན་ཞིང་བཀུར་བའི་ཡུལ་དུ་རྒྱལ་བས་གསུང་པས་ན་རབ་ཕ་མ་དགྱེས་བཞིན་པ་དང་། འབྲིང་མི་དགྱེས་མེད་པར་གནང་བ་ཐོབ་ཙམ་དང་། ཐ་མ་ཡང་རང་གི་ཆེད་དུ་ཕ་མའི་ལུས་སྲོག་ལ་བར་ཆད་མི་འགྱུར་ཞིང་གནང་བ་ཆ་ཤས་ཐོབ་པ་ཅིག་ཞི་བའི་སྒོ་ཐབས་དུ་མས་བྱ་དགོས་ལ། དེ་བས་གཞན་གྱུར་རྣམས་ལ་ཞི་བ་དང་དྲག་པོའི་སྒོ་དུ་མ་ནས་བསྒྲུབ་པ་བཤོལ་མེད་པར་ཁོ་ཐག་རང་གིས་བཅད་དགོས་པ་ཡིན། ཡང་བདུད་ཀྱི་བར་ཆད་ཚབ་ཆེ་བ་ལ་ནི་ཡུལ་ལ་དབང་བའི་རྒྱལ་པོ། ཞང་བློན་གཙོ་བོ་ལ་སོགས་པས་བཀག་པ་དང་། ལ་ལ་ནི་ཕ་རོལ་དགྲ་བོ་མང་དུ་ཡོང་ནས་དབང་མེད་ཆགས་སྡང་ལ་སྤྱོད་འཇུག་པ་རྣམས་ཏེ། དེ་དག་ནི་འཕྲལ་གཅོད་དུ་དཀའ་བས་འཁོན་འཛིན་ཡོད་པ་ལ་རང་ཕམ་ཁ་འཛིན་ཏེ་འཁོན་སངས། རྗེ་དཔོན་ལ་ཟང་ཟིང་དང་ཚིག་སྙན་དུ་མས་དགོངས་པ་ནན་གྱིས་དཀྲོལ་ལ། ཅིས་ཀྱང་རང་དབང་མི་འདུས་ན་སྤྲང་པོར་བརྫུས་ནས་གར་སོང་མེད་པར་གཞན་ཡུལ་དུ་ཕྱིན་ནས་བསྒོམ་བསྒྲུབ་ལ་འབད་པར་བྱ་དགོས་སོ། །ཡང་ལ་ལ་ནི་གནས་སྐབས་ཀྱི་བླ་མ་དང་། མཆེད་གྲོགས་དབང་ཆེ་བས་ཆོས་ཀྱི་ཕྱི་བཤོལ་བྱེད་པ་ཡང་དཀའ་བའི་གནས་ཡིན་པས་ཐབས་ལ་མཁས་པས་དེ་དབང་མ་སོང་བར་ཆོས་ཇི་བཞིན་སྤྱོད་པ་འཇུག་དགོས་པ་ཡིན། དེ་ལྟར་དཀའ་བ་དུ་མས་བསྒོམ་བསྒྲུབ་བྱེད་ཆོག་པའི་རང་དབང་བྱུང་ཚེ་བསྒྲུབ་པའི་ས་སྡེ་བཙུགས་ནས་རིམ་གཉིས་ལ་དྲོད་ཐོབ་པ་ཞིག་བྱེད་དགོས་ཀྱི། དེ་མ་བྱུང་ན་འདི་ཕྱི་གང་ལ་ཡང་བྱས་པ་དོན་མེད་དུ་སོང་བ་ཡིན་པས་སྙིང་ལ་རུས་པ་བཏོན་དགོས་པ་ཡིན་གལ་ཆེའོ་གལ་ཆེའོ། །<br>ཡང་གོང་གི་བླ་མ་མཁན་སློབ་མཆེད་གྲོགས་ཞེས་པའི་སྐབས་སུ་འདི་ལྟར་གོ་དགོས་ཏེ། རང་གི་ཆོས་འབྲེལ་མེད་ཀྱང་དགོན་སྡེ་གྲྭ་རིགས་ལ་དབང་བྱེད་པའི་དཔོན་པོ་ལྟ་བུར་སོང་བ་རྣམས་ཡིན་ལ་ཆོས་ཀྱི་འབྲེལ་པ་ཡོད་ཕྱིན་ཅི་མཛད་ལེགས་མཐོང་གི་དག་སྣང་ཁོ་ན་ལ་འབད་པར་གཅེས་ཤིང་རང་ཉིད་བསྒྲུབ་པ་ལ་བློ་གཞོལ་ན་ཡང་ཐབས་མཁས་ཀྱི་དམ་སེལ་མེད་པར་བྱེད་དགོས་པས་བཀའ་ཡི་གནང་བ་ཟུར་ཙམ་རེ་ཅིས་ཀྱང་ཅི་ཐོབ་བྱ། དེ་བས་རྡོ་རྗེ་སློབ་དཔོན་ཇི་ལྟ་བ་དབང་ཁྲིད་ལུང་གི་བཀའ་དྲིན་ཐོབ་པ་ནི་བླ་མ་དམ་པ་ཞེས་བྱ་སྟེ། དེ་ཉིད་མི་དགེས་བཞིན་བཀས་མ་གནང་ན་བསྒོམ་བསྒྲུབ་བསྐལ་པ་བརྒྱར་འབད་ཀྱང་ཡོན་ཏན་མི་འབྱུང་སྟེ་ཆུ་སྔོན་བསྲུབ་ནས་མར་ལེན་འདོད་པ་དང་འདྲ་ལ། དེ་ཉིད་དགེ་ན་མི་དགེ་བ་སྤྱད་ཀྱང་བྱང་ཆེན་ལམ་དུ་འགྲོ་བས། དེས་ན་དེ་ཉིད་དགྱེས་པའི་བྱ་བ་ཁོ་ན་ལ་འབད་པ་ལས་འོས་མེད་ཀྱི། དོན་ལ་ཡང་དཀའ་སྤྱད་སྡུག་བསྒུར་ལོ་བརྒྱ་ཕྲག་དུ་མ་བགྱིས་པ་ལས་ཀྱང་སྒོ་གསུམ་རྣམ་དག་གིས་བླ་མའི་ཞབས་ཏོག་ཅུང་ཟད་བགྱིས་པས་བསོད་ནམས་ཆེ་ངེས་ཡང་ཡིན་པས་འབད་པས་ཞབས་ཏོག་ཁོ་ན་བྱའོ། །དེ་ལྟར་དབྱེ་གསལ་མ་ཕྱེ་པར་མགོ་འཐོམ་ལོང་ན་བློ་འདོད་ལ་ཆོས་པ་བྱེད་སྙམ་ཞིག་ལ་རྡོ་རྗེ་དམྱལ་བའི་བཞུགས་གདན་ལ་འབྱར་དོགས་ཆེ་ལགས། དེ་ལྟ་བུའི་འཕྲོས་དོན་བརྗོད་ན་དཔག་ཏུ་མེད་པས་འདིར་ཡིག་ཚོགས་སུ་འགྱུར་གྱི་མི་སྨྲ་ལ་དེ་ཙམ་ནི་ངེད་རང་གི་མདོ་མེད་པའི་ཆ་མྱོང་མི་ཚེ་སྟོང་ཟད་དུ་ཤོར་བར་ཡིད་སྐྱོ་བྱུང་བས་གཞན་བདག་ལྟ་བུ་སྐུ་སྐྱེ་དང་དབོན་པོར་གྲགས་པ་རྣམས་ཀྱིས་དལ་འབྱོར་དོན་མེད་དུ་མ་སོང་བར་ཆུང་ངུ་ནས་བསྒོམ་བསྒྲུབ་ལ་རང་དབང་འདུས་པོར་སྤྱོད་ནས་འཆི་ཁར་མི་འཇིགས་པའི་གདེང་རེ་ཚུགས་དགོས་རྒྱུར་གདའ། ཞེས་གལ་ཆེན་དུ་གྲོས་འདེབས་པ་ཡིན་ནོ། །<br>མི་ཁོ་བོ་ནི་བྱིས་པའི་སྐབས་དུས་དེར། བློ་ལྷག་བསམ་གྱི་བསྒོམ་བསྒྲུབ་བྱེད་འདོད་ཀྱང་། རྐྱེན་བདུད་དབང་ནི་གྲོང་ཆོག་ཟ་ཐང་གི །བསྒོམ་བསྒྲུབ་བློ་དེ་ཡད་ཡུད་ངང་དུ་ཤོལ། །ད་འགྱོད་སེམས་གཅིག་སྙིང་ནས་སྐྱེ་ལགས་ཀྱང་། །དཔེ་བྱི་ལ་བྲོས་ཤོར་གྱི་ཁུང་འགེག་འདྲ། །དོན་དེ་ཕྱིར་དུ་ཕྱིས་འབྱུང་བདག་འདྲ་བ། །ཆོས་བསྒོམ་བསྒྲུབ་ལ་ཆུང་ནས་ཧུར་ཐག་འཚལ། །དེ་ལྟར་གྲོང་ཆོག་གི་ཟ་ཐང་ཡད་ཡུད་ལ་བརྟེན་ནས་རི་དྭགས་རྨས་མ་ལྟར་བགྱིད་བློ་ཡོད་པ་དེ་ལྟར་བྱེད་དུ་མ་བྱུང་མོད། འོན་ཀྱང་དམ་པ་ཞལ་བཞུགས་རིང་ལོ་ཁ་ཤས་དེར་ཟབ་པ་ལས་ཀྱང་ཆེས་ཆེར་ཟབ་པའི་གདམས་ངག་བཟུང་ན་འདྲིལ་བ་སྤྲོས་ན་རྒྱ་ཆེ་བ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་དགོངས་པའི་ཡེ་ཤེས་བསྒྲུབ་པར་བྱེད་པའི་ལམ་གྱི་གཙོ་བོ་གཞི་འབྲས་དབྱེར་མེད་ཀྱི་ངོ་བོ་རང་རིག་རང་གསལ་རྗེན་པར་སྟོན་པའི་ཞལ་གདམས་ཀྱི་སྙིང་པོ་ཡང་དག་པར་འདོམ་པར་མཛད་པའི་བཀའ་དྲིན་ནི་ནམ་མཁའི་ཁམས་སུ་ཡང་ཤོང་བར་དཀའ་བ་ཉིད་དོ། །དེས་ན་བླ་མ་ཀུན་འདུས་ཀྱི་ངོ་བོ་རྩ་བའི་བླ་མ་ནི་འདི་ཉིད་དུ་ངེས་པ་རྙེད་ལགས། སངས་རྒྱས་བཅོམ་ལྡན་དཔལ་རྡོ་རྗེ་སེམས་དཔའ་དང་དབྱེར་མ་མཆིས་ཤིང་རང་ལ་བཀའ་དྲིན་ཆེ་བའི་སྒོ་ནས་ནི་སངས་རྒྱས་ལས་ཀྱང་ལྷག་པའོ། །སྤྱིར་ཡང་རང་ཉིད་སྐྱེས་ནས་ཞག་བདུན་ལོན་སྐབས་སུ་ཚེ་དཔག་མེད་པའི་དཀྱིལ་འཁོར་དུ་དབང་གིས་སྨིན་པར་མཛད་ཅིང་རྗེས་སུ་བཟུང་བ་ནས་མཐར་གནས་ལུགས་ཡེ་ཤེས་ཆ་ཙམ་པ་ལྷག་མཐོང་གི་ཉམས་མྱོང་རྒྱུད་ལ་སྐྱེས་ཀྱི་བར་དངོས་སུ་བཀའ་དྲིན་གྱིས་བསྐྱང་བ་དང་། རང་གི་ཚེ་འདིར་མཇལ་བའི་བླ་མ་མཐའ་དག་ལས་ཀྱང་ཕུལ་དུ་བྱུང་བའི་དད་མོས་གུས་པ་ནི་འདི་ཁོ་ནར་ཐོབ་པས་ཚེ་རབས་དུ་མའི་ཡོངས་འཛིན་དུ་སྙིང་ནས་ངེས་སོ། །དེ་ལྟ་ན་ཡང་བློ་མིག་མ་དག་པ་ཁ་ཅིག་གི་རྨོངས་ཞེན་ཕྱོགས་འཛིན་གྱི་དད་པ་ཡིན་ནམ་ཞེ་ན་མ་ཡིན་གྱི། བདག་གི་རྩ་བའི་བླ་མ་འདིའི་ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་པར་ཤེས་ནས་མི་ཕྱེད་པའི་དད་པ་ཤར་བ་ཡིན་གྱི། དེ་གང་ཞེ་ན་གཏེར་སྟོན་པའི་སྐྱེ་བ་སྔ་མ་ཞིག་གྲུབ་པར་བྱས་པ་ཡིན་ཞེས་པའི་མིང་རྐྱང་ཙམ་ལ་ཞེན་མ་དགོས་པར། སྐུ་ཚེ་འདིར་བསྒྲུབ་པའི་སྡེ་བཙུགས་ནས་རྡོ་རྗེ་ཐེག་པའི་ས་ལམ་མ་ལུས་པར་སྦྱངས་ཤིང་བསྒྲོད་པ་རྡོ་རྗེ་འཆང་གི་རྒྱལ་ཚབ་ཏུ་གྱུར་པའི་རྡོ་རྗེའི་གནས་ཏིང་ངེ་འཛིན་བྱེ་བ་ཕྲག་བརྒྱར་དབང་ཐོབ་པའི་གྲུབ་པ་ལས་ཀྱང་གྲུབ་མཆོག་འཁོར་ལོས་བསྒྱུར་བ། དེ་ལྟར་གྲུབ་པ་ཡིན་ཞེས་པའི་མཐའ་གཅིག་པུ་ལ་ཡང་བརྟེན་མ་དགོས་པར་ཚེ་འདིར་བསླབ་སྦྱང་གི་ཚུལ་ཆ་ཕྲ་མོ་ཡང་མ་བྱས་པར་སྔོན་གོམས་སྦྱངས་སྟོབས་ཀྱི་རང་བྱུང་གི་ཤེས་རབ་འགྲན་བྲལ་ཕུལ་དུ་བྱུང་བས་མདོ་རྒྱུད་ཀྱི་ཚིག་དོན་མ་ལུས་པ་མཁྱེན་ཞིང་རྟོགས་པས་ཆོས་སྒོ་ཟབ་དང་རྒྱ་ཆེ་བ་བརྟན་བརླིང་རྟོགས་པར་དཀའ་བའི་གནས་ཀུན་གསུང་ཚིག་རེ་རེས་བདེ་བླག་ཏུ་རྟོགས་པར་བྱེད་ཅིང་། དེ་ལྟའི་ཆོས་ཚུལ་བསྐལ་པ་རྒྱ་མཚོར་སྨྲ་ཡང་འཇིགས་པ་དང་ཞུམ་པ་ནམ་ཡང་མེད་པས་ན་མཁས་པའི་མཁས་པ་ཆེན་པོ་སྟེ། ཁྱད་པར་དུ་ཡང་བསྐྱེད་རྫོགས་རྫོགས་པ་ཆེན་པོའི་མན་ངག་ཆེས་ཕྲ་ཞིང་གསང་བའི་གནས་སུ་གྱུར་པ་རྣམས་འཆད་པ་ལ་ཀུན་བཟང་རྡོ་རྗེ་སེམས་དཔའ་དངོས་སུ་བྱོན་པ་ལྟ་བུ་ཞིག་ཡོད་ལ། མདོར་ན་མཐོང་ཐོས་དྲན་རེག་གི་གདུལ་བྱ་ཐམས་ཅད་བླ་མེད་བྱང་ཆེན་གྱི་སར་འདྲེན་པ་ལ་མཁས་པ་འཕྲིན་ལས་བཞིའི་བདག་ཉིད་ཅན་དམ་པ་ལས་ཀྱང་དམ་པའི་ཆོ་འཕྲུལ་དུ་མ་འཆང་བ་པོ་སྟེ། ངེས་པའི་དོན་ནི་རྫོགས་པའི་སངས་རྒྱས་ཉིད་ཡིན་པས་བློ་ར་ལས་བརྒལ་མོད་གདུལ་བྱར་གྱུར་པ་སོ་སྐྱེ་བློ་དམན་རྣམས་ཀྱི་སྣང་ངོར་མཐུན་གྲུབ་ཏུ་ཡང་དེ་འདྲ་ན་སྐལ་བཟང་རྣམས་ལ་དེ་བས་ཀྱང་སྨོས་ཅི་དགོས། དེ་ལྟའི་ཡོན་ཏན་ཁྱད་པར་ཅན་ཡོད་པར་ངེས་ཀྱང་མི་མཐོང་བའི་ལོག་རྟོགས་ཅན་གྱི་འགྲོ་བ་ནི་མིག་ནད་ཀྱི་དུང་སེར་པོར་སྣང་བ་བཞིན་ལས་ཀྱི་རྐྱེན་དུ་ཤེས་པར་བྱ་ཞིང་། སྐལ་བ་མི་ལྡན་པ་ལ་ཡེ་གསང་ཆེན་པོས་ཆོད་པར་རང་གིས་རང་ལ་ངོས་བཟུང་ཅིག རྫོགས་པའི་སངས་རྒྱས་ཁོང་འཇིག་རྟེན་བྱོན་ན་ཡང་། །རང་སྣང་མ་དག་པས་སྐྱོན་གྱིས་ཕུང་པོར་མཐོང་། །ཁ་ཟས་རོ་བརྒྱ་དང་ལྡན་པའི་བདུད་རྩི་ལ། །ལས་ངན་ཡི་དྭགས་ཀྱི་ཁྲོ་ཆུ་འཁོལ་མར་མཐོང་། །བདུད་རྩི་ཡི་སྐྱོན་མིན་རང་སྣང་སྐྱོན་ཡིན་པས། །སྔོན་བསགས་ལས་ངན་དུ་རང་མཚང་རང་ངོས་བཟུང་། །པད་འབྱུང་བཻ་རོ་ཡི་སྒྱུ་འཕྲུལ་རྒྱལ་བའི་དབང་། །བདེ་ཆེན་གླིང་པ་ལ་ཤིན་ཏུ་མོས་པར་རིགས། །དེས་ན་ཡང་དཀྱུས་སུ་འཇུག་སྟེ། ཁོ་བོ་རང་ལོ་བཅུ་དྲུག་གི་སྣེར་ཟིན་ལ་ཉེ་བ་མགོ་ཟླའི་གནམ་སྟོང་རྫོགས་རྒྱལ་ཟླའི་ཚེས་ཤར་བ་འོད་གསལ་དུས་ཁྱད་པར་བ་དེར་རྩ་བའི་བླ་མ་དམ་པ་དེ་ཉིད་ཞིང་འདིར་སྐུ་དངོས་ཀྱི་གདུལ་བྱར་གྱུར་པ་དེ་ཙམ་དུ་གཟིགས་ཤིང་། ཞིང་གཞན་དག་པའི་གདུལ་བྱར་རྗེས་སུ་དགོངས་ནས་གཟུགས་སྐུ་ཞལ་ཕྱག་གི་རྣམ་པ་དེ་ནང་གསལ་གཞོན་ནུ་བུམ་སྐུ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་སྦུབས་སུ་ཞུགས་ཏེ། དེ་ལྟ་ཡང་བདག་ལྟའི་སྐལ་དམན་ངོར་རྟག་ཞེན་བཟློག་ཕྱིར་དུ་བསྟན་པ་ལས། སྐལ་ལྡན་མཆོག་རྣམས་ཀྱི་བློ་ངོར་འཕོ་ཆེན་དྭངས་མ་རྡོ་རྗེའི་སྐུར་གཤེགས་པ་གོར་མ་ཆག་པས་གཤེགས་བཞུགས་མི་མངའ་མོད། འོན་ཀྱང་བདག་བློ་མ་དག་པས་རེ་ཞིག་སྐུའི་བཀོད་པ་མངོན་སུམ་མི་སྣང་བས་སྙིང་ཐིག་གས་པ་ལྟ་བུའི་སྡུག་བསྔལ་སྐྱེས་ཀྱང་ཐབས་མ་རྙེད་པས་གསོལ་བ་རྩེ་གཅིག་གདུང་ཤུགས་དྲག་པོས་བཏབ་པར་བྱའོ། །སྐབས་འདིའི་རྟོགས་བརྗོད་ཅུང་ཟད་རྒྱས་པར་བརྟག་འདོད་ན། སྐྱོ་ཤས་ཀྱི་གླུ་དབྱངས་སྣ་ཚོགས་པདྨའི་འཕྲེང་བ་ཞེས་པ་སྔར་བརྗོད་ཟིན་གྱི་དེར་བལྟའོ། །དེང་སང་རང་གི་རྩ་བའི་བླ་མ་གྲོངས་ཀྱང་སྡུག་བསྔལ་མེད་པར་གདོང་དཀར་འཛུམ་གྱི་ཉམས་བཅས་ཕོ་བཟོ་སྔར་ལས་ཆེ་ཙམ་བྱེད་པ་ཡང་འོང་འདུག་སྟེ་དེ་ནི་དམ་ཉམས་ཀྱི་གྲལ་དུ་འཁོད་པ་ལས་འོས་ཅི་ཡོད། རྣལ་འབྱོར་གྱི་དབང་ཕྱུག་རང་སེམས་ཆོས་ཀྱི་སྐུ་བླ་མའི་ཐུགས་དང་རོ་གཅིག་བརྙེས་པ་རྣམས་ཀྱང་གདུང་བའི་གླུ་བླངས་ཤིང་སྡུག་བསྔལ་གྱི་ཚུལ་སྟོན་ན་དེང་སང་གི་བྱ་བ་ཕལ་ཆེ་ནི་བཀའ་དྲིན་མ་དྲན་པའི་ཁྲེལ་མེད་པོ་ལས་གཞན་ཅི་ཞིག དེ་ཡང་གཙོ་བོ་ནི་བླ་མ་ཞལ་བཞུགས་དུས་ཉིད་དུ་དགྱེས་པའི་ཞབས་ཏོག་འབད་པ་ཉིད་ཡིན་མོད། དེ་འོག་ནི་བླ་མ་གཤེགས་པའི་དགོངས་རྫོགས་དགེ་བ་བྱེད་པ་ཉིད་ཚོགས་ཆེ་བས་བླ་མ་དྲན་པའི་གདུང་ཤུགས་ཀྱི་འབད་པ་ཡིན་ཏེ། ཕལ་དུ་སྣང་གསལ་བྱེ་བ་ཕྲག་བརྒྱ་དགེ་བར་བསྔོ་བ་ལས་བླ་མར་སྙིང་ནས་གདུང་ཤུགས་ཀྱི་དགོངས་རྫོགས་སུ་དམིགས་ནས་མར་མེ་གཅིག་ཕུལ་བས་ཕན་ཡོན་ཆེ་སྟེ། དེས་རིགས་བསྒྲེས་ནས་དགེ་བ་གཞན་ཀུན་ཀྱང་དེ་འདྲ་བས་བླ་མའི་དགོངས་རྫོགས་སུ་དམིགས་ནས་གདུང་ཤུགས་དྲག་པོས་དགེ་བ་ལ་འབད་པ་གལ་ཆེན་གྱི་གནས་སོ། །<br>དཔལ་ལྡན་བླ་མ་ཡི་ཐུགས་ནི་མཁའ་འདྲ་ཡང་། །རང་ཉིད་སྡིག་རྒྱུན་ཀུན་ཟད་ཕྱིར་སྡུག་བསྔལ་དང་། །ཚོགས་གཉིས་རྒྱ་ཆེན་པོར་འཕེལ་ཕྱིར་དགོངས་རྫོགས་སུ། །དགེ་ལས་ལ་ཆེས་ཆེར་འབད་འདི་གནད་ཆེན་ཡིན། །དེ་ནས་ལོ་དེའི་དཔྱིད་ལ་དབྱར་བཏགས་མཚམས་ཀྱི་ཁུལ་བྱས་ཀྱང་ནང་དགེ་སྦྱོར་ལ་ཧུར་བསྐྱེད་དུ་མ་བྱུང་བས་ཡི་དམ་གྱི་བསྙེན་བསྒྲུབ་འདི་གྲུབ་ཡང་མེད། རྫོགས་རིམ་ལ་གནད་དུ་དྲིལ་བ་ཡང་མེད་སོས་དལ་ཉལ་རྒྱུ་བྱུང་བ་ལས་དགོས་ནུས་གང་ཡང་མེད་དོ། །དེ་སྐབས་སུ་རྨི་ལམ་དང་འདྲེས་པའི་ཉམས་སྣང་ལྟ་བུར་རྩ་བའི་བླ་མ་དེ་ཉིད་ལན་མང་དུ་མཇལ་ཞིང་གདམས་པ་དང་རྗེས་སུ་གདམས་པ་བསྩལ་ནས་བྱང་ཆེན་སྙིང་པོའི་བར་དུ་རྗེས་སུ་བཟུང་བ་ཡང་ཞལ་གྱིས་བཞེས་འོན་ཀྱང་རང་ཉིད་ཨ་འཐས་ཀྱི་བློས་བཅིངས་པས་དངོས་སུ་མཇལ་དུ་མེད་པ་ཡི་ཡིད་སྐྱོ་བ་ནི་སངས་དུས་མེད་དོ། །ལོ་དེའི་དབྱར་སྟོན་མཚམས་སུ་གདན་དྲུང་རྗེ་དབོན་སྐལ་བཟང་ཞབས་ནས་འབོད་མཁན་སླེབ་པ་བཅས་གདན་སར་ཕྱིན་ཅིང་བླ་མའི་ཞབས་ཕྱིར་དཀྲིས། དུས་དེར་རང་གིས་རང་ལ་ཆོས་ཀྱི་བསྐུལ་འདེབས་ཀྱི་གླུ་ཡང་མང་དུ་བླངས་ལ། ལྷག་པར་གྲོས་འདེབས་དམ་བཅའ་བཅུ་གཉིས་པ་བྱས། སྤྱིར་རང་ཉིད་ཆུང་ངུའི་སྐབས་ནས་རྣ་བར་ཝང་ཝང་ཞེས་པའི་སྙན་ཅིང་སྐྱོ་བའི་སྒྲ་གཅིག་རྟག་ཏུ་ཡོང་ལ། ལྷག་པར་ལོ་དེ་སྐབས་སུ་ཆེར་སོང་ནས་བུད་མེད་དབྱངས་སྙན་པོ་ཡིས་གླུ་དབྱངས་པའི་ངག་རྟ་འདྲ་བ་ཞིག་ཇེ་གསལ་ཇེ་གསལ་སོང་སྟེ་ཚིག་ལ་ལ་ནི་སྐྱོར་དུ་ཡང་རུང་བ་དེ་ཐོས་པས་འཆི་བ་དབང་མེད་དུ་དྲན་ཅིང་བསྒོམ་བསྒྲུབ་མ་གྲུབ་པར་ཡིད་རབ་ཏུ་ངལ་ཞིང་ཚེ་འདི་སྣང་གི་བྱ་བ་ལ་འཇུག་སྙིང་མི་འདོད་པར་བཙན་ཐབས་སུ་བློ་ལོག་ནུས་པ་ཞིག་ལོ་དེ་ནས་བཟུང་ལོ་གསུམ་བཞི་ཙམ་གསལ་པོ་དང་ཐོ་རེ་བ་ལོ་ལྔ་དྲུག་བར་ཙམ་བྱུང་ལ། དེ་ནས་བར་སྐབས་ཤིག་ནས་ཇེ་ཡལ་དུ་སོང་མཐར་ལོ་ཁ་ཤས་ནས་མེད་སོང་། དུས་ཕྱིས་ས་བྱ་ལོ་ལ་སྔར་ལྟར་མི་གསལ་ཡང་ཝང་ཙམ་པ་རེ་བྱུང་ལ། ད་ལྟ་ཡང་སྐབས་སྐབས་ཡོང་འདུག དེ་དུས་ལྷ་འདྲེ་མོ་རྒྱུད་ཞིག་གནོད་པ་ཡིན་ནམ་སྙམ་ཡང་དེང་སང་བརྟག་ན་མི་དགེ་བ་ཞིག་མིན་པ་འདྲ། གང་ལྟར་འདིར་སྣང་ཞེན་པ་བཟློག་ཅིང་ཆོས་ལ་བསྐུལ་འདེབས་ནི་ཆེ་བ་རང་བྱུང་བས་བཀའ་དྲིན་ཆེའོ། །དེ་འདྲ་ཞིག་མ་བྱུང་ན་འདིར་སྣང་ལ་ཞེན་པ་ཆེན་པོ་ཞུགས་ནས་འཁོར་བར་འཁྱམས་ངེས་སུ་གདའ། ཚེ་རབས་དུ་མ་རུ་བསྒྲུབ་པ་ལྷག་པའི་ལྷ། །དཔལ་ལྡན་བླ་མ་ཡི་ངོ་བོ་ནཱ་དའི་སྐུ། །ཡེ་ཤེས་མཁའ་འགྲོ་ཡི་མགྲིན་ནས་གླུ་རུ་ཐོན། །སྐལ་ལྡན་ཐར་ལམ་དུ་འགུགས་འདི་མི་མཚར་རམ། །དེ་ནས་མྱོས་བྱེད་ཀྱི་ལོ་ཤར་ཙམ་སྐབས་གནས་ཆེན་རྡོ་རྗེ་ཁྲོ་ལོད་མཇལ་བར་ཕྱིན། ལོ་གཞོན་སྐབས་ད་ལྟའི་རྒས་འཆལ་ནི་མ་སླེབས་པས་དཀྱེལ་ཆེ་ཁུལ་ཞིག་ཡོད་གཤིས་ཟླ་བོ་ཚོས་ནི་གནས་སྐོར་ཡིན་བསམ་ལས་གཞན་མེད། ཡིན་པ་ནི་རྨི་ལམ་གྱི་ལྟས་ཤིག་ལ་བརྟེན་ནས་ཕྱིན་པ་ཡིན། དེ་སྐབས་ལྟས་དང་ཆོ་འཕྲུལ་ཅི་རིགས་བྱུང་བ་ནི་འདིར་སྨྲ་མ་དགོས། དེ་འཕྲོར་གདན་སར་འོང་བའི་ཞོར་ཉི་མ་ཕུག་གི་བྲག་ཅིག་ཀློག་པའི་གསེབ་ནས་ས་ཡི་རིལ་བུ་ཁ་དོག་དཀར་པོ་ཆེ་ཆུང་སྣ་ཚོགས་བདུན་ཅུ་ལྷག་ཙམ་གཅིག་བྱུང་། བདག་རང་ཆུང་ངུ་ནས་ཆོས་ཁོ་ནར་སྲེད་པ་ཆེས་པས་ཆོས་གཏེར་ཤོག་སེར་ནི་མི་འདུག་དམ་རྫས་ཡིན་རྒྱུའི་ཕྱག་རྟགས་ཨཿམའི་རི་མོ་ཡང་མི་སྣང་། དགོས་པ་ཅི་ཡོད་སྙམ་ནས་རྩིགས་ཀྱང་མ་བྱུང་ལ། ཕྱིས་དེ་ཀར་བདག་རྐྱེན་ཡང་མ་བྱས་པས་ཟག་སོང་། དེ་ཡང་དུས་དེར་བདག་བློ་ཆུང་བའི་སྐྱོན་ཏེ། དམ་རྫས་ཨཿམ་ཞེས་གཏེར་སྟོན་ཕལ་ཆེས་མཚོ་རྒྱལ་གྱི་མཐེབ་མཛུབ་ཀྱི་རི་མོར་བཟུང་ཡང་། ལ་ལ་ནི་དེ་ལྟ་ཡང་ཡིན་མོད། ཕལ་ཆེར་དམ་རྫས་ཉིད་ལ་རང་བྱུང་ཤར་བ་ཡིན་གྱི་དེས་ན་ཡིག་འབྲུའི་གཟུགས་མེད་པ་ཡང་མི་འགལ་ཞིང་། ཡིག་འབྲུ་ཆེ་ཆུང་སྣ་ཚོགས་འབྱུང་བ་ཡང་དོན་དེས་ཡིན། འོན་ཀྱང་རྫུན་ཟོག་གི་བསླད་པའི་ཐལ་བ་རུ་རེ་རྣམས་དང་མ་ནོར་བ་ནི་གལ་ཆེའོ། །ལོ་དེར་ཡིད་ལ་མ་བསམ་རང་ཤར་གྱི་ཚིག་ཐོལ་ཐོལ་དུ་མ་བྱུང་བ་ཐུགས་གཏེར་གྱི་ཁུལ་དུ་ཡི་གེར་བཀོད་པས་གུ་རུ་རཀྴ་ཐོད་ཕྲེང་གི་ཆོས་སྐོར་གླེགས་བམ་ཆེན་པོར་ལོང་ཙམ་གྲུབ་མཚམས་དགོས་མེད་ཅིག་སྙིང་ལ་ཤར་ནས་མེ་ལ་སྲེགས་པ་དེ་དུས་རྒྱུས་ཡོད་ཀྱི་གྲྭ་པ་ཡང་མང་། དེང་སང་ལ་ལ་ཞིག་ལ་ཡིད་ལ་ཚིག་དོན་ལེགས་སུ་ཆ་བ་དེ་འདྲ་ཞིག་རང་ཤར་དུ་བྱུང་ན་བར་ཆད་ཡིན་ཡང་སྤྱན་རས་བཙུམ་པ་འདྲ་སྟེ་ངེད་ནི་ཆུང་ངུའི་ནས་བླ་མའི་གསུང་ལ་ཡིད་ཆེས་མཁན་གཅིག་ལགས་པས་དེ་འདྲ་ཅི་དགའ་ལ་བོར་བ་ཡིན། ལར་འདི་འདྲ་བྱུང་བའི་རིགས་བླང་དོར་གྱི་གནས་ངོས་འཛིན་དཀའ་ཞིང་། དབྱེ་གསལ་བྱེད་ནུས་པོ་ཡང་དཀོན་མོད། འོན་ཀྱང་སངས་རྒྱས་པདྨ་འབྱུང་གནས་ཀྱི་ཞལ་ལུང་རིག་འཛིན་བརྒྱུད་ལྡན་བླ་མའི་གསུང་ངག་ལས་འབྱུང་བར་བརྟག་དགོས་མོད། འདིར་ནི་དོགས་བསླངས་ཙམ་ལས་ཡིག་ཚོགས་འབྱམས་ཀླས་ཀྱི་ངལ་བས་མ་སྨོས་ཤིང་གཞན་དུ་ཟུར་ཙམ་བརྗོད་པར་སྲིད་དོ། །ཁོ་བོ་ཅག་གི་འདི་དུས་ཀྱི་སྐབས་དེ་ནི་རྩ་རླུང་ཉམས་ཀྱི་ཆོ་འཕྲུལ་ཙམ་དུ་རྟོགས་ཤིང་། དེ་ལ་རེ་ཞིག་ཆེད་འཛིན་གྱི་བདག་གི་བྱར་མི་གཏུབ་ཅིང་། དེ་ལྟར་བགྱིས་ན་བདུད་ཀྱི་བར་ཆད་དབང་དུ་འགྱུར་བའི་ངེས་ཚིག་རང་ལ་ཐུན་མོང་མ་ཡིན་པ་ཡོད་མོད་ཀྱང་འདིར་གསལ་བར་སྨྲ་ནི་མི་བཏུབ་པ་ཞིག་གོ །སྤྱིར་འདི་འདྲ་ཡོང་སྐབས་མི་ཆོས་ཀྱི་བར་ཆད་ནི་ཡོང་ཉེན་ཆེན་པོ་འདུག་སྟེ་ཁོ་བོ་ཡང་ལོ་བཅུ་གསུམ་སྣེ་ཟིན་ཙམ་གྱི་བྱིས་པའི་དུས་དེར་བློ་ལ་མ་བསམ་པར་རང་རྡོལ་གྱི་ཆོས་ཚིག་དེ་འདྲ་ཤར་བར་དགོངས་གཏེར་ཡིན་ཁུངས་བཅུག་ནས་དེ་ཞོར་ལ་བར་ཆད་ཚབ་ཤིན་ཏུ་ཆེ་བ་ཞིག་ཀྱང་ཞུགས་ཉེ་བར་བྱུང་བ་ཡིན། དེ་གང་ཞེ་ན་དགོངས་གཏེར་ལ་ཐུགས་དགྱེས་ཚོར་སག་གེ་བ་དེའི་ཁོངས་ནས་མི་ཆོས་རྫུན་མང་ཞིག་ཐོན་དུ་ཆ་བ་བྱུང་བས་སོ། །དེ་ཡང་ཅི་འདྲ་བྱུང་ཞེ་ན་རྣམ་རྟོག་ཧྲག་པོས་ཤར་བའི་གསལ་སྣང་ཕྱོགས་མཐུན་པའི་ལྷ་སྐུར་སྣང་བ་དང་། དེས་གསུང་བར་སྙམ་པའི་རྣམ་རྟོག་རང་ཤར་གྱི་ཚིག་དེ་འདྲ་ལ་ལྷ་མཐོང་ངོ་ཆོས་གསུངས་སོ་ཞེས་པའི་སྒྲོ་བཏགས་པས་སོ། །དེའི་ཅིར་འགྱུར་ཞེ་ན་མི་ཆོས་བླ་མའི་རྫུན་དུ་གྱུར་ནས་མནར་མེད་དམྱལ་བར་བསྐལ་པ་དུ་མར་གནས་པའི་ལས་སུ་འགྲོ་བས་བར་ཆད་ཚབ་ཤིན་ཏུ་ཆེ་བ་ཞུགས་སུ་ཉེ་བ་བྱུང་ཞེས་པ་དེ་ལ་ཟེར་བ་ལགས། དེས་ན་རང་དང་རིགས་སྐལ་མཐུན་པ་རྣམས་ཀྱིས་དེ་འདྲར་དོགས་ཟོན་འཚལ་ཞེས་སྙིང་གྲོས་སུ་སྨྲ་བ་ཡིན། ངེད་རང་ལ་འཆར་སྒོ་སྣ་ཚོགས་བྱུང་བ་དེ་ལྟར་ཡང་། སྐྱེ་བ་སྔ་མའི་བསག་སྦྱངས་བསོད་ནམས་ཀྱི་མཐུ་ཡིས་རྩ་བའི་བླ་མ་དམ་པ་རྣམས་དང་མཇལ་ནས། སྐྱེ་བ་དུ་མར་རྒྱུ་འབྲས་ལ་ཡིད་ཆེས་བྱས་པའི་བག་ཆགས་ཅུང་ཟད་སད་ནས། མི་ཚེ་འདི་ཡུན་རིང་ཞིག་མེད་ཅིང་མི་གནས་པར་ཡང་མཐོང་། དེ་ལ་ཞེན་རྒྱུ་མེད་པར་ཡང་གོ །གང་ཤར་བཟང་ངན་ཀུན་སྒྱུ་མ་ལྟར་ལམ་དུ་འཁྱེར་ཚུལ་ཡང་ཐོས་པས། ལས་དང་རྟེན་འབྲེལ་གྱི་འཆར་ཆ་དེ་ཀུན་ལ་ཡང་ཞེན་མྱོང་ཆེན་པོ་མི་བྱེད་པའི་ཁུལ་ཅིག་ཡིན་པས། ཟག་ཟོག་ལོག་ལས་བདུད་ཀྱི་དོང་དུ་མ་ཕྱིན་པས་དེ་ངོས་ནས་དལ་འབྱོར་དོན་མེད་མ་སོང་བ་ཙམ་པར་རློམ་མོ། །ཚེ་རབས་གཏན་གྱི་སྐྱབས་གཅིག་ནི་འཕུར་འགྲོའི་བླ་མ། །བདུད་འདུལ་དཔའ་བོ་རུ་སྐུར་བསྟན་ཆེ་མཆོག་ཁྲོ་ལོད། །བྱིན་རླབས་ནུས་པ་ཡི་ཟེར་བརྒྱ་ཕྱོགས་བཅུར་འཕྲོ་ཚེ། །བདུད་ཚོགས་མུན་པ་ཀུན་ཕྱེ་མར་འཐག་པས་རྨད་དོ། །དྲན་མཆོག་བླ་མ་དེ་པདྨ་བདེ་ཆེན་གླིང་པ། །ཡང་དག་ངོ་བོ་ལ་ཀུན་བཟང་རྡོ་རྗེ་སེམས་སོ། །མགོན་ཁྱོད་བྱིན་རླབས་དེ་སྙིང་ལ་ཅུང་ཟད་ཞུགས་མཐུས། །ཅི་བྱས་བདེ་བའི་ཡེ་ཤེས་ཆ་ཤས་དེ་རྟོགས་པས། །གང་ཤར་འགའ་ཡང་སྒྱུ་མ་ལྟར་བདེན་འཛིན་གྲོལ་སོང་། །རྟེན་འབྲེལ་རོལ་པ་ཆ་ཤས་ལ་འཕྲིག་ཀྱང་ཚུད་སོང་། །བཟང་བཟང་པོར་འདོད་པའི་རྫུན་བག་དེ་རང་སར་ཞིག་པས། །དལ་འབྱོར་དོན་ལྡན་དེ་མིན་ཡང་དོན་མེད་མ་སོང་། །ད་དུང་འཕྲོས་དོན་དོགས་སློང་ཙམ་སྨྲ་ན། སྤྱིར་བསོད་ནམས་དམན་པ་རྣམས་མི་ཆོས་ཀྱི་བར་ཆད་འཇུག་པའི་སྒོ་མང་ཡང་ཕལ་ཆེ་བ་ཞིག་ནི། སྐྱེས་བུ་དམ་པ་རྣམས་ཀྱི་རྟོགས་བརྗོད་ངོ་མཚར་ཅན་མཐོང་བའམ་ཐོས་པས་རྐྱེན་བྱས། རང་ལ་ཡང་དེ་འདྲ་ཡོང་བའི་བརྐམ་ཆགས་སྐྱེས་པ་དང་ཡང་ཁ་ཅིག་ནི་ལོ་ཟླ་ཁ་ཤས་རེ་བསྒྲུབ་ཚུགས་བཟུང་བས་ཡུས་ཏེ་ཐུན་མོང་ལྟར་སྣང་གི་གྲུབ་རྟགས་ལ་བསྐམ་པ་དང་། ཁ་ཅིག་བསྒྲུབ་པ་ཡེ་རྒྱབ་མ་དགོས་པར་སྔོན་སྦྱངས་སྐྱེས་བུ་མཆོག་ལ་བྱུང་བ་ལྟར་གྲུབ་རྟགས་འབྱུང་འདོད་པ་དང་། ཁ་ཅིག་ནི་ཐོག་མར་རྨི་ལམ་དངོས་ཉམས་སུ་བཟང་བཟང་འདྲ་རུང་གི་ལྟས་ཐན་ཐུན་བྱུང་བར་ཕྱོགས་འཛིན་རློམ་ཞེན་དྲག་པོ་ཞུགས་ཤིང་དེ་གཞན་ལ་ངོམ་ངོམ་བྱེད་ཅིང་མཐར་གང་ཡང་མི་ཡོང་ཚེ་རེ་དོགས་ཀྱི་ཡིད་སྨོན་མང་པོ་བཏང་བ་དང་། ལ་ལ་ནི་མཆེད་གྲོགས་གྲྭ་རིགས་གཉེན་ཚན་སྦྱིན་བདག་འདྲ་རང་ལ་དད་གུས་ཡོད་ཁུལ་ཚོས་ཉིད་ཅག་ག་གེ་ཆེ་གེ་མོས་ལུང་བསྟན་བཟང་པོ་བྱས་པ་ཡིན་ཞེས་པའམ། གྲུབ་པའམ་གཏེར་སྟོན་ནམ་དམ་པ་ཁྱད་པར་བའི་སྐྱེ་བར་གྲགས་པས་གྲུབ་པའི་གནས་ཚུལ་ལྐོག་གྱུར་བ་ཡོད་པས་གསུང་བར་ཞུ་ཞེས་བསྐུལ་བས་རང་ཡང་དེ་ལྟ་ལ་བློ་འདོད་དྲག་པོ་ལྡང་ཞིང་རང་མཐོང་བཅས་པ་དང་། ཁ་ཅིག་ནི་རང་དང་འགྲན་ཟླར་འོས་པ་ཞིག་ལ་ངོ་མཚར་བྱུང་གཏམ་ཐོས་པས་དེ་ལ་ཕྲག་དོག་གི་རང་ལ་ཡོན་ཏན་ཡོད་རྫུ་འདོད་པ་དང་། ཡང་ཁ་ཅིག་རང་ཉིད་གཞན་དང་མི་མཉམ་ལྷག་པའི་བློ་འདོད་དམ་རང་ཉིད་དམན་པའི་ར་བ་ལས་ཐར་ཏེ་ཚེ་འདིར་ཁ་རྗེ་ཟ་ཐང་ཆེ་རུ་རེ་བ་སོགས་ཏེ་མདོར་ན་ལྷ་མཇལ་ལུང་བསྟན་ཐོས། མངོན་ཤེས་ཤར། ཐུན་མོང་གི་གྲུབ་རྟགས། མངོན་གྱུར་བ་ལྟ་བུ་ཞིག་འདོད་པའི་བརྐམ་ཆགས་དུང་དུང་པས་ཡིད་ཀུན་ཏུ་སྤྱོད་པར་བྱེད་པ་དེ་བྱུང་ཕྱིན་ཆད་བར་ཆད་བདུད་ཀྱི་འཇུག་སྒོ་ཆེས་ཆེ་བ་དེ་དོད་ཚར་བ་ཡིན་པས། དེ་ངོས་ཟིན་པར་བྱས་ཤིང་ཆོས་ཐམས་ཅད་སྒྱུ་མར་ཤེས་པས་རྟགས་མཚན་ལ་རེ་དོགས་མི་བྱེད། ཚེ་འདི་ཡུན་རིང་མི་གནས་མྱུར་དུ་འཇིག་པ་རྨི་ལམ་སད་ཁ་ལྟ་བུར་ཤེས་ནས་ཞེན་པ་མི་བྱེད། དེང་དུས་ཡིད་བདེ་སྐྱིད་ཕུན་སུམ་ཚོགས་པ་བྱུང་བ་རྣམས་སྐྱེ་བ་སྔ་མ་དགེ་བའི་བསོད་ནམས་བསགས་པ་ལས་ཡིན་ལ། ཡིད་ལ་མི་འདོད་པ་འབྱུང་བ་རྣམས་ཀྱང་ལས་ངན་གྱི་འབྲས་བུ་ལས་བྱུང་བས་དགེ་སྡིག་ལ་ཡིད་ཆེས་ཡང་དག་པ་སྐྱེས་ནས་འདོར་ལེན་ངེས་པར་བྱེད་པའི་ཡིད་གདེངས་སུ་འཆའ་བས་བདུད་ཀྱི་བར་ཆད་འཇུག་པ་ལས་གྲོལ་ཏེ་བྱང་ཆུབ་ལམ་ལ་འཇུག་པར་འགྱུར་རོ། །དེ་ལྟ་མ་ཡིན་པར་ཚེ་འདིའི་གནས་སྐབས་ཀྱི་བདེན་ཞེན་ལ་བློ་བརྟས་ཏེ། གཞི་ཅུང་ཟད་ཡོད་པ་ལ་སྒྲོ་བཏགས་ནས་བཟང་རྫུའི་ཚིག་རང་འདོད་དབང་གིས་སྨྲ་བ་ནི་བར་ཆད་ཆོས་མིན་ཞུགས་པའི་རྨང་གཞི་བཏང་ཚར་བ་ཡིན། གཞི་མེད་པར་ལྷ་དང་མཇལ་ཞིང་ལུང་བསྟན་མངོན་ཤེས་གྲུབ་རྟགས་གཏེར་ཁ་སོགས་མེད་པ་ལ་ཡོད་པར་ཐབས་སུ་རྫུ་བཏང་བ་ནི་བདུད་ཀྱི་བར་དུ་གཅོད་ཟིན་ནས་ལས་ཀྱང་གྲུབ་པ་སྟེ། མནར་མེད་དམྱལ་བར་བསྐལ་ཆེན་དུ་མར་བཞུགས་གྲབ་ཀྱི་འབྱོན་ཆོག་མ་དེ་ཡིན། དེ་ལྟར་མི་ཆོས་ཀྱི་གཞན་བསླུས་ནས་རང་ཉིད་ཕུང་ཚབ་ཆེན་པོ་ལ་སྦྱོར་བའི་སྙིང་རུལ་པོ་ནི་སྔར་ཡང་དུ་མ་བྱུང་སྐད་ལ། ད་ལྟ་ཡང་མཐོང་ཐོས་ཀྱི་གནས་སུ་ཆེས་མང་མོད། མ་འོངས་ན་ཡང་དུས་དབང་གིས་མང་དུ་ཀ་འགྲོ་ཉེན་གདའ། དེ་དག་བྱེད་པའི་རྒྱུ་ནི་འདི་སྣང་ལ་ཞེན། རྒྱུ་འབྲས་མ་ཤེས་འཁོར་བའི་ཉེས་དམིགས་མ་ཐོས་པས་ལན་ཏེ། དེ་ཡང་སྐྱེ་བ་སྔ་མའི་བསགས་པ་བསོད་ནམས་དམན་པས་གྲོགས་ངན་རྐྱེན་གྱིས་འབྱུང་བ་ཡིན་ནོ། །ལས་དེ་ལྟར་སྤྱད་པ་རྣམས་ཀྱང་འདུལ་བ་ཡི་རབ་བྱུང་ཡན་ཆད་ལ་རྩ་བའི་ཕམ་པ་བཞི་སྟེ་མི་ཆོས་ཀྱི་རྫུན་ཚིག་གཞི་བསམ་སྦྱོར་བ་མཐར་ཐུག་ཚང་ཕྱིན་སླར་བཤགས་སྡོམ་སོགས་ཀྱི་གསོ་མི་གཏུབ་པ་རྫ་བེའུ་ཆགས་པ་དང་འདྲ་བར་ལུས་རྟེན་དེའི་ཐར་པའི་དཔྱང་ཐག་ཆད་པ་ཡིན་པར་བཤད་རུང་། ཐེག་ཆེན་ཐུན་མོང་དང་ཐུན་མོང་མ་ཡིན་པ་ལྟར་ན། ལས་བསགས་པ་དེ་དག་ལ་དྲན་པས་རྗེས་སླེབས་ཀྱི་སྦ་གསང་མེད་པར་སྟོབས་བཞི་ཚང་བ་བཤགས་སྡོམ་དྲག་པོར་རྟག་ཏུ་འབད་ན་སྒྲིབ་པ་དག་རྒྱུ་ཡོད་པར་བཤད་མོད་དེ། དེ་འདྲ་བྱེད་མཁན་ནི་དཀའ། འགྱོད་པ་ཁོང་པར་ཅུང་ཟད་སྐྱེ་སྲིད་ཀྱང་ངེད་ལ་སྐྱོན་འདི་བྱུང་ཞེས་རང་མཚང་ངོས་ལོང་མཁན་ནི་ཤིན་ཏུ་དཀོན། ལས་ཆེན་པོ་རྣམས་ལ་དེ་ལྟར་མ་བྱས་ཕྱིན་སྡིག་པ་འདག་པར་ཡང་དཀའ། སྔར་བྱས་པ་དེ་བཤགས་རུང་ཕྱིས་སྤྱད་ན་སླར་ཡང་ཉེས་པ་སྔ་མ་ཡང་ལྡོག་ནས་ཆེ་རུ་འགྲོ། དེས་ན་སྔར་ལས་ལ་ངོ་ཚ་བ་དང་ཕྱིས་མི་སྤྱོད་སྡོམ་པའི་ཆེད་དུ་ཉེས་བྱས་མིང་ནས་ཐོས་ཏེ་བཤགས་པ་གལ་ཆེ་སྟེ། སྡིག་བཤགས་ཐམས་ཅད་ལ་འདྲ། ལར་ཟག་ཟོག་ཚབ་ཆེན་སྤྱད་མཁན་རྣམས་ཀྱིས་སྟོབས་བཞི་ཚང་བའི་བཤགས་པ་བྱེད་པ་དཀའ། དེ་མ་བྱུང་ཕྱིན་མནར་མེད་དུ་འབྱོན་ཆོག་མ་ཡིན། སྔར་རིག་འཛིན་ཆེན་པོ་རོལ་པའི་རྡོ་རྗེའི་སྤྱན་སྔར་གཏེར་སྟོན་དུ་རྫུ་བ་ཞིག་གི་རང་མཚང་ངོས་ལེན་གྱི་བཤགས་སྡོམ་བྱེད་པར་ཐོས་པས་རྗེས་སུ་ཡི་རང་། གཞན་ཟོག་བྱེད་པ་མང་དུ་མཐོང་ཐོས་ཡང་སྟོབས་བཞིའི་བཤགས་སྡོམ་བྱེད་སྐད་རང་ནི་མ་ཐོས་པས་ཡིད་སྐྱོའོ། །དེས་ན་གཞན་ཕལ་གྱིས་ནི་གང་ཟག་གི་ཚོད་གང་ཟག་གིས་བཟུང་བར་དཀའ་ཡང་། རང་ལ་བྱ་བ་ལྐོག་གྱུར་ཅི་འདུག་ནི་རང་གིས་རྟོགས་པར་ནུས་པས་མི་ཆོས་ཟག་ཟོག་གི་བྱ་བ་འདྲེས་པ་ཚོ་རང་སྣ་ལ་རང་གི་མཛུབ་མོ་བཙུགས་ནས་འགྱོད་བཤགས་པ་སྤང་བླངས་བྱ་འོས་པ་རྣམས་མི་ཚེ་ཡུད་ཙམ་པ་འདི་ལ་མ་ཞེན་པར་རང་གིས་རང་ལ་སྙིང་རྗེ་དྲག་པོས་འཚལ་ཞེས་ཁོ་བོ་རྒྱལ་ཁམས་པའི་སྙིང་གྲོས་ཡང་དག་པ་ལགས་པས་གལ་ཆེ། དེ་ལྟར་ཡང་གཞན་ལ་བརྩེ་ཕྱིར་སྨྲ་བ་ལས་ཟོག་པོ་ཚོ་ཡི་མཚང་ལ་རྒོལ་འདོད་དེ་ནི་མ་ཡིན་གྱི། དུས་གསུམ་རྫོགས་པའི་སངས་རྒྱས་ནི་རྣམ་པ་ཐམས་ཅད་པ་ཡིན་པའི་གོ་བ་ཙམ་ནི་ཡོད། དེས་ན་ཟོག་པོ་ཡང་སངས་རྒྱས་ཀྱི་སྒྱུ་འཕྲུལ་དུ་དག་སྣང་སྦྱངས་བར་རུང་ཞིང་ཟོག་པོ་ལ་མི་དགའ་དང་ཞེ་སྡང་ཆེན་པོ་ཞིག་མེད་དོ། །བསྐལ་པ་དུ་མ་རུ་འགྲུབ་དཀའ་དལ་འབྱོར་རྟེན། །ཕུན་ཚོགས་རིན་ཆེན་ནི་མི་ལུས་ཐོབ་ལགས་ཀྱང་། །བསགས་པ་བསོད་ནམས་དེ་དམན་པས་བདུད་ཀྱིས་བསླུས། །མནར་མེད་དམྱལ་བ་དེ་མཐོ་རིས་གནས་ནས་འཁོར། །ཀྱེ་ཧུད་ཡ་ང་ནི་ལོ་ཟླ་ཞག་གྲངས་མེད། །ཡུན་སྲིད་བསྐལ་ཆེན་ཞེས་ཐོས་ཀྱང་ཡིད་སོ་ངལ། །དེ་བས་རང་ལ་ནི་རང་གིས་སྙིང་རྗེར་ལྟོས། །འདི་སྣང་ཡུད་ཙམ་ལ་མ་ཞེན་རང་གྲོས་ཐོབ། །ཞེས་སོ། །ཡང་དཀྱུས་སུ་འཇུག་པར་བྱ་སྟེ། དེ་ནས་གདོང་ངན་གྱི་ལོ་ལ་སྟག་ཚང་གི་གནས་ཆེན་གྲོ་ལོད་དུ་བསྒྲུབ་པ་ལྷུར་ལེན་ཞིག་བྱ་སྙམ་ན་ཡང་གྲོགས་ངན་སྟབས་ཀྱིས་ལག་ཏུ་མ་ལོང་བས་ཅི་རོང་དུ་འོང་ནས་བས་མཐའ་རོལ་ལམ་དུ་རང་ཤོང་གི་སྒྲུབ་ཁང་དྲག་པོ་ཨེ་ཀློང་ཞེས་བཏགས་པ་ཞིག་བཅོས་ནས་ཀློང་གསལ་མཁའ་འགྲོ་སྙིང་ཐིག་གི་བླ་བསྒྲུབ་གསེར་གྱི་འབྲུ་གཅིག་གི་བསྙེན་སྒྲུབ་ཁུལ་ཙམ་བྱས་ཀྱང་གཞུང་བཞིན་བཅས་པ་དམ་པོར་མ་གྱུར་པ་དང་ལྷག་ཏུ་ལུས་ཡང་ཡེངས་མེད་ཙམ་སྔགས་བཟླས་ལ་ཞུགས་ཚུལ་གྱིས་ཀྱང་ཡིད་རྣམ་རྟོག་གི་དབང་དུ་བསྐྱོད་པས་བསྒྲུབ་རྟགས་མཚན་མ་ནི་རྨི་ལམ་བཟང་པོར་གྲུབ་ཙམ་ཡང་མ་བྱུང་། སྤྱིར་དེ་དུས་སྐབས་རྟགས་མཚན་ལ་རེ་དོགས་ཆེན་པོ་བྱས་པའི་སྐྱོན་ཡང་ལོས་ཡིན། ཕྱིས་བསྒྲུབ་པ་གྲོལ་མཚམས་སྔགས་བཟླས་མང་ཉུང་ཇི་ཙམ་སོང་བའི་ཕན་ཡོན་གྱིས་ནི་ནམ་ཡང་མི་བསླུ་བས་རྟགས་མཚན་མ་བྱུང་ན་སླའོ་བསམ་པ་བྱུང་བས་དེ་ནི་ཡིན་པར་ཡང་འདུག ལར་བསྙེན་བསྒྲུབ་བྱེད་པར་རློམ་ནས་སྔགས་ཡེངས་ཤིང་བཟླས་ན་རྟགས་མཚན་གྱི་རེ་བ་ཅི་ཡོད། དེ་བས་ལྷ་སྒོམ་དང་སྔགས་ལ་ཡིད་གཏད་ནས་རྣམ་རྟོག་གཞན་སྤང་བ་རང་གལ་ཆེན་དུ་སྣང་ཡང་། དེ་དུས་རྫོགས་རིམ་ཡིན་རྒྱུའི་གོ་བ་ལམ་པ་དེ་ངང་བཞག་པས་ཆོག་ཁུལ་བྱས་ཏེ་མ་ཤེས་པར་གདའ། ལར་འདི་དུས་སྐྱོ་ཤས་ཆེ་ཞིང་རང་ཉིད་ལེ་ལོས་ཆོས་མ་གྲུབ་པར་ཡིད་རབ་ཏུ་གདུང་བ་བྱུང་བས་སྐྱོ་ཤས་ཀྱི་གླུ་ཡང་མང་དུ་བླངས། ལྷག་ཏུ་རྨི་ལམ་དུ་རང་དབང་གཏེར་གནས་སུ་མང་དུ་སླེབ་པ་དང་། ཟབ་གཏེར་ཁ་བྱང་ལུང་བསྟན་དུམ་བུ་ཡང་མང་དུ་བྱུང་མོད། དེ་ཡི་རྟེན་འབྲེལ་གྱིས་སྒོ་ཇི་བཞིན་པ་ནི་བསྒྲིགས་མ་ནུས་པར་ཟད་དོ། །གཞན་ཡང་དེ་སྐབས་རང་ཉིད་ཇི་སྲིད་འཚོ་ཡི་བར་དུ་ངོ་བསྲུང་ཁྲལ་འཇལ་ལྟ་བུ་མ་ཡིན་པར། རང་གིས་དྭངས་བས་དབང་བསྐུར། ཁྲིད་རྒྱུན་ཞུས་པར་རྩ་བའི་དམ་ཚིག་སྲོག་གི་ཕྱིར་ཡང་མི་སྤང་བ་དང་། གནས་སྐབས་ཀྱི་དགེ་སྦྱོར་ཚིག་བདུན་གསོལ་འདེབས། ཟབ་ལམ་བླ་མའི་རྣལ་འབྱོར། ཛབ་སྔགས་བཛྲ་གུ་རུ། ཡི་གེ་དྲུག་མ། རླུང་བུམ་པ་ཅན་གྲངས་བཅད་རྣམས་ཐོག་མར་ཟླ་དུས་ཀྱི་གྲངས་འཛིན་བྱས་པ་ཡིན་ཡང་ཕྱིས་ཉིན་ཞག་ཕྲུག་རེར་བྱས། ལར་ངེད་བརྩོན་འགྲུས་ཤིན་ཏུ་ཆུང་བས་རང་ལ་རང་ཡིད་ཆད་པའི་མཆི་མ་དཀུ་བར་འདུག་ལགས་སོ། །རང་ཉིད་ལེ་ལོ་ཆེ་ལ་ཆོས་བསྐུལ་ཕྱིར། །མགོན་པོ་མ་གཟའ་དམ་ཅན་དཔང་བཙུགས་ནས། །དམ་བཅའ་སྙིང་པོ་རྩ་བ་གཅིག་དང་ནི། །ཡན་ལག་བཞི་བགྱིས་དགེ་བ་བྱང་ཆེན་བསྔོ། །ལྷག་བསམ་གྱིས་ཟིན་དགེ་བ་ཆེ་ཆུང་གང་། །གང་གཱའི་རྒྱུན་ལྟར་བྱང་ཆེན་མཚོར་འཇུག་ཞེས། །རྒྱལ་བས་གསུང་ན་སྣ་རེའི་དགེ་བ་ཡང་། །སངས་རྒྱས་བསྒྲུབ་འདོད་རྣམས་ཀྱིས་འབད་པར་རིགས། །དེ་ནས་གསེར་འཕྱང་གི་ལོ་ལ་ཡི་དམ་ལྷག་པའི་ལྷ་བཅོམ་ལྡན་འདས་བཛྲ་ཀུ་མ་ར་ཡི་བསྙེན་སྒྲུབ་ཞིག་ཀྱང་བགྱིས་པས་དེ་སྐབས་སུ་རྗེ་གདན་དྲུང་རིན་པོ་ཆེ་ཕྱོགས་ཕེབས་མཛད་པར་ཕེབས་སྐབས་ཕྱག་དབང་ཞིག་ཞུ་བར་མ་ཕྱིན་ན་ངེད་ཨོ་ཟོབ་བྱས་པ་ལྟ་བུར་འགྲོ་ཞིང་དགོངས་མི་ཁྲེལ་བའི་ངེས་པ་མེད་སྙམ་བློར་ཤར་ནས་མཚམས་ཐུན་གྲོལ་ནས་ཕྱག་དབང་ཞུ་བར་ཕྱིན་པས་བླ་མ་དམ་པ་དང་མཆེད་གྲོགས་ཤེས་ལྡན་ཚོ་མཚམས་དམ་པོར་ཡོད་པ་དེ་མི་ལེགས་ཙམ་གསུང་བྱུང་ཡང་ངེད་རང་བློ་ཆུང་བའི་སྐྱོན་ཡིན། གཞན་དེང་སང་བླ་མ་ཁ་གཅིག་བཀའ་དྲིན་གསུམ་ལྡན་རྩ་བའི་བླ་མ་ལ་ཡང་ལྟག་ཚུགས་བཟུང་བར་བག་གྲོ་གྲོ་པོ་བྱེད་ལུགས་ལ་བལྟས་ན་ཆོས་འབྲེལ་ཐོབ་ཙམ་བཀའ་དྲིན་ཅན་བླ་མ་ཕྱོགས་ཕེབས་ཞབས་བསྐྱལ་ལ་མཚམས་གྲོལ་ནས་བར་ཆད་ཞུགས་དོགས་མི་དགོས་འདུག ངེད་ཀྱི་བླ་མའི་བྱ་བ་དེ་འདྲ་ལ་སྙིང་སྲབ་པོ་གཅིག་ཡོད་ཀྱི་ཞེ་ཁམས་ཆེན་པོ་བསྐྱེད་ནུས་མཁན་ཅིག་མིན་ལགས། ལར་བསྒྲུབ་པ་གློ་བུར་དུ་དེ་ལྟར་གྲོལ་བ་ནི་བསྒྲུབ་པའི་གཡང་ཉམས་པར་རྒྱལ་བ་ཡང་དགོན་པས་གསུང་འདུག་པ་དེ་ངེས་པར་ཐུགས་མད་འདུག དུས་ཕྱིས་བསྒྲུབ་པའི་འཕྲོ་ལུས་པ་རེ་རྟག་ཏུ་བྱུང་། དེ་འདྲ་བློ་གདེངས་བསྐྱེད་ནས་དམ་བཅའ་གང་ཡིན་མ་གྲུབ་བར་རྐྱེན་དབང་གིས་བར་མ་ཆོད་པར་གལ་ཆེ་འདུག བསྒྲུབ་པ་དེ་སྐབས་སུ་སྔར་ལྟར་རྣམ་རྟོག་དབང་ཆེར་འབྱམས་པ་དེ་མ་བྱས་ཁུལ་ཡིན་ཡང་། འོན་ཏེ་གཞུང་དོན་ཇི་བཞིན་མ་རྟོགས་པས་བསྒྲུབ་པ་ཚད་ལྡན་ནི་ཅི་ལ་འགྱུར། རྟགས་ཀྱི་རིམ་པ་ཡང་ནད་གདོན་ཐོན་པའི་ལྟས་ཙམ་ལས་གཞན་ནི་ཆེ་བ་མ་བྱུང་། རྡོ་རྗེ་རྩེ་དགུ་པ་རྭ་མ་ཚངས་བ་གཅིག་ལག་ཏུ་བླངས་བ་ཡང་ཡང་རྨིས། རྭ་མ་ཚངས་པ་དེ་ཡི་དམ་གྱི་དབང་བསྐུར་ཞུས་པའི་བླ་མར་ལྟེམ་རྐྱང་ཞིག་ཤར་ཡོད་དམ་བསྐྱེད་རིམ་ཐང་ལྷོད་ཤོར་བའི་ལྟས་གང་ཡིན་ནམ་ངོས་མ་ཟིན། ཡི་དམ་དཀྱིལ་འཁོར་ནི་ནམ་མཁའི་སྐར་ཚོགས་འདྲ། ངོ་མཚར་ནུས་པ་ནི་རང་སོར་ཆེ་མོད་ཀྱི། ཀུན་གྱི་ཐུགས་རྗེ་དང་འཕྲིན་ལས་འདུས་པའི་ལྷ། །བར་ཆད་ཀུན་སེལ་ཞིང་དངོས་གྲུབ་སྩོལ་ལགས་པའི། །གསང་བདག་རྡོ་རྗེ་འཆང་རྒུད་བྲལ་གཞོན་ནུའི་སྐུ། །ཉི་ཟླ་ལྟར་གྱུར་པའི་ལྷ་མཆོག་ཀཱི་ལ་ཡ། །པད་འབྱུང་ཡབ་ཡུམ་གྱི་ཡི་དམ་ལྷག་པའི་ལྷ། །དེ་ཡི་ངང་ཉིད་ལ་ཁོ་བོས་ཡི་དམ་བགྱིས། །འཕྲལ་རྐྱེན་སྤྱོད་དབང་གི་ཀླུ་གདོན་ཞུགས་ཆ་བ། །ལྷ་མཆོག་དེ་ཉིད་ཀྱི་ནུས་པས་རང་སར་དེངས། །གནས་སྐབས་ཅུང་ཟད་རེ་སྔགས་བཟླས་དེ་འདྲ་ན། །གསལ་གསུམ་ཡུན་བསྒོམ་ན་མཆོག་དོན་ཅིས་མི་འགྲུབ། །ལོ་དེར་བསལ་དུ་ནང་འཁྲུག་བྱུང་བ་སོགས་གདན་སའི་དབང་གིས་རྣམ་གཡེང་ཤིན་ཏུ་ཆེ་བས་རང་བློ་ཁེངས་པའི་བསྒྲུབ་པ་ལག་ཏུ་བླངས་རྒྱུ་ནི་བྲལ་མོད། འོན་ཀྱང་དལ་སྐབས་ཅུང་ཟད་བྱུང་རིམ་གྱིས་བསྒྲུབ་པ་ཞག་བདུན་མ་རེ་བགྱིས་ཤིང་། བར་གཅིག་རྡོ་རྗེ་རྣལ་འབྱོར་མ་ཡི་བསྙེན་པ་བདུན་ཞག་གཅིག་བྱས་པས། དེ་སྐབས་ཕྱིས་རིམ་གྱིས་སྙན་པ་མངའ་ཐང་ཅུང་ཟད་འབྱུང་བའི་ལྟས་ཀྱང་བྱུང་བས། རྣལ་འབྱོར་ང་དང་བྱ་རྒྱལ་ཁུ་བྱུག་གཉིས། །རྒྱང་རྒྱང་འགྲོ་བཞིན་སྐད་འཕང་མཐོ་རུ་འགྲོ། །ད་ལྟ་འཚོགས་ནང་གཞོན་ནུ་ཉམས་ཉེས་དེ། །ཁྱད་གསོད་མཐོ་གནོན་བྱེད་པ་རང་ངལ་ཡིན། །ཆུ་དང་ཤིང་རྡོལ་ས་རྡོས་མི་ནོན་ཞིང་། །གནས་སྐབས་དམོད་པས་མཐར་ཐུག་གནོད་པ་མིན། །ཨེ་བདེན་ལོ་རེ་ལོ་གཉིས་འགྱངས་བཞིན་དུ། །ཚིག་འདི་ཇེ་ལས་ཇེ་ཆེར་གསལ་དུ་འགྲོ། །ཞེས་སོགས་པའི་གླུ་དབྱངས་མང་དུ་བླངས་ཤིང་ཡི་གེར་ཡང་བྲིས། ཡང་དུས་དེར་དབུས་གཙང་དུ་ཇིང་གར་གྱི་དུས་འགྱུར་བསྟན་པའི་ཇུས་ཆགས་དེ་འབྱུང་ལྟས་ཡང་ཤར་རུང་ཕྱིས་བར་དཔྱད་མ་ཐུབ། གཞན་ཡང་རྨི་ལྟས་ལ་བརྟེན་འབྱུང་འགྱུར་གནས་མང་ཙམ་ཤར། ལོ་འདི་ནས་བཟུང་རང་ལོ་ཉེར་ལྔའི་བར་དུ་བསྒོམ་བསྒྲུབ་ཚད་ལྡན་བསྐྱལ་རྒྱུ་བྱུང་ན་གུ་རུ་པདྨའི་སྲས་ཀྱི་དྭངས་མར་རྟོགས་པ་ཞིག་དེ་སྐབས་ནས་ཡོང་རྒྱུ་དེ་ཡང་གནས་སྐབས་ཉི་ཚེའི་རྐྱེན་དབང་གིས་ཡལ་སོང་། ལོ་དེར་སྤྱིར་སྦྱིན་བདག་རིམ་གྲོ་བྱ་དགོས་མང་ཞིང་། ལྷག་ཏུ་སྟོན་སེར་དུ་ཚངས་གྲིབ་ཅན་ཞིག་གི་རིམ་གྲོར་གདན་དྲུང་རིན་པོ་ཆེ་དང་ཕྱག་མཛོད་ཀྱི་གསུང་ནན་ལ་བརྟེན་མི་འདོད་བཞིན་དུ་ཕྱིན་པས་ཚུར་དགོན་དུ་སླེབ་མཚམས་སིབ་ནད་ཀྱིས་བཏབ་ནས་སྤྱོད་ལམ་ལོག་པས་ཟླ་གཅིག་ལྷག་ཙམ་འཆི་ལ་ཕྱོགས་པའི་ནད་ཚབས་ཆེ་བ་བྱུང་། ངེད་རང་འཆི་བ་ཡས་ཆུང་རུང་། ཕྱག་མཛོད་སོགས་ནས་ནད་ན་མི་ཆོག་པའི་བསྒྱུར་སྦྱངས་ལྕི་བས་སོ་མ་གསོད་ཅིང་ཡིད་སྐྱོ་རབས་བྱུང་།<br>སྤྱིར་ཡང་རྗེ་དབོན་གདན་དྲུག་རིན་པོ་ཆེས་ནི་བརྩེ་བའི་སྤྱན་གྱིས་སྐྱོང་བ་དང་ལྷག་ཏུ་དབང་ཆོས་ཀྱི་འབྲེལ་པ་ཞུས་པའི་བླ་མར་གྱུར་པས་བཀའ་དྲིན་མཆོག་ཏུ་ཆེ་ཞེས་སྨྲ་མོད། དེ་བས་དེང་སང་སྐུ་སྐྱེ་གཞན་ཁ་ཅིག་ལྟར་གདན་སར་སླེབ་ནས་དབོན་རིགས་གྲྭ་འཁོར་བུ་སློབ་སྦྱིན་བདག་རྣམས་ཀྱིས་བཀུར་བཀུར་ཅོག་ཅོག་པོ་དེ་འདྲ་ངེད་ལ་ཡེ་ནས་མེད་པ་དེ་ཀུན་གསལ་ཡིན། ལར་སྐུ་སྐྱེ་ཟེར་བ་རྣམས་ཐེ་ཚོམ་ཟ་བ་ནི་ཤིན་ཏུ་ནས་བདེན་གྱི་ངེད་རང་ཡང་དེ་ལྟ་བུར་བློ་འགྲོ་དཀའ་བ་རང་ཡིན། དེ་ལྟར་སོམ་ཉི་ཡོད་ཕྱིན་སྐུ་སྐྱེར་མངའ་གསོལ་ནས་གདན་སར་བསུ་བ་དེ་མི་འཚལ་ལ། དེར་ནི་སུས་ཀྱང་མགུ་འཁོང་བྱེད་དུ་ཅི་ལ་ཡོད། དེ་མ་ཡིན་པར་གདན་སར་སྐུ་སྐྱེར་མངའ་གསོལ་ཕྱིན་སྐྱེ་བ་ཡིན་མིན་ཐེ་ཚོམ་ཟ་རུང་དབོན་རིགས་གྲྭ་འཁོར་རང་རང་ཐད་ནས་མ་ཆད་པར་གང་ལེགས་རེ་བྱེད་དགོས་པ་ནི་བབ་མོད། ལེགས་པོ་བྱེད་ཞེས་པ་ཡང་འཇིག་རྟེན་གྱི་ཕོ་སྒོ་གཏམ་གཤེད་ཧམ་པ་ཐོ་ཅོ་ཆང་འཐུང་རྟ་རྒྱུགས་བག་མེད་ཀྱི་རྩེད་འཇོ་སོགས་བློ་ཆོས་ལ་དྲེད་དེ་རྒྱུ་འབྲས་རྩིང་པོར་སྤྱོད་པའི་གཞི་རྩ་དང་། དཀོར་སྡུད་ལུགས་ཧབ་ཐོབ་བྱེད་ལུགས་ཟས་ནོར་ལ་ཆོས་ཕྱིར་མ་ཡིན་པའི་བསགས་བཀྲུན་བྱེད་ལུགས་སོགས་འཇིག་རྟེན་འདིར་སྣང་གི་ལེགས་ལེགས་ལྟར་སྣང་བའི་ཕུག་ངན་སོང་གི་གཏིང་རྡོ་བྱེད་པའི་མར་འགྲོའི་དཔྱང་ཐག་དེ་འདྲ་ནི་སློབ་མཁན་དང་ཉན་མཁན་ཐམས་ཅད་བདུད་ཀྱིས་བསླུས་པ་སྟེ། ཕན་པ་ལྟར་བསྟན་ནས་མནར་མེད་དུ་བསྐྱུར་བ་ཡིན་པས་ལེགས་སོ་མི་ཟེར་ཏེ་ཉེས་པའི་མཐར་ཐུག་པ་ཡིན་གྱིས་གོ་དགོས། དེ་བས་གནས་སྐབས་ཟས་གོས་འཕང་མེད་དང་ནོར་ཟས་ཅི་རིགས་བསྟབ་ཅིང་སྙན་པར་བརྗོད་པ་ནི་འཇིག་རྟེན་ལུགས་ཀྱི་ཕན་འདོགས་བཟང་ངེས་ཡིན་མོད། ཡང་དག་པར་ནི་དེ་ཡང་ཁམས་མི་ཆེ་སྟེ། དེ་མ་ཡིན་པའི་ལེགས་པོ་ཇི་ལྟ་བུ་དགོས་ཞེས་ན། རང་གཞན་གྱི་དོན་ཕུན་སུམ་ཚོགས་པའི་བྱང་ཆུབ་བསྒྲུབ་པར་སློབ་པ་ལ་ཟེར་ཏེ། དེ་ལྟར་ན་སྲོག་འཚོའི་ཟས་ངན་ངོན་ཙམ་དང་གྲང་སྐྱོབས་གོས་ཧྲུལ་པོས་ཆོག་ཤེས་ཤིང་། འདིར་སྣང་གི་ནོར་རྫས་རྨི་ལམ་ལྟ་བུར་ཞེན་རྒྱུ་ཅི་ཡོད། དེ་བས་ཆུང་ངུ་ནས་ཆོས་མིན་བློ་དྲེད་དུ་མ་སོང་བར་རྒྱུ་འབྲས་དམ་ཚིག་གི་ཁེ་ཉེན་ཞིབ་ཏུ་བཤད་ནས་བློ་རྒྱུད་ཆོས་ལ་དཀྲིས་ནས། བསླབ་ཤེས་ཀྱི་ཡོན་ཏན་ལ་དོ་གལ་བཅུག བསླབ་གསུམ་རྣམ་པར་དག་དགོས་པའི་ཞལ་ལྟ་བྱེད། བསྒོམ་བསྒྲུབ་ལ་བརྩོན་པ་བསྐྱེད་པའི་བསྐུལ་ལྕག་བཏང་། ཁྱད་པར་དུ་ས་ཉེ་རིང་གང་དུ་འདུག་ཀྱང་བཤེས་གཉེན་དམ་པ་ལ་མཚམས་སྦྱོར་ནས་དམ་ཚིག་རྣམ་པར་དག་པ་དང་། གནས་ལུགས་ལྷན་སྐྱེས་ཀྱི་ཡེ་ཤེས་སྒྲིབ་མེད་ལྟ་བར་ཡང་ཡང་དུ་ཞི་དྲག་དུ་མས་འབད་དེ་བསྐུལ་བ་དེ་ནི་ཕན་འདོགས་ཡང་དག་པ་སྟེ་ལེགས་པའི་མཐར་ཐུག་ཡིན་མོད། དེ་འདྲ་སློབ་དཔོན་དཀོན་ནི་དཀོན་པོར་གདའ། དེ་འདྲ་སློབ་མཁན་བྱུང་ཚེ་སྐུ་སྐྱེའམ་སུ་ཡང་རུང་སྟེ་མངོན་ཤེས་གྲུབ་རྟགས་རིགས་ཡིན་ན་བྱ་བ་དྲིན་དུ་ཤེས་ཤིང་གཟོར་ཡོང་། དེ་ལྟ་བུའི་བྱ་བ་དྲིན་དུ་མི་བརྩི་ན་རང་ཉིད་ལ་མདོ་མ་བྱུང་བ་ཡིན་གྱི་གོ་དགོས་སུ་གདའོ། །དེ་ལྟར་ཆོས་འཇིག་རྟེན་གྱི་ཕན་འདོགས་གང་ཡང་མེད་པར་སྐུ་སྐྱེར་ངོས་བཟུང་གདན་སར་མངའ་གསོལ་བཞིན་དེ་ལ་ཁྱད་གསོད་བརྙས་པ་མཐོ་གནོན་ངན་སློབ་བྱེད་པ་ནི། རང་རང་བླ་མ་གོང་མ་ལ་དད་མོས་གུས་ཞེན་མེད་པའི་མཚང་དང་དམ་ཚིག་ཉམས་ཆགས་ཡང་ངེས་པར་ཡོང་བ་ཡིན་ནོ། །དེ་ཡང་ཇི་ལྟ་བུ་ཞེ་ན་སྐྱེ་བར་དབུགས་དབྱུང་ཤིང་གདན་སར་མངའ་གསོལ་བའི་སྐུ་སྐྱེར་གྲགས་པ་དེ་ཉིད་ཆོས་ལ་བློ་ཁ་ཕྱོགས་ཤིང་བསྟན་འགྲོར་ཕན་པའི་ལྷག་བསམ་གྱི་དོན་གཉིས་བསྒྲུབ་པའི་བསམ་གཞི་ཡོད་པ་གཅིག་ཡིན་ཕྱིན་སྐྱེ་བ་ཡིན་མིན་ཐེ་ཚོམ་ཟ་བའམ། གལ་ཏེ་སྐྱེ་བ་མིན་པར་གྱུར་པ་ཞིག་ཀྱང་བརྙས་ཤིང་ཁྱད་དུ་གསོད་ན། དཔེར་ན་འཇིམ་གཟུགས་ཀྱི་ཤཱཀྱ་ཐུབ་པ་ཤཱཀ་ཐུབ་དངོས་མིན་ཡང་དེ་ལ་སྨོད་ན་རྣམ་སྨིན་ལྕི་བ་དང་བཤིག་པ་སོགས་ཀྱིས་ནི་མི་ཟད་པའི་ལས་ངན་དུ་འགྲོ་བ་དང་མཚུངས་བས་སོ། །ཡང་འདི་ལ་སྐྱེ་བ་ཡིན་མིན་གང་ལྟར་ཡང་བསྟན་འགྲོར་ཕན་འདོགས་ཀྱི་ནུས་པ་མེད་པར་ཆོས་མིན་གྱི་སྤྱོད་པར་དུས་འདའ་ཞིང་རྒྱལ་བའི་བསྟན་དང་བླ་མ་གོང་མའི་མཚན་ལ་རྨ་འབྱིན་ཅིང་དཀོར་གྱི་སྤྱང་ཀིར་ལྟ་བུས་སུན་ཕྱུངས་ན་གོང་ལྟར་ཉེས་པ་མི་འབྱུང་སྟེ་ཇི་ཞེ་ན། སྐུ་སྐྱེར་གྲགས་ཀྱང་ཆོས་མིན་སྤྱོད་པ་དེ་ནི་མི་གཙང་བའི་ཕུང་པོར་ཤཱཀ་ཐུབ་ཡིན་སྨྲ་མཁན་ལ་སྒྲིབ་པར་འགྱུར་ལ། དེ་ལ་འདི་མི་གཙང་བའི་ཕུང་པོའོ། །ཤཱཀྱ་ཐུབ་པ་མ་ཡིན་སྨྲ་ན་སྒྲིབ་པར་མི་འགྱུར་བར་མཚུངས་པར་གོ་དགོས་སོ། །དེ་ལྟར་ཡང་ཕྱིས་འབྱུང་རང་འདྲ་སྐྱེ་བར་གྲགས་པ་རྣམས་དང་གདན་དབོན་གྲྭ་འཁོར་ཀུན་གྱིས་ངེས་ཤིང་རྟོགས་པར་བྱ་དགོས་མོད། འོན་ཀྱང་སྤྲང་པོའི་གླུ་ལ་སྙན་ཚིག་ཡོད་ཀྱང་ཉན་མཁན་མེད་པའི་དཔེ་དང་འདྲ། དེ་ལྟའི་འཕྲོས་དོན་སྨྲ་བ་ན་ཟད་པ་མེད་མོད་ཀྱི། ད་ནི་དཀྱུས་སུ་འཇུག་ན་ཁོ་བོ་ཅག་གདན་སར་མ་སླེབ་སྔོན་ནི་སྨོས་ཀྱང་མ་དགོས་སླེབ་ནས་ཡང་རྗེ་གདན་དྲུང་གི་ཐུགས་རྗེས་གཟིགས་པ་དེ་ཁོ་ན་ལས། གཞན་དེ་སྐབས་ཀྱི་དབོན་རིགས་གྲྭ་འཁོར་ཚོས་ཆོས་ཀྱི་ཕན་འདོགས་ནི་རང་རང་ལ་གཞི་མ་གྲུབ་པས་ཅི་བྱེད། འཇིག་རྟེན་གྱི་ཕན་འདོགས་ཡང་ཡེ་ནས་མ་བྱུང་མོད། དེ་ཡང་ཕར་བཞག་གདན་སར་སླེབ་ནས་མི་ལོ་བརྒྱད་ཀྱི་བར་དུ་གདན་སའི་དབོན་གཉེར་གྲྭ་འཁོར་དྲག་པ་ཕལ་ཆེ་བས་སྤྱན་རས་བཟླུམ་པོས་སྤྲུལ་སྐུ་ཞེས་མིང་ཟུར་ལ་བཀའ་བསྐྱོན་རྟག་ཏུ་ཡོང་བའི་གནས་སུ་བྱས་ནས་སྡོད་པ་ཡིན། སྐུ་སྐྱེ་གཞན་ལྟར་ངེད་མིན་ཞེས་པ་དེ་ཡང་ལགས། གང་ལྟར་ཁོ་བོ་སུ་ཞིག་གི་སྐྱེ་བ་ཡིན་ཀྱང་རུང་། ངེད་རང་ལ་ནི་ཁྱད་ཅུང་ཟད་ཀྱང་མི་བདོག་གོ །རིག་འཛིན་པདྨ་ནོར་བུའི་སྐུ་ཉེ་གྲྭ་རིགས་མང་ཞིག་གི་དེ་ཡི་སྐྱེ་བ་བདག་མིན་པར་བསྒྲུབ་བཞིན་མིན་དུ་རུང་མོད། དེ་ལྟ་ན་ཡང་སྔོན་ལས་ཀྱི་དབང་གིས་ཚེ་འདིར་མིང་སྤྲུལ་སྐུར་གྲགས་དགོས་ཞིག་དང་། དེ་ཡི་ཁྲལ་ཆོས་རྗེ་པདྨ་བློ་གྲོས་ཀྱི་གདན་རབས་ལ་མཇལ་དགོས་བྱུང་འདུག་པ་དེ་ལ་ཁྱེད་རྣམས་ཁོང་ཁྲོ་དྲག་པོ་མ་མཛད་ཅིག། ཁོ་བོ་ནི་བྱ་བྲལ་གུ་ཡངས་ཡན་པ་བློ་བདེའི་སྐྱེ་བར་སྨོན་གྱིས་མཆིས་ལགས་སོ། །དེ་ཡང་གདན་ས་ཡི་མིང་ཅན་དེར་རང་ཉིད་སླེབ་པ་ནས་བཟུང་རྒྱལ་ཁམས་མ་འགྲིམས་ཀྱི་བར་བླ་གྲྭའི་ནང་དུ་མཐོན་པོ་རྣམས་ལ་འགྲན་སེམས་མེད་པར་གོང་དུ་ཁུར་མཁས། བར་པ་རང་མཉམ་རྣམས་ལ་མཐོས་མནོན་མེད་པར་འགྲོགས་མཁས། དམན་པ་རྣམས་ལ་ཁྱད་གསོད་མེད་པར་བཀོལ་མཁས་སུ་རང་ངོས་ནས་ནི་བགྱིད་ཁུལ་བྱས། འོན་ཀྱང་རྒྱུད་མི་བསྲུན་པ་རེས་འགའ་དང་སྤྱོ་དགོས་པར་ནི་མཐའ་མ་བཀག་མོད། དུས་དེ་སྐབས་ཀྱི་སྤྱོད་པའི་ལོ་རྒྱུས་ཡིན་ལུགས་དྲང་པོ་ཀུན་ལ་གསལ་བ་དེ་ཡིན་ནོ། །གང་ལྟར་རྗེ་གདན་དྲུང་སྐུ་ཞོགས་སུ་སྡོད་རིང་ཡུལ་དེར་དཔག་པའི་སྐུ་སྐྱེའམ་སྤྲུལ་སྐུའི་མིང་ཅན་རྣམས་ཀྱི་མིག་སྲོལ་ལ་ངེད་རང་ནས་སྤངས་རྟོགས་ཡོན་ཏན་མེད་པས་བཟང་དཔེ་ནི་ཅི་ལ་འགྱུར། འོན་ཀྱང་ཕྱིའི་ཀུན་སྤྱོད་ལ་མ་དཔེར་འགྲོ་བ་ནི་མ་བྱས་ཏེ་འདི་སྐོར་གྱི་རྟོགས་བརྗོད་ཆ་ཤས་གཞན་དུ་བྲིས་པ་ལས་ཤེས་སོ། །གསེར་འཕྱང་གི་ལོ་འདི་ནས་ཕྱིའི་དགོན་རིས་སྦྱིན་བདག་ཡུལ་སྡེ་ཡོངས་ནི་མགུ་ཞིང་འཕྲིན་ལས་ནི་རྒྱས་པའི་དབུ་ཚུགས། ཡིན་པ་ནི་གཞན་དོན་མི་ནུས་པ་ལ་འཕྲིན་ལས་སྐྱེ་བ་བདུན་ཀྱིས་ཕྱེ་གཏོར་དུ་ནི་སྙིང་ནས་ངེས། ནང་གི་གྲྭ་རིགས་རྣམས་ཀྱིས་ནི་སྔར་ལས་ལྷག་ཙམ་གྱི་བཀའ་བཀྱོན་བརྙས་པ་ཁོ་ན་གནང་། རང་ཉིད་རྣམ་གཡེང་ཟང་ཟིང་གི་བློ་འདོད་དེ་འདྲ་སྙིང་ནས་མེད་ངེས་ཡིན་ཞིང་། དེ་སྟབས་རྗེ་བླ་མར་དགོངས་པ་ལན་གཅིག་མ་ཡིན་པར་ཡང་ཡང་ནན་དུ་ཞུས་པས། འདི་ལོ་ཟུར་མང་གཏེར་སྟོན་དྲུང་དུ་འགྲོ་ཆོག་པའི་བཀའ་ཡི་ཁྲོལ་ཆ་ཡང་བྱུང་ལ། དེ་མིན་སྡོད་དགོས་བྱུང་བར་ཀུན་མཁྱེན་དྲི་མེད་འོད་ཟེར་གྱི་ཚིག་དོན་མཛོད་དཔེ་ལྟ་བྱས་པས་རྐྱེན་བྱས། དེ་ཕན་ཆད་ཀྱི་ཉམས་ལེན་མཉམ་མེད་སྒམ་པོ་པ་ཡབ་སྲས་ཀྱི་རྩེ་གཅིག་གི་རྣལ་འབྱོར་དུ་བརྡར་བཞག་པའི་གནས་འགྱུ་བར་ལག་འགྱེལ་བའམ་གཉིས་མེད་དུ་རྟོགས་པ་ནི།<br>ཁྱབ་བདག་རྩ་བའི་བླ་མ་ཀུན་བཟང་པདྨ་བདེ་བ་ཆེན་པོའི་སྤྱན་སྔར་སྐྱེས་ཤིང་ངོ་འཕྲོད་ཀྱང་། འདི་སྐབས་སུ་དེ་ཡང་ཕྱོགས་རེ་བ་རྒྱ་ཆུང་ངུར་སོང་སྟེ་སེམས་གཞི་མེད་རྩ་བྲལ་ཞེས་པ་དེ་སེམས་འཚོལ་སྐབས་ཀྱི་གོ་བབ་ཤེས་རབ་ཅན་ཕལ་ཆེ་ལ་བླ་མ་མྱོང་བ་ཅན་གྱི་ངོ་སྤྲོད་ཚེ་བློ་ཡུལ་དུ་ཡོང་བ་ཐུན་མོང་དེ་དང་ཡེ་མི་འདྲ་བའི་མྱོང་བ་ཞིག་སྐྱེས་པས་སྔར་གྱི་ཚིག་དེ་ཚོ་གོ་བ་འོལ་སྤྱི་རུ་སོང་། འདི་སྐབས་སུ་ཡང་ཕྱོགས་གཅིག་ནས་གོ་བར་འདུག་ཀྱང་གོ་བ་དེ་ནི་ཡང་དག་པའི་གོ་བ་སྤྲོས་པ་ཆོད་པ་དེར་གྱུར། གོ་བ་རྣམ་པར་དག་པ་ནི་རྟོགས་པ་དང་གཉིས་ཧ་ཅང་གི་ཁྱད་ཆེ་བ་མེད་ཞེས་གྲུབ་ཐོབ་ཨོ་རྒྱན་པའི་གསུང་ཡིད་བཟང་བརྩེ་བའི་རྣམ་ཐར་དུ་དྲངས། ངེད་རང་གི་ཤར་ཚུལ་དང་ནི་མཐུན་གཞན་ཚོ་དང་མཐུན་མིན་ནི་མ་ཤེས་སོ། །དེ་ཡན་ཆད་དུ་ཉམས་ཀྱི་འཆར་ཆ་ཚད་བཟུང་ལས་འདས་པ་བྱུང་བ་སྔོན་གྱི་སྦྱངས་ལྷག་ཏུ་གྱུར་ཀྱང་དེ་ངོ་ཅུང་ཟད་མ་འཕྲོད་པ་དང་ཚུལ་བཞིན་སྐྱོང་རྒྱུ་མ་བྱུང་བས་ཕྱིས་དཀོར་རྫས་ལ་ལོངས་སྤྱོད་ཚེ་འགྲིབ་པར་གྱུར་པ་ཡི་ཚད་བཟུང་མ་ནུས་གཤིས། དེས་ན་སྐབས་འདིའི་ཉམས་མྱོང་ཉིད་ཚེ་འདིར་དགེ་སྦྱོར་གཤའ་མ་སྐྱེ་བའི་རྐང་དེ་ནས་ཚུགས་པ་ཡིན། འོན་ཀྱང་འདི་དུས་ཕྱག་ཆེན་ལ་མོས་ཞེན་ཆེ་ཞིང་སེམས་ངོ་གོམས་འདྲིས་ཡང་དེ་ཀའི་བཞེད་པ་ལྟར་སྐྱོང་བ་ཡིན་པས། དེ་ལ་བཀའ་བརྒྱུད་པ་གོང་མ་རྣམས་ཀྱི་ཞལ་ནས་ཕྱག་ཆེན་རྟོགས་པའི་སྣེ་ཟིན་དགེ་སྦྱོར་སྐྱེས་ཀྱང་དེ་སྐབས་བརྩོན་པས་མ་སྐྱོངས་ན་བསྒོམ་འགྲིབ་འགྲོ་གསུངས་པ་དེ་ཡང་ཤིན་ཏུ་ནས་ཐུགས་མད་འདུག དེ་ལ་མཁས་གྲུབ་སོགས་བཟློག་པ་ཡབ་སྲས་རྣམས་ཀྱིས་ནི། སེམས་ཕྱོགས་ཀྱི་མན་ངག་སྤྱིར་བཏང་ཡུལ་ལམ་དུ་བྱེད་པ་དང་། ཀློང་ཆེན་པ་ཡན་ཡུལ་ཅན་ལམ་དུ་བྱེད་པས་རྫོགས་ཆེན་སྙིང་ཐིག་ལུགས་ལ་ངོ་བོ་མཐོང་ཕྱིན་མི་འགྲིབ་ཅེས་གསུངས་པ་དེ་ཡང་ཇི་ལྟ་བ་མཁྱེན་པའི་ལེགས་བཤད་ཡང་དག་པར་མངོན་ནོ། །བསོད་ནམས་མཐུ་ཡིས་བདེ་ཆེན་གླིང་དང་མཇལ། །རྒྱུ་དེས་ཆོས་ཀྱི་སྲོག་རྩ་བྱིན་རླབས་ཞུགས། །སྨོན་ལམ་སྟོབས་ཀྱིས་ཀུན་མཁྱེན་གསུང་ལ་མོས། །རྐྱེན་དེས་རྫོགས་ཆེན་གྲུབ་མཐར་མོས་གུས་བརྙེས། །དེ་དག་སྟོབས་ཀྱིས་ཉམས་ལེན་རྐང་པ་ཚུགས། །སྐལ་བ་དམན་ཡང་སྐལ་མེད་མིན་ཙམ་མངོན། །བཟང་ངན་ལས་ཀུན་བསླུ་མེད་རྒྱལ་བས་གསུངས། །ཇི་བཞིན་མ་འདྲེས་སྣང་ལ་ཡ་མཚན་སྐྱེས། །ཞེས་སོ། །ཉམས་མྱོང་དེ་ཀའི་རྒྱུན་ལ་བརྟེན་ནས་བླ་མ་གོང་མ་མང་ཞིག་གི་བཞེད་པ་ལྟར་ན་བདེ་སྟོང་དཔེ་ཡི་ཡེ་ཤེས་ཡང་དེ་སྐབས་ཆ་མཐུན་སྐྱེས་པར་རློམ་ཡང་། རྒྱུད་སྡེ་ཆེན་པོའི་དགོངས་དོན་ལྟར་ན་དེ་ཅུང་ཟད་མིན་པར་སྣང་ཡང་། གང་ལྟར་ཉམས་མྱོང་བརྟན་པོར་སྐྱེས་པའི་ནུས་པས་ཕྱི་ནང་རྟེན་འབྲེལ་གཅིག་པའི་གནད་ཀྱིས་ཕྱི་ན་ཡང་རང་ཉིད་གར་གནས་དེ་རུ་སྤྲིན་སྨུག་ན་བུན་འཇའི་རང་བཞིན་ཡ་མཚན་པ་དང་། རླུང་ཡང་དལ་བར་གཡོ་ཞིང་བག་དྲོ་ཡིད་དུ་འོང་བའི་རྣམ་པ་དང་། རང་གི་དྲུང་ན་འཁོད་པ་ཀུན་བག་ཕེབས་པ་དགའ་འཛུམ་གྱི་ངང་ཚུལ་དུ་སྣང་སྟེ། དོན་ལ་རང་སེམས་ལ་བདེ་ཉམས་ཀྱི་ཤར་ལུགས་ཙམ་ལས་ངེས་བཟུང་ཚད་མ་ནི་ཅི་ཕྱིར་ཡོད། གང་ལྟར་དེ་སྐབས་སུ་བདེ་སྡུག་སྙན་མི་སྙན་ཚ་གྲང་གི་མྱོང་རེག་རྣམས་ཀྱང་རྣམ་རྟོག་གི་རང་གཟུགས་ལས་གཞན་པའི་རང་རྒྱུད་བྱེ་བྲག་པར་གྲུབ་པའི་ངང་ཚུལ་དུ་རྟོགས་པ་དེ་དག་ཀུན་ཀྱང་རིག་ངོ་རོ་མཉམ་ཉིད་དུ་ཤར་བ་དང་། ལྷ་ལ་ཆགས་པ་འདྲེ་ལ་སྡང་ཞེན་ཡང་རེ་དོགས་ཀྱི་འཆར་ཆ་ཕྲ་མོ་ཙམ་ལས་གཞན་རང་སར་ཞི་ཞིང་། མངོན་ཞེན་རེ་དོགས་ཁོ་རང་ཡང་རང་ཤར་རང་གྲོལ་ཆོས་ཉིད་ཀྱི་ཡོ་ལང་ལས་གཞན་དུ་མེད་པ་ནི་ངེས་ཤེས་གཏིང་ཚུགས་པ་སོགས་གཞན་བློར་འགལ་བ་རང་བློར་མ་འགལ་བའི་མྱོང་བ་དུ་མ་ཞིག་ཤར་ཏེ། དེ་དང་ཟླ་བ་གསུམ་ཙམ་བར་དུ་ཉམས་དེ་ཀ་བརྟན་པར་གནས་སོང་། འདི་སྐབས་སུ་དབེན་པའི་གནས་བརྟེན་གཏུམ་མོ་རླུང་ཐིག་གནད་དུ་བསྣུན་ནས་བོགས་འདོན་དགོས་རྒྱུ་ལ། དེ་ལྟར་མ་གྲུབ་པས་ཕྱིས་དགེ་སྦྱོར་ལ་བོགས་བསྐྱེད་ཤིན་ཏུ་ཆུང་བ་བྱུང་། སྤྱིར་ནི་མི་བརྟེན་པའི་མྱོང་བ་རྣམས་ཉམས་དང་བརྟན་པ་ནི་རྟོགས་པ་ཡིན་ཞེས་སྨྲ་ཡང་དོན་ལ་སེམས་ཉིད་རིགས་རྒྱུན་རང་གསལ་གྱི་ངོ་བོ་ལ་ནི་ནམ་ཡང་འཕོ་འགྱུར་མེད་ཀྱང་། གནས་སྐབས་སུ་ཀུན་རྫོབ་རྩ་རླུང་ཐིག་ལེ་འཕེལ་འགྲིབ་ཀྱི་རྟེན་འབྲེལ་དང་རྐྱེན་དབང་རྣམ་རྟོག་རླུང་གི་བྱེད་ལས་ཀྱི་དགེ་སྦྱོར་ལ་འཕེལ་བ་དང་འགྲིབ་པའི་ངང་ཚུལ་དུ་མ་ཞིག་ནི་སྟོན་མོད། འཕེལ་འགྲིབ་སྣང་ཡང་འཕེལ་འགྲིབ་ཀྱི་རྣམ་རྟོག་ཁོ་རེའི་རང་ངོ་མཉམ་ཉིད་དུ་ཤེས་པས་རྦ་རླབས་རྒྱ་མཚོར་ངོ་ཤེས་པ་ལྟ་བུར་སྙིང་ནས་ཐག་ཆོད་ཅིང་ཐེ་ཚོམ་ཕྲ་བ་ཅི་བྱས་གུ་ཡངས་ཟོལ་བདེ་བ་རྟོགས་པ་ཡིན་ལ་དེ་མ་ཡིན་པར་ངོ་བོར་འགྱུར་མེད་དེ་རྣམ་རྟོག་འགྱུར་བཅས་ཀྱིས་བསྒྲིབས་ནས་འཕེལ་འགྲིབ་ཉམས་ལ་བླང་དོར་དང་གང་ཤར་དེ་ཐོག་ཏུ་མི་བདེ་བའི་ཡིད་གཉིས་ཕྲ་མོ་ཡོད་ཕྱིན་ཉམས་མྱོང་ཕྱོགས་སུ་རང་ལུགས་ལ་བཞག་གོ །དེ་ལྟའི་རྣམ་བཞག་དང་རང་གི་ཉམས་མྱོང་ཕྲན་བུ་སྐྱེས་པའི་ངང་ཚུལ་རྒྱས་པར་ཡི་གེར་འཇིགས་པས་འདིར་མ་བཀོད་ཀྱི་གཞན་དུ་སྨྲ་བས་དེར་རྟོགས་པར་བྱའོ། །འདི་ལོ་ཟུར་མང་དུ་འགྲོ་ཐག་ཆོད་རྩིས་ཀྱིས་རྗེ་གདན་དྲུང་ལ་ཐོན་ཕྱག་ཞུ་བའི་ཕྱིར་ཉི་མ་ཕུག་ཏུ་སླེབས་སྐབས་གདན་ས་ནས་ཕོ་ཉ་མཆེད་མངགས་ཀྱི་ཕྱག་མཛོད་རི་བཀྲ་གནས་ནང་འགྲོ་ལམ་དུ་གློ་བུར་གནམ་རྡོ་ཞིག་སྤྱི་བོར་ལྷུངས་ནས་ཚེའི་དུས་བྱས་པར་ཇི་མྱུར་དུ་གཤེད་འཕྲལ་དང་ལམ་བསྟན་ཡོངས་དགོས་ཚུལ་ཕེབས་པས་དེ་ཕྲལ་དུ་སྐུ་ཞོགས་སུ་བཅར་ནས་གཤེད་ཕྲལ་ལམ་བསྟན་རྣམས་ཁ་ཞེ་མེད་པར་བསྒྲུབ། དེ་སྐབས་ལན་གཅིག་ཉམས་ཀྱི་སྣང་བར་འཕགས་པ་སྤྱན་རས་གཟིགས་བཅུ་གཅིག་ཞལ་ཁྲུ་གང་པ་ཙམ་དང་། རྨི་ལམ་དུ་འོད་ཀྱི་རྣམ་པར་རྡོ་རྗེ་ཁྲོ་ལོད་དཀར་པོ་ཞིག་ཀྱང་མཇལ། ཕྱག་མཛོད་ཀྱི་གཤེགས་རྫོང་གྲུབ་འཕྲལ་དུ་ཟུར་མང་དུ་འགྲོ་རྩིས་ཡིན་ཀྱང་ཕྱག་མཛོད་གཤེགས་སྟབས་ཀྱིས་གདན་དྲུང་ནས་རེ་ཞིག་བཀའི་མ་གནང་ཞིང་། དེ་ནས་བྱ་བ་གཅིག་གྲུབ་ཚེ་གཅིག་ཤར་བ་ཆུའི་གཉེར་མ་བཞིན་སངས་དུས་མེད་པས་འདས་ནས་རང་གི་བློ་འདོད་ལ་ཡོད་པའི་རི་དྭགས་རྨས་མ་ལྟ་བུ་དབེན་པའི་གནས་སུ་རྩེ་གཅིག་ཏུ་བསྒྲུབ་པ་ལ་གཞོལ་ནས་ལུས་རྟེན་འདིར་གྲུབ་པ་ཐོབ་པ་ཞིག་ཅིས་ཀྱང་བྱའོ་སྙམ་ཡང་མ་གྲུབ་པ་དེར་གདའ། གང་ལྟར་གོང་གི་ཉམས་ཀྱི་འཕྲོས་སུ་འདི་སྐབས་ཅི་སྣང་ཀུན་ལྷ་ཡི་རང་བཞིན་དུ་ཤར་བ་ཞིག་བྱུང་། དེ་སྐབས་དགེ་སྦྱོར་སྐྱེ་ཚུལ་ཙམ་ལས་གཞན་དུ་མ་དམིགས་ཀྱང་། དུས་ཕྱིས་རྒྱུད་གཞུང་གི་དོན་ཆ་ཤས་ཐོས་ཚེ་རྒྱུད་ནས་བཤད་བཞིན་པའི་ལུས་དབེན་རྣལ་མ་དེ་སྐྱེས་པ་ཡིན་འདུག <br>འདིར་སྨྲས་པ། བཅོས་མེད་ཆོས་ཉིད་བཅོས་མའི་སེམས་ཀྱིས་བསྒྲིབས། །མ་བཅོས་རང་རིག་རང་ངོ་ཤེས་པའི་ཚེ། །ཅིར་སྣང་བདེ་ཆེན་ལྷ་ཡི་རོལ་པར་ཤར། །ཞལ་ཕྱག་ཅན་དང་ཞལ་ལས་འདས་པའི་ལྷ། །བཟོ་མེད་གཉུག་མའི་མཁའ་ལ་རང་གྲུབ་འདི། །ལྷ་སྐུ་ཕྱག་རྒྱ་ཆེན་པོའི་རང་འགྲོས་ཏེ། །རྡོ་རྗེ་ཐེག་པའི་སྤྱི་གཞུང་གསང་འདུས་ཀྱི། །རྒྱུད་ལ་ཐུག་ཞེས་འཕགས་བོད་ཤིང་རྟ་ཆེ། །ཀུན་གྱི་བཞེད་བཞིན་ངེས་ཤེས་སྙིང་ནས་སྐྱེས། །སྲིད་དང་ཞི་བའི་མཐའ་ལ་མི་གནས་པའི། །མཐའ་བྲལ་ཕྱག་རྒྱ་ཆེ་འདི་རྨད་དུ་བྱུང་། །ཚུལ་འདི་རང་ཡང་སྐལ་བཟང་ཉིད་དུ་སེམས། །ཞེས་སོ། །ལྷག་ཏུ་འདི་དུས་ཟུར་མང་གཏེར་སྟོན་རིན་པོ་ཆེ་བཛྲ་ལ་ལཱི་ཏ་དང་མཇལ་དགོས་ཡོད་ཀྱང་རང་དབང་དུ་མ་གྱུར་ཏེ། རིན་ཆེན་ཆོས་དག་དཀོན་ལ་རྟག་ཏུ་འཚེ་བ་མང་། ཞེས་པ་ལྟར་ཕྱག་མཛོད་དུས་ལས་ཡོལ་བ་དེས། ངེད་རང་ལ་ནི་གདན་སའི་ཁུར་གྱིས་ཆོས་ཀྱི་བར་ཆད་ཤིན་ཏུ་ཆེ་བ་བྱུང་། ཕྱིས་ཆོས་བསྒྲུབ་བཞེད་རྣམས་ཕྱི་བཤོལ་དབང་དུ་ཡུད་ཙམ་ཡང་བཏང་མི་རུང་བར་གདའོ། །ལོ་དེར་བ་བལ་གྱི་ནང་འཁྲུག་སྟོབས་ཆེ་བ་དེ་ཡང་བཟླུམ་པས་ཐོག་མར་དཀའ་ཚེགས་ཆེ་ཡང་རང་གི་འབད་པ་ཆེན་པོ་བྱས་ཤིང་མཐར་འགྲིག་ལ་ཉེ་སྐབས་རྗེ་གདན་དྲུང་དང་ཀུན་རྣམ་ཡང་བྱོན་པ་ཡིན། ལོ་དེའི་སྟོན་གཞུག་ལ་ཀཿཐོག་ཏུ་ཕྱིན་རྒྱལ་བའི་སྲས་བསོད་ནམས་ལྡེའུ་བཙན་ཞབས་མཇལ་ཞིང་ལྷ་ལས་བབ་པའི་དུས་བཟང་པོར་ཚངས་སྤྱོད་དགེ་བསྙེན་གྱི་སྡོམ་པ་ཞུས་ནས་སྐྲ་ཕུད་ཡང་དེ་སྐབས་སུ་ཕུལ་བས་མིང་བསོད་ནམས་ཐེག་མཆོག་བསྟན་འཛིན་དཔལ་བཟང་པོར་བཏགས། སྐྱབས་འགྲོའི་བསླབ་བྱ་སྡོམ་པ་ནི་སྔར་ནས་ཡང་ཡང་ཐོབ་མོད། སྐྲ་ཕུད་ནི་དེ་སྐབས་བར་ཕུལ་རྒྱུ་མ་བྱུང་། ཡིན་པ་ནི་གྲོགས་ཀྱི་མིག་སྲོལ་ངན་པའི་སྐྱོན་དང་རྩ་བའི་བླ་མ་ཞལ་མ་བཞུགས་ཕྱིན་གང་བྱུང་དུ་འབུལ་བར་བློ་མ་ཕྱོགས་པའི་དོན་ཀྱང་ཡིན། དེ་བས་སྔོན་ལ་ཕོ་མོ་སྐྲ་བཅད་ནི་མང་དུ་བྱུང་ཡང་། རང་གི་རྒྱུད་ལ་སྐྱབས་འགྲོའི་སྡོམ་པ་ཡོད་པས་ལྟུང་བ་ཆེན་པོ་ནི་མི་འགྱུར་རུང་རང་གི་སྐྲ་མ་གཅོད་པར་གཞན་གྱི་སྐྲ་བྲེག་པར་ནི་ཉེས་བྱས་ནི་ཡོང་བར་བྱེད་དགོས་ལར་སྐྱབས་འགྲོ་ནས་ཚངས་སྤྱོད་ཀྱི་དགེ་བསྙེན་བར་བླངས་ཡུལ་མ་འབྱོར་ན། དཀོན་མཆོག་རྟེན་གྱི་དྲུང་དུ་རང་གིས་བླངས་བར་ཡང་རུང་བར་བཞེད་པས་སོ། །འདི་དེས་རིག་འཛིན་རོལ་པའི་རྡོ་རྗེ་ཉག་གཤིས་ཕྱོགས་སུ་བཞུགས་ཡོད་འདུག་པ་མཇལ་འདོས་སྐོམ་ནད་ཅན་ཆུའི་གདུང་བ་ལྟ་བུས་རྒྱུ་ཤས་གྲུ་ཁ་བར་ཕྱིན་ཀྱང་ཟླ་བོ་གཉིས་འགྲོ་མ་འདོད་པའི་གཡོ་རྒྱུས་དེ་ནས་ལོག་དགོས་བྱུང་། དེ་མིན་ངེད་རང་གཅིག་པུར་འགྲོ་ཆོག་མོད་ཀྱང་། མི་རྣམས་ཀྱིས་སྨྱོ་འདུག་ཞེས་པའི་ཁ་ཟེར་ལ་འཇིགས་ནས་འགྲོ་མ་བཏུབ། ཚེ་འདིའི་གཏམ་མི་སྙན་པར་དོགས་པས་བསླུས་པ་ཡིན། དམ་པའི་ལྷ་ཆོས་སྙིང་ནས་བསྒྲུབ་པ་རྣམས་ཚེ་འདི་སྣང་ལོ་འདོད་ཀྱི་གཏམ་མཐའ་དག་རྒྱབ་ཏུ་བོར་དགོས་འདུག་གོ །མི་ཚེ་ཡུད་ཙམ་ལ་མི་ཡི་འཕྱ་ཁྲེལ་ངན་བརྗོད་ཅི་བྱུང་བཟོད་པར་ལྷ་ཆོས་གཤའ་མ་ཞིག་དགོས་པར་གདའ་སྟེ་ད་རེས་ངེད་བློ་ཚན་ཨན་ཆུང་བས་བླ་མ་མ་མཇལ་གྱིས་ཕུང་ངོ་། །དེ་ཡང་གྲོགས་ངན་སྤྱང་ཀི་རྒྱབ་སེར་རྐྱེན་ལས་བྱུང་བ་ཡིན། ཆོས་ཀྱི་གེགས་བྱེད་པའི་གྲོགས་དེ་ལྟ་བུའི་དབང་དུ་འདི་ནས་བྱང་ཆུབ་ནམ་ཐོབ་བར་དུ་མི་འགྲོ་བར་སྨོན་གྱིས་འགྲུབ་པའི་དཔང་པོ་རྒྱལ་བ་སྲས་དང་། སློབ་མ་དེས་གསུང་བཀའ་ལུང་རྣམས་ཀྱིས་མཛོད་ཅིག།</p>",
    "ContentChinese": "<p class=\"chinese-text\">供贊文<br>嗡娑帝<br>諸部壇城遍主無上上師尊，諸佛意業合一無與倫比輝<br>飲血明王飛行海生金剛持，冠頂髻者蓮師足下稽首禮<br>彼之心性普賢幻化游戲舞，諸佛智慧直示正道之法門<br>稀有金剛心髓如實善開示，無垢善友光明遍照稽首禮<br>能仁王教飲血尊之大律儀，行持莊嚴蓮花生處示現名<br>開演黑行密咒稀有勝妙道，彼位大師由衷虔敬稽首禮<br>成就銀水少許觸鐵成金般，僅聞名號加持亦能如是獲<br>人天決勝諸德賜予怙主恩，恆禮大証士虛空藏加持我<br>不住寂靜爾尊為利眾生故，化現威儀恆示今時諸成就<br>轉輪聖主憶念摧迷普賢顏，唯一怙主蓮花大樂洲頂禮<br>與彼無別一切諸佛之父尊，密集金剛時輪文殊金剛心<br>不虛真化佛密浩瀚海之主，噶瑪持明尊之足塵吾頂戴<br>如是三恩具力幻化福德名，無二本初佛尊法王普賢權<br>德嚴剎主胎藏化身法王尊，吉祥明王瑜伽那他稽首禮<br>復次灌頂傳續解心續，竅訣口傳引導大師尊<br>示解脫道具恩上師眾，稽首虔禮諸尊祈加持</p><p class=\"chinese-text\">山野間之妙藥自傳正文<br>禮敬諸聖已，茲述吾性。余漂泊四方，業力所轉，雖示現上師形，然未能自主其心，故行種種善惡幻行。何謂幻行？吾等此身念未解脫為法界智慧不動境，念所驅使之行皆成暫時垢染。凡垢染不離迷，故名幻行。雖迷，然為我執煩惱所主之念為惡行；緣無迷法性道之念所行為善行。是故“行種種善惡”義如是。<br>吾所述一切念不離此性，故傳記總義應如是知。今有人揚言神通無礙、見本尊、得空行密語，或具無礙神通等，聲名遠播。然吾無奇特功德可炫。何也？智未壓識，顯心未等味，何況他成就，連冬食不凍之微細成就亦無矣。<br>同為二障習氣重覆，安能親見本尊尊顏？空行授記，據云唯予清淨誓者。吾雖力守誓言，比諸古賢傳記，細微誓難盡如教行，故空行授記於吾輩甚罕。至於神通，雖依上師本尊加持為基，修止觀、練脈氣明點等，或因宿世微障習而有知他心等相似神通，然吾不具此德，何有神通耶？<br>無現證功德而佯為有之，乃犯上師大妄語根本墮罪，為無間獄薪，吾無此膽，豈敢妄言？傳記雖為引生信心，然吾無多奇事可言，故勿厚望於吾。<br>既不足述，何費時為文？因愚信再三懇求“請述汝經歷”，為消此擾，且為自行參省，亦可助人取捨，故略述吾因善業習覺醒，不縱心野蠻，盡力為法修學，略向解脫道靠近之實況，無論奇特與否。<br>聖者有德而謙，偽者無德而矯，各隨本性。吾自知非上等聖，無奇德，不必謙。雖當降伏煩惱我慢，然未得無生忍，又生濁世煩惱熾時，實難降伏。非聖者，然依宿福與根本師慈，信佛語，不懷私欲欺人為虛，昔亦未做令人悔事。<br>故自知己，略述特殊經歷不為非，直言如在閻羅前，無增減之語佛亦許。然經云善如幻，雖無增減，若引眾入邪道或洩密於公眾等，則不應為，因積難忍惡趣因。<br>若吾出離持明者自傳有此過，於諸佛菩薩前懺悔，祈請加持消除今來障。<br>既立誓著述，本文分三：略述宿世因緣；今生依前業願緣所行善惡粗述；及今後專注解脫聖法，淨願行廣大利他事業之發願。此三以基道果安排，先述綱要如種子焉。</p><p class=\"chinese-text\">山野間之妙藥基道果建立品<br>如何解釋基道果耶？輪迴與涅槃諸法，無餘盡攝，一切現象之本源，無始無終，離時之本性，名曰本初者，乃離一切戲論之智，無為法，言思所不及，本空無根，本淨，法之自性光明，大基法界也。自此基現任運成就之門無礙普現，本初之普賢，超越基而入基現之清淨門，自證大智，未曾為障所染，未曾為迷所惑，不迷而自知自明，諸佛共尊，普遍祖先，任運大明點，自淨自覺，最勝普賢也。<br>住此不動中，離偏局執著，廣大周遍，萬象之主，萬物之精，至上精髓也。依此加持大悲力，虛空無際，諸有情悉能成就解脫與一切智之果。唯須除去暫時迷妄之殼，顯現本有自性如來藏耳。<br>除此暫垢之方便，乃如來藏之光明，名方便續。諸佛善巧大悲事業，以自然光明成就，使一切眾生入大菩提之地。依垢淨淺深，次第分凡夫信解行與見修究竟道之聖者，大乘與聲聞聖凡、獨覺聖者等，斷證高下之無量相，與諸佛幻化應機示現不可思議身，為眾生而現。<br>此理唯正等正覺佛境，非餘所能思量也。究竟所證之果，亦無增減，本初俱生如來藏，自性明覺深明大樂菩提心，真如界得現證，於自處解脫，稱為斷證或離或成熟究竟之果，清淨安樂常我到彼岸，普賢果位也。<br>雖現證佛陀形相，應化身土願各異，然究竟法身等味，離二現，本質唯一。為初學者易解，略舉譬喻：如瑜伽師夢中變化熟練者，一身同時化現四八十六等無數身，各顯不同作業，然本質乃一夢中人之變幻。瑜伽師於夢中或現實中變化身形時，二現未滅；得證初地者，百身顯現入百佛土等，雖斷現行二執，然微細習氣相續尚存。上諸地亦然，佛位時徹底斷二現，三密遍虛空，故究竟佛陀不可以一異分別觀察。<br>是故，超越所緣思量，為不可思議之境，真實智慧所知之境也。</p><p class=\"chinese-text\">山野間之妙藥基道果總攝品<br>茲言：<br>普基阿賴耶遍一切體，本淨本初智慧實相義，<br>不迷自生諸佛普賢尊，唯一通達普遍大樂境。<br>離戲光明不動平廣中，無需勤作利生恆不斷，<br>廣大事業窮虛空邊際，一切諸相法身界中者。<br>超越思辨智慧之疆界，輪涅等味離一異分別，<br>暫時二現垢染所縛者，輪涅各別苦樂成實諦。<br>如認夢幻迷輪之本相，二現自性本不成立故，<br>自性他空法界藏之界，三時流轉無增減消長。<br>若安彼自性無分別界，分別垢染於法界中解，<br>本性智慧界中等持住，熟修此者名入道瑜伽。<br>除盡暫垢本初之實相，任運成就大法界正性，<br>自相自解身與智慧力，完全開顯名為果位者。<br>如是因道果三勝義界，圓滿真實秘密之義理，<br>略解此義亦能增大智，此理今時難為他所悟。<br>然因宿業願力根本師，慈悲加持大車諸聖者，<br>加持之力無誤解此理，以少言辭明淨攝而說。<br>窮生聞思有譚之學者，乾澀辭章繁複戲論者，<br>難得之理唯依上師尊，精勤瑜伽定當能證悟。<br>如是總綱之式，為吾與無量眾生成就無上菩提所應知之基道果建立，已略示如種子。今當敘述自身證悟，分三大義：</p><p class=\"chinese-text\">山野間之妙藥前世因緣品<br>對於問吾前世境況者，吾前世所處，推今之態而無增減言之，其實如是。蓋本初自性，諸佛眾生共基，離思維言說之境，超越時分方位，於相乘因乘，名曰無始輪迴。從基而出，基顯任運之門，極微風動，不能自識，入不淨輪迴之門。因風心性具粗重煩惱，現器世間有情，十二緣起輪轉不絕，三界輪迴中，苦不可盡。<br>或因瞋恚，生地獄中，感受極熱極冷無量苦痛；或因慳吝障礙布施，生餓鬼道，為飢渴所煎；或因愚癡，生畜生無數種類，昧於理性，被役使，苦無窮際；或因嫉妒，生阿修羅中，鬥爭苦惱；或因我慢，生天界而死歿墮落，諸苦逼迫；或因貪欲，生為人類，受生老病死苦惱。如是輪迴諸苦處，次第受報。<br>或一生地獄，其時長達無數大劫；或恆河沙數劫中無間斷受大苦；或一日夜間生死數百次，為劇苦所逼；或因善業，生於善趣，為王臣妃妾、居士、婆羅門、庶民等，享受種種安樂，終無實義，福盡還墮，大苦所逼；或於一世中，上至天人之樂，下至無間地獄之苦，交替受之；或得世間禪定，耽著禪味，住於大劫；或生無想處，無諸心想，住於有數無數劫，後復起心，仍受諸苦。<br>總之，三界高低處，雖有樂受，不可恃賴；雖有苦受，亦無逃脫之機。無間旋轉，種種樂苦，實不出苦苦、壞苦、行苦三苦，漂泊輪迴無有邊際，時長難思。十方世界無量無邊，不可言此生彼未生，此土彼土亦復如是。吾身遍歷一切處所，無有少處未曾生死，如佛所說。若積聚生死中所得血肉之身，唯此娑婆界所受生之肉骨積聚，已等同須彌山量；膿血亦如大海；業力積聚，不可思議。是故一切眾生，無非吾母，亦無非吾父者。<br>如是無始以來，至於今日，無義漂流於無際苦海，極為疲困。此乃吾與一切有情各自生死之因緣，不出於此。依如來聖教而知輪迴實相，當晝夜精勤發起厭離之心，決志出離，修行解脫之道。此為自他一切眾生之告誡。<br>輪迴自性雖非實，輪迴境況眾苦纏。<br>輪迴無始超時境，輪迴共業無盡邊。<br>個別因緣終可出，解脫一得迷輪毀。<br>長久漂泊疲倦者，今當趨入解脫道。<br>雖知此語難自踐，願發淨心勸眾生。<br>如鸚學語樂宣說，才旺諾布歌聲是。<br>如是，吾心相續為輪迴苦所逼，於某時因緣際會，修諸相順善業之力，得聞佛名一次，清晰入耳，獲大利益。由此因緣，如來藏性本俱生於心相續中之種性力稍得覺醒。自此之後，多生於善趣，行諸善因資糧，然因宿業餘力亦行不善，間或墮惡趣，受諸苦受。<br>再後，因累積眾多善業資糧之力，及諸佛慈悲攝受，於六道任一處得遇佛陀珍貴教法，有緣於三寶生信，種下習氣。依此善業之力，後入佛法，有緣修行大乘聖法，復因此殊勝善業之力，得遇佛法精髓果乘密法，獲得具足六大種金剛身，雖因懈怠未能於一生證得佛果，然因具足對上師之信心恭敬，發善願種下習氣，依此功德，今復得此暇滿善身。今後未知如何，故此正是精勤修習聖法之時機。<br>如是，吾才旺諾布善思而言，所述生平因緣，皆是真實，實是如此。<br></p><p class=\"chinese-text\">山野聖藥前世略述品<br>茲述曰：無始以來本俱之身，業習輪迴之苦恆常侵擾。一旦由佛陀悲心所感，生為善業之種，僅聞佛號，長久得善妙安樂之機，及至信心種子茁壯，是為解脫之階梯。其後積諸淨善，獲此六大金剛身之暇滿，有緣遇密法之果。然懈怠懶惰，雖未得大樂，密乘戒律為大者，其精髓為對上師之敬信，如法持守祈請之力，確信得此圓滿暇滿。吾本凡夫愚童，直言如是。故意修諸佛總集尊，上師恩德何能報？嗟乎！入密乘勝道者，如蛇入竹筒般，此重戒當勝百命，敬師為要，此乃遺囑。無有表裏，務求悅師，常行善願，回向無上菩提，二次第雖勤勞微弱，不久當證菩提勝果。若違此道，縱勤二次第，不成佛道。離師敬信者，必墮惡趣，當知之。暇滿之身如水泡，須臾即滅，故速修正法，此吾衷言。六道高低之處，苦樂難以盡述，皆無實義，今應入永樂解脫。捨此身後，未知何生，勝依暇滿、大乘密道，今生僅此一遇，智者莫失寶珠。無始以來至今，徒勞無功，今厭輪迴業，奪大樂要塞豈不宜？<br>如是述已自性生平，今言依附託生之狀。幼年三歲時，人言吾為虛空藏，修行處為羅札卡楚，又有諸多前世俗傳，皆童言無慮，隨口而出，非他人假託。因此被尊為轉世。實則童言戲語，何足道哉！尤以大尊虛空藏已證大手印，成佛往生，如彼化現，吾豈堪？稱比丘虛空藏，無非童言妄稱，實則凡夫如吾，豈堪考究？然若尊者為攝受凡俗弟子，以願力示現利他，未可限也。<br>蓮師多處伏藏授記，及諸根本上師、成就聖者同聲言為虛空藏化身之一，若然，願如是，自亦以此為願。究實，大尊虛空藏即密主勇士心金剛，本初即成，不可思議。近侍弟子、大乘大師功德光、殊勝王子寂天、持明大師吽迦羅皆為虛空藏之化現，諸大師言之，並與吽迦羅師徒相連。或為真身，或為化基、心續一如。<br>又，藏王阿吉松贊時，漢子桑什達為菩薩馬鳴化身，由漢地具通師授記，轉世為漢地引入大乘經，此傳承為虛空藏，如羅日南卡瓦傳記所述，心續一如。真實馬鳴菩薩即馬頭明王，其化身桑什達，轉世為烏如修行者，比丘密咒成就王佛音，眾所周知。<br>虛空藏於凡夫境示現身轉世，其前世於天竺婆羅門種，父功德成就、母王族智慧吉祥，為婆羅門札達，遇無量光佛化身蓮師於馬庫達岩洞，以金曼茶羅灌頂，密名虛空金剛，授記下生藏地。後於藏松布日山東尼雍隆，母為沁氏光嚴之子虛空藏降生。一說降生於涅地沙姆杜卡，然生於隆地較確證。<br>依時輪師計算，釋迦牟尼般涅槃後約一千五百年，天竺東方烏魯毗沙婆羅門種生黑行者，年八十餘，於近羅札名提普拉地，捨報身於中陰成就為喜金剛，百年後此成就師於藏隆降生。成就師初為文殊化身赤松德贊王之臣，後篤信正法，邀請鄔金大師入藏，並拜寂護為比丘。<br>一日，至持明蓮師於雅卓祖珠冰川駐錫處，獻金曼茶羅，大師問：“虛空藏安好否？”眉間放光照虛空藏，暫失知覺，甦醒後加持憶宿命。後至馬首白顏、心處羅札卡楚，藏地提毗柯達，喜金剛俱生父母岩自現明顯處，麓有形如白螺之岩，卡楚鐵鉤處，灌頂於正等覺壇城，密號心金剛。後往天竺金鳥蔽岩洞，遇正等覺傳承持明吽迦羅，精通無上母續，修證成大成就者，返藏。主修於卡楚及涅地格日等處，久修示行。<br>依授記娶藏塔納謝卡多傑措尊為事業手印，行三種行。亦依蓮師教誡依靠空行智慧湖皇后，證得無變大樂手印持明位。於凡夫所見，粗身住世約百餘年，最後報身如虹消，智慧身與虛空無別。如是證得密乘大手印持明果位，密乘本道證第八地，倚密乘方便殊勝行，與唯依顯教第十地菩薩境界相齊。顯宗第十地功德如《十地經》金剛藏菩薩所說：得無量總持三昧功德，生長利樂眾生一切功德，如佛隨意變現種種化身利益眾生，證知法界自在，異熟果為大自在天主，淨居天王。初地見百佛，動百世界，現百化身等功德，此地則見說不盡微塵數剎土，證悉地亦爾。智慧方面，證得隨順佛陀一切智位，主修般若波羅蜜多。如前所述，三淨地中第十地聖者之色身事業與佛無異，故功德難測也。<br>頌曰<br>聖者所居尊者傳，金剛舌者行境外，<br>凡夫愚童欲覓知，如蜂振翅測虛空。<br>彼行不思議境中，思量徒勞自疲勞，<br>是故希有無量處，敬信彼生強烈心。<br>圓滿勝果必成就，疑慮何有當精勤，<br>吾亦生生世世中，一心祈請發宏願。<br>如是大成就師既成遍空智慧本性，誰能測其化現？然於特定所化處名聞如水中月影，顯現為異亦為一，非敢盡述。凡夫如我，謂有聖者連珠，極不雅，如稱殘疾人腳為如意寶，或不當以乞丐癩病者為轉輪王，當知極不善，為今後痛苦之因。<br>頌曰<br>誰將癩病乞丐輩，轉輪聖王名相稱，<br>向轉輪王臣民道，豈不王法所危及。<br>至卑凡夫庸常愚，初機愚魯之輩流，<br>周遍惑染癩患覆，淨善圓具寶不持。<br>千劫積修功德後，自利法身證者尊，<br>利他七寶兵力具，誰言如是勝者名。<br>倘若私欲主宰人，尚有王法森嚴在，<br>輾轉多生地獄法，當知此理應謹慎。<br>雖然如此，恩重上師金剛持與金剛薩埵無二聖者授記，密乘金剛上師語當如佛言，真實無偽伏藏授記，皆不誑金剛語，故自敬信而言之。伏藏授記明言：喀切婆羅門寶金剛、達波修行者、羅日南卡瓦、卡託強巴布、扎日喇嘛強布布、羅札上師阿瑪、塔龍桑傑溫、卓隆巴多傑嘉波、伏藏師強布林巴等。其他若為持明蓮花寶之轉世，則康伏藏師能鬘降魔金剛授記：祖窮拉西札、伏藏師札巴金剛、堪布敦桑波、卡託策林布、遍智桑傑帕、吾狂貢嘎勒巴等均為化身。吾師悲賜之言：覺囊遍智多羅巴心子瑪底二者之一，及覺囊尊者加持者，吾於此有極深習氣。復師成就者言：汝為博學藏那巴轉世，吾亦有習氣殘存。此為特殊化現簡述，然未盡言。藏地虛空藏化身伏藏授記甚多，難以盡錄，茲不贅述。<br>實則自觀己心，上述化身莫言，連化之一分亦非，得智慧者雖作戲言，實為利他，不可輕聖言。佛緣殊勝思而述之，非虛偽或我慢妄言，直述實際生平如前。<br>間頌<br>勝佛境界已臨近，為導群生現色身，<br>應機影現千百狀，大悲行境於此何。<br>吾為虛空藏化身，徒有虛名實非是，<br>聖者生連如心寶，明珠瓔珞極莊嚴。<br>凡夫如吾殘足似，絕無美飾之可能，<br>然而寶玉觸鹽石，鹽石亦似八德河。<br>蒙尊名號灌頂力，遂受彼尊加持入，<br>為彼事業之僕役，願渡眾生解脫岸。<br></p><p class=\"chinese-text\">前述大士之先後興替次第，為辨無誤，略敘時序<br>婆羅門寶金剛足下，生於現世喀切地，為婆羅門學者哈日拔札之子，師承小因陀羅菩提，依本尊勝樂輪獲得成就，創新勝樂修法一派。其師因陀羅菩提，疑為圓滿大圓覺密心要派，毘摩羅所敬奉之因陀羅菩提也。婆羅門寶金剛與那洛巴少時為友，後於毘克拉瑪寺為六門學者之首，晚年往鄔金國，成就虹光金剛身。此乃虛空藏入涅槃數年後之事。<br>達波修行者策林寧波，為無比達波喇嘛之族裔，較時輪法王與帕竹年幼六載，亦為喇嘛晚期弟子之師。幼承大手印證悟。此乃喀切寶金剛入虹身六十餘年後之事也。<br>羅日南卡瓦者，明主寧之伏藏中言為虛空藏轉世，然當時亦多有虛空藏化身之授記，故於諸多化身中確認為心之化身也。與明繞巴同時。為掌護眾生之怙主尊達登札之心子，授記此身遷滅後成為虛空遊戲佛。授記其直傳弟子羅日上座桑傑索拉者為心之化身，顯示甚多稀有事業。此人生於達波修行者圓寂之年或其前後。<br>康地卡託強巴布，列入丹藏強三之一，曾得丹巴德謝足下，主要依於藏頓獲成熟解脫功德。藏頓圓寂後繼卡託法座，攝受廣大弟子，包括嘎瑪巴錫亦為其徒。蓮師授記為虛空藏化身，同時授記天竺來之幻化觀音米札卓吉為黑行者轉世。彼亦自述多世，生於羅日南卡瓦前後。<br>掌護眾生扎日喇嘛者，生於衛地悠波宗，為哲洛繭之姊弟之子，根本上師為洛繭達瑪旺秋。於布日及藏隆雪卡波秋隆等處利益眾生。後期駐錫於闊聽寺並重修之。此人生於羅日南卡瓦示寂之際。<br>羅札上師阿瑪者，出自給頓氏族，為伏藏師古汝秋旺之心子，秘密中行廣大利益眾生，然顯相中事業未廣。總之，生於扎日喇嘛晚期。<br>塔龍桑傑溫者，本名札巴巴傑，為桑傑雅盛之族裔，於北塔龍崖面發掘蓮師空行八環繞之伏藏。二十六歲時前往康地，創立日沃切寺，利益眾生極廣。此似為卡託強巴布圓寂數年後之化身。<br>卓隆巴多傑嘉波者，伏藏師無垢峰之本尊授記太陽光明中言：“今之努班虛空藏，為直汝多傑嘉名馴野獸者。”開啟聖地提卓白崖，亦為直貢舊法派之始祖。住世六十八載。<br>芒波伏藏師強布林巴，生於卓隆多傑嘉波圓寂次年水龍。少時修習幻化寂怒、央忠派之心法，後據伏藏師策展嘉措所授藏圖，二十五歲時於上地白摩白塘之魔湖西北，從如鷹喙之岩獲普賢心伏藏，晚年駐錫聶南金谷。據其伏藏記，時有三虛空藏化身，彼為心之化身。與持明卓丹堅與桑傑林巴同時，雖未面晤，然弟子互通，交情甚篤，互相聽受伏藏法，並共傳聖物。<br>如是伏藏記載之大概時序，及能鬘降魔金剛授記中之祖窮喇謝札，乃於前譯派教法極負盛名，修脫二法獲不可思議能力之藏地大成就者。伏藏師札巴金剛，據說為空行意集伏藏發掘者，然與札修秋吉多傑是否同一人尚待考證，其餘未詳。堪布敦桑波巴者，為勝行法王八思巴之族裔，薩迦世系共祖，極為顯赫易知也。<br>卡託策林布前後有二，前者生於嘎瑪巴若巴多傑晚期，攝受多有緣弟子，弘揚教伏諸法。其弟子為卡託秋布，再傳為布波耶謝嘉措，再傳為強森秋傑，再傳為貢秋嘉措，再傳為後期策林布，晚年開啟貢隆聖地並建立修行寺院。康波嘉繭南卡秋吉嘉措亦為此人弟子。<br>遍智桑傑帕生於藏隆大聶，初入隆強千寺院，名為強千繭卻巴。後在雜魯宗卡吉摩察建講經院，藏地多數講經院皆由此分出。其弟子奉為寂天菩薩化身及藏隆美頓尊波轉世，《入行論》發願品詞義中似有授記。<br>吾狂貢嘎勒巴者，生於薩迦宗族，據傳證得寧之炙紅心髓千萬遍。依載石壟那繭巴強巴盛集與其相遇於雜魯吉摩察時，以道果派術語言“諸法匯聚成無分別智慧降臨”。記載於那繭巴傳記中，故時與吉摩察下院創建者秋傑拉旺洛卓同時。覺囊遍智多羅巴心子二人中，應指薩藏瑪提班欽。覺囊尊者之前後轉世與卡託強巴布之生平極為相關，心續亦為一體之師徒關係。<br>學者藏那巴者，生於藏地覺摩那嘉之西那布。師承格西強巴秋義僧格。為心子僧格九之一，本名圖傑僧格。雖得文殊成就為獅子中獅，然因宿世緣及當時不隨俗，故俗緣甚少，學法弟子亦不多。然其學者盛名至今不衰，身於藏托嘉去世。其骨灰如食之可增大智慧，至今人猶尋食。<br>如是與此諸化身於世俗中因善願力相連，吾稍獲加持，深信不疑。就勝義諦而言，根本上師授與俱生智慧自性時曰：“諸佛之身與具續上師之智慧，即此深明不二大樂自覺，勿別處尋。”大手印頓超見地諸瑜伽師皆如是承認。若然，虛空藏幻化大士之心智與吾心性本質相認之時，本來無二一味。若如實證得智慧，則如是矣。然吾雖未證，依微細體驗或理解，於此借空性廣說，符今時多數法相通俗之法，多所自誇也。<br>頌曰<br>一切有情心中具，圓滿最勝法界智，<br>諸佛本來普賢尊，何有差別分別異？<br>一切有情佛本然，勝義本質輪涅同，<br>世俗客塵淨未淨，差別分位同體性。<br>了義經續論中說，真如如是信解生，<br>爾時怙主虛空藏，遍空本性我何殊？<br>法性安住雖如是，士夫道諦有差別，<br>大乘密道諸瑜伽，灌頂智慧四道時。<br>無作離思明覺智，自識自知轉依力，<br>加持上師得時候，現相因師亦覺光。<br>勝義上師體明樂，自覺證知此相見，<br>非是各別有分離，諸佛法身住此間。<br>一生成佛近道者，一切志願同聲說，<br>爾時我亦師恩力，灌頂四智道次第。<br>顯時分位解知故，普賢蓮師根本師，<br>世俗道時敬淚流，身命不顧能捨棄。<br>勝義上師心法身，明覺自性界中同，<br>大聖成就虛空藏，我心體性何不一？<br>化身再化雖非實，瑜伽體驗意滿時，<br>法性勝義相關談，空言亂語有如是。<br>彼法戲謔狂態中，如實本性空與針，<br>海中漩渦同相比，物同名異言不違。<br>一與非一別執此，狂人歌曲非正量，<br>淨飯即是本俱界，熟緣善者師恩力。<br>修善體驗暖成熟，如實證時分味香，<br>經續多論淨水調，聞修雙運腹中飲。<br>種種無違根亦適，寬廣安心狂歌唱，<br>名言乾詞相違相，思辨疑惑隨樂取。<br>然於勝義離二現，如是來者勝道宣，<br>世俗諦中善惡幻，現相不雜顯不阻。<br>中間歌中所言也。<br></p><p class=\"chinese-text\">茲欲再述餘緣<br>予未生之前，譯師貝若札那之心化身，持明眾之轉輪大王蓮花大樂洲尊前，曾宣密意言：“今後三載已過，四五之間，此地當有聖者之投胎。”眾人多以為戲謔。及至四載內予生，彼尊眾弟子執信予為轉世者，專心敬奉。又此地如地鳴然，持明蓮花摩尼之化身在焉，聲傳四方。<br>然舊族後裔，如尊者善緣等，雖表不甚關切之態；其他居主位者，多依上師授記顯露本色。本性深廣智慧，若見他派轉世，則甚歡喜，如後聞余叔父上師紅札西之轉世出現，送迎酒及緞緣等。若本派轉世現世，則不甚喜，此乃人性族類之常，不足為怪。予亦不論信與不信，毫無希冀，故無怨懟。予自對轉世亦無喜好，彼等安能責之？彼等行世法，以相反儀仗，對假託他派者親近禮遇，對己方轉世上師，若不能蔑視，則竭力為之，此實奇哉，故而敘之。唵嘛呢叭咪吽舍。<br>時此地有斷行者烏金豐措，後為伏藏師雄札多傑傳承者，事業興盛時，彼對此方前賢文札大海，蓮師授記為十地化身者，其轉世為天法不變金剛，眾所周知，彼又立新判定，復為高中下眾多人作轉世授記等。時有示意予為蓮華摩尼者，眾皆疑惑，舊族後裔亦應為此疑惑，然實際情形如前述。<br>事實上，予自感覺曾為覺囊見行持者，與噶瑪巴父子似有大業緣。其他若有依稀憶及往世者，少年時蓮華摩尼之習氣雖據傳甚明，後自心中，他習反厚，直言之也。再者，持明蓮華摩尼自記云：“化身生於南方，持圖為眾師。”南方一詞，泛指多康中地卡託南為贊日，如伏藏師虹身寧波之授記云：“卡託南有寶名，稀有具智悲，若遇聖法者，速證成就也。”授記持有者自修地贊日南為卓洛，如所集精要如意寶授記云：“多康聖地中最著，卓洛北方卡託南。”此明贊日在卓洛北，故贊日南必為卓洛，親見為證。此外，中康之南，中藏之南卡、羅札卡楚等，不但通途甚多，且實際轉世亦持用伏藏，為眾生之師。若與予一瑜伽凡人不同，故前除上師外，無人望於予，今亦莫望之。予自對是否為持明蓮華摩尼轉世，無絲毫分別，今亦無有，此真實之理也。<br>後予年約十五時，伏藏師雄札多傑至虎谷弘事業，據己所藏記及心智，讚予無量，謂實為持明蓮華摩尼塔，且為虛空藏之真化身，深藏之主，斷然言之。欲與相見，然未得機。<br>凡夫難測凡夫，聖者亦示不知聖者之理，多見多聞。彼於予亦須言諸多者，實為心真也。<br>頌言<br>世呼予為壽命寶，究竟實義實無依，<br>善亦法性本然耳，惡亦法性幻化耳。<br>善惡皆是自心立，自性自己明了知，<br>不知亦從心安得，他言奔逐無須要。<br>真實誰能知之難，妄知徒勞何所據，<br>不知住於捨中妙，若有信者親受之。<br>淨納之輩定善緣，無緣倒見何足奇，<br>於我少有差別想，有則無依界中現。<br>若無本性實理存，無論如何自心安，<br>誇大豈非繩索耶，若為空謊如是也。<br>如是有人傳予為蓮華摩尼轉世，上族後裔中，有上師昆桑者，乘朝聖時，欲訪予之狀，先謁持明大師能力虎裘足下，請示法命。尊前言：“贊日嘎附近白螺岩修處之轉世，必為利他事業者。我功德之教化弟子，授記此方會出，亦應為汝等上師之轉世。”言之。不久，持明大虎裘入寂後，復往覲持明力持伏藏師遊戲金剛大師前，專為此事而往，彼尊言：“與尊勝蓮華摩尼為一心，亦為持明力持密主加持之化身無疑。”如是授記。<br>時有他人無簡擇於轉世，如隨兔聲喧者，此非其類，乃如實觀察者，與一般後裔不同，為尊貴族裔相宜，有賢德之儀，堪為隨喜。後裔昆桑雖未對予致敬，然其返自衛藏時，予初至住所，示與昔不同之由衷喜敬，似因此事，時唯覺莫名。後知上述情由，皆從持明遊戲金剛侍者等可信源處聞之。彼從持明大師處，亦曾獲此法命之文字，據說，然至今未得見之。<br>縱然如是，若無不愧於己及無隱密處之確信，僅依反覆推測及不斷授記，亦無大益。予亦無如是差別。然諸位聖地定住之尊聖中最聖者，化身伏藏師持明具德等，同口授記予雖最下凡夫，為攝受故，授予聖者之印，故非自傲無顧之態，實為自慶善緣者也。<br>兹言：馬勝喜金剛尊虎裘，金剛飲血體性大樂洲，密主金剛勝法遊金剛，三者授記薩羅札之花。善劫遍入頂上結之時，自欲矯飾劍所不能怖，二利甘露盛宴隨處得，此能具力何人恩德生？<br>余雖於何轉世見與否，或有指認或無所指認，名曰化身或轉世者，始自母胎結成，自然流傳，又余五歲時述前世諸事，是得淨心，能憶前世類，非父母親族所密授之矯飾，亦非恃勢詐善假偽所為，亦無徒眾施主所造，上族親徒所欲改者，如割毛髮之百分，皆不必，如上已明。此理下當詳述。<br>頌曰<br>世間諺語如是說，何人亦無造作者，<br>自然而生自己事，自然金剛若稱是。<br>然無真實何所有，真偽皆唯分別量，<br>微細暫時疑難存，自覺真偽未嘗染。<br>實諦之義唯如是，有寂皆假盡而言，<br>我真彼偽到底處，故而寬廣豈非樂？<br>總之，當今有多論上中下各類之轉世，余昔未曾修得純淨善見。若憑憶宿命之力，趨入上師之位，則必應憶念三寶淨信，及施捨善惡因果取捨持戒，於上師敬信守戒無有表裏，知聞正法，修習禪定等，當如法憶念行持諸善習氣。非如是，或由偶然僅言轉世，或認親族友人或物財等為憶念處，而稱為轉世，此豈能成真實轉世？余與己同者皆作是思，生厭離。後觀察思維，生是念：佛以方便善巧攝眾，加持差別故，吉祥噶瑪巴父子，直貢竹巴等噶舉派諸轉世身，及教主吉祥根登尊勝仁波切傳承，主要文殊梵天天花之化身父子大上師等。此等大者，皆依烏金上師授記，一燈傳一燈，如一模出佛像，傳承不朽，此乃最勝希有境。又有諸佛聖者住地者，為眾生發願力現化身，憑宿世不壞覺力，明見轉世生命，此等最勝化身，於舊新派中，往昔至今，散現少數，敬信不可分，如同諸佛。自欲得如是境，努力修二無分智身圓滿因，生此正願。<br>又修行者憶宿世，勤修善果者，亦近聖地，有無偽堅固信心，普皆敬信。聖者心量如何，唯佛與佛子應量者境，非他能測，無諍授記之大士，一切所為即智慧遊舞，超越思量。否則，雖傳凡夫轉世，若如法修行，亦生不可思議憶念，生信毛豎，此我心中已生。<br>頌曰<br>嗚呼！<br>諸佛為利有情故，隨何所化身亦現，<br>住聖勝地諸大士，多生世中何不示？<br>廣大恆常無間滅，佛與佛子行境知，<br>種種色身無量數，執著妄度實戲論。<br>聖者幻化超量度，隨隨調伏示遊舞，<br>裝學亦裝愚鈍狀，賢善放蕩皆能裝。<br>寂靜忿怒亦能示，粗猛細微任所行，<br>自在遊戲大幻術，我聞思量真稀奇！<br>自心淨見引道中，敬信之境雖無量，<br>隨他而顯詩句中，如回聲知豈不盡？<br>然而淨願純善故，無有違義必真實。<br>總之，當如是了解：非依前世曾善之名，而於初生時，必為授記量成，一切所為皆智慧遊舞，應修淨見。若見過失，當知是自現之過。量授記者何？佛於經續雖多授記，唯一二明顯，餘多難知明義。凡夫略具他心通者，不如佛語作證，故蓮師語不異佛語，其授記無疑、無爭、無時改者，乃足信可恃之記，如云：“是否依上師記定。”故於真伏藏出之授記，具他心通之公正士所認定者，即為聖者，一切所為皆智慧遊舞，應修淨見之義。其他今濁世年華炫耀者所說授記，謂現證、夢境、他心通及假言伏藏紙所出之雜語，如風亂舞，現世希懼如夏水擾動，奉承阿諛奴顏，授記為神魔者，不值一草芥之比，餘不言之。然勿輕金成銅，勿以銅混金，二者皆不可，審察辨別尤為要。但今無察餘暇，愚夫唯隨名譽而已。<br>其餘證量聖者轉世之事，具智戒善本性，為眾上師者，不可妄議。除此，若僅是否為轉世，無須深辨，今世三律儀清淨，三慧具足，無私利之增上意樂，勤弘法利生佛教，能演法行者，能攝有緣福德者，疏無緣者，非授記好壞之所審，縱審亦無能力評其是非。<br>頌曰<br>或有聞名轉世者，故意數數行利他，<br>顯勝眾生之上師，聖者彼等豈不讚？<br>有些三學力具足，二利任運自身得，<br>佛教命根無損持，雙足獅子實決然。<br>縱非如是真實者，圓滿正覺蓮花生，<br>教言如實所授記，所行定視智慧也。<br>由是，我等所傳轉世者，今得此暇滿身，莫致虛擲，若不依佛教如理修行，僅憶模糊宿世，亦非大奇，當自省之。若僅憶宿世能益，則常人中有憶為馬牛烏鴉者，或有南邦人憶為蟒蛇大象者，或有明憶財物親屬者甚多，余曾目睹。此等若今生不修法，距菩提心連毛端百千分之一亦不近，實證可知。甚至外道瑜伽師大力者，有憶八萬世者，然彼未證無我故，不成菩提因，佛如是言，則憶朦朧宿世豈足為奇？<br>然究何故，往無漏金剛身之士，及多數證大成就者，與守佛教大士之極大智者、戒德者、聖者等，彼等多憶宿世且根據此，甚至成為最勝化身大士者亦有？然自始既稱轉世、化身，而陷放逸供養泥者，絕非上等聖者之行狀，察其傳記履歷可知。此理乃諸佛菩薩大力故，住聖地者，為熟淨眾生，初無轉世化身之名，加持為凡夫相，利益顯密廣大同類眾生，其態或為他人所不知者居多，或滅後久而知者，或滅後即知者亦有。<br>同樣，魔之化身現阿羅漢或成就者及大菩薩相，似為正法實改法要，害教害眾者，暫為魔力所加持，難為他識，有滅後方知者，如昔印土比丘大天及魔現善比丘者，臨終前此相不為他知。又聖者真實化身極不明顯之相，及種種假冒者為黑方鬼魅所乘而能清晰言前世事等，皆難分辨，當知應曉。又有些以語辭偶合，名稱聖者最勝轉世，引其後世等，多屬虛名。有少數確如實轉世，由緣起妙理而然者，亦所見也。<br>又有傳為轉世，初雖表現甚佳，而漸趨惡劣者甚多，此乃凡夫自相、隨聲附和，實為嘆息之由。故我等小德食施之輩，名稱轉世，略憶前世，莫若全無轉世之名，自心誠以為善。<br>兹言：<br>自幼知識通曉時，前生記憶信悅然，<br>屢探試思能憶否，不能憶時悵然起。<br>今思己身深自愧，生憶於覺未近時，<br>憶起何為生歡喜？妄心惡業復增添。<br>是故證覺求成就，生憶少益不憶佳，<br>何故妄心傲慢少，彼於菩提成就近。<br>往昔所積白業緣，繼續修行能成法，<br>前世生涯憶與否，不憶亦安善莫疑。<br>今時僧俗多貪求，稱願宿世為勝大，<br>審思詳察實勘驗，無益虛談豈不然？<br>阿羅漢尊羅睺羅，住於須彌層級中，<br>曾為龍蛇所轉生，量教毗奈耶中載。<br>藏地嚴飾米拉尊，生憶化身不許然，<br>敬信苦行護戒故，雪域成就為第一。<br>普觀成就與智者，教法燈炬諸聖賢，<br>幼從供養泥中溺，稱為轉世形相少。<br>生生轉轉雖名著，慢智詐稱成就者，<br>或因空性慈悲少，或因戒律三昧缺。<br>空行餓鬼毒魔形，轉世折磨諸眾生，<br>自古直至於今日，聞此心思起怒嘆。<br>無偽憶念前世者，稱為轉世亦有傲，<br>因果三昧粗疏故，惡趣泥中躍可悲。<br>是故慕好善生者，暇滿勝依獲時此，<br>因果取捨無謬誤，護戒精進最為良。<br>歌頌此曲請善思，真言絕無少虛妄，<br>生憶無益是如是，思已莫生妄心念。<br>憶及前世尚無大奇，況他人藉父母詐教而冒為轉世，或依浮詞偽言所託，或以冒稱憶念之虛詞，宣揚為轉世者，此生所為皆以世法上師詐話覆蓋，終成無間地獄之薪。又有託於言辭巧合，憑眾人之度量而宣稱，自己亦生妄念，非法之因，咎同前者乎？茲諸類為吾輩諸人所宜知，故善意言之，願無今後中有之過。再以偈頌略述之。<br>如是因緣基於轉世名，略述生世種種片段言，<br>此非欲為炫耀己行持，亦非與人較量競勝故。<br>自之實相情況如何是，大德化身遑論非所望，<br>今生前世若能明記者，尚且不能況言他種事？<br>故除夸飾無他可言道，實相凡夫初業必定是，<br>於我豈有聖者功德存？此論乃是實相如實言。<br>佛陀轉輪王蓮師，幻化黑王虛空藏，<br>彼成根本上師體，此為生生導師尊。<br>恩德無法酬報知，菩提中住界主體，<br>不渝信願猛力故，毛豎淚流欣喜中。<br>彼之化身示生相，略述數事聞有義，<br>己與同緣所化者，信生喜起為勉勵。<br>自認乃彼轉世者，心垢此過未言說，<br>生生盼作彼事業，忠僕願故述此語。<br>旁涉轉世名善惡，同我淺智入門正，<br>未來記念所資糧，眾生導入善途故。<br>此非兇暴心所作，善願而言有何過？<br>若不悅他心意時，彼前合掌懺謝之。<br>我自無始流轉來，所行無益業厭倦，<br>今所依身得轉名，八法纏縛苦憂惱。<br>自利未集法徒形，利他無力上師相，<br>八法偽裝成法態，見思自己生厭離。<br>然如龍王伊羅樹，見而修此業力然，<br>是故自身不悅意，未來所發願言曰：<br>願我獲得無生忍，生已具罪供養物，<br>放逸而行名化身，生生世世勿如是。<br>富有父母集會生，生名不宣聲聞眾，<br>未學終時無有缺，聖者依身常轉生。<br>飲食衣服資具等，輪迴久習邪知習，<br>遙憶而認作化身，障礙解脫身莫轉。<br>往昔親教阿闍黎，聽聞正法思其義，<br>憶念佛德不退轉，信心生生常不忘。<br>少年時障聞思者，偏黨徒眾高位處，<br>財利世法顧忌擾，非法所行勿轉生。<br>世法顧忌無染心，善友三寶供養物，<br>圓具無缺聞與思，無障勤行常轉生。<br>利他資糧缺上師，財神眾事魔所為，<br>逸樂享用獄因緣，幼為喇嘛勿如是。<br>幼時功德不彰顯，卑微形相大乘行，<br>如實利他時至後，廣大行持常轉生。<br>自力導他入法無，父母不信具罪者，<br>非法可愛惡友繞，生生世世勿轉生。<br>賢雅行為法父母，心趨善法解脫友，<br>菩提行持和合作，生生世世願轉生。<br>聞思貧乏修無把，生名自傲生我慢，<br>非法大聲諸所行，生生世世勿轉生。<br>少年外美內調柔，少欲知足修德具，<br>晝夜循環修十法，聖者所依常轉生。<br>種姓位高生傲慢，放逸輕視毀善果，<br>不堪異熟地獄業，生生世世勿轉生。<br>現得豐富榮華住，不生貪著及傲氣，<br>佛所贊嘆信淨見，無間勤行常轉生。<br>寺院供物僧伽資，減用另取盡能取，<br>資具所行上師形，生生世世勿轉生。<br>無罪自力之所行，享用三寶供資物，<br>如避毒物極能捨，具慧之身常轉生。<br>憶念前世如煙雲，依此現生須臾間，<br>名聞利養之緣由，輪迴石錨勿轉生。<br>縱若生名少傳播，於此無著幻覺知，<br>世間名利不追求，唯求正法常轉生。<br>童言巧合一二句，卜算旁通多見者，<br>有漏他心略授記，依此號為化身莫。<br>不依他人所讚美，自力聖者之行履，<br>專一無惰大士道，具此善根願轉生。<br>總之心發菩提願，雖未獲得不退位，<br>生世所取知憶念，廣大利生唯此入。<br>所生戒律解脫堅，菩提行持不退失，<br>持明密咒戒最堅，三戒如命常轉生。<br>學藝學海無迷暗，聞積寶庫如理解，<br>思維珍寶所充滿，具慧生世常領納。<br>悅師獲得深要教，遠離喧擾處所中，<br>離諸妄念及漏失，空悲雙運常修持。<br>我以淨願所積集，有為無為善菩因，<br>後世發願如象徵，自見品相憂故言。<br>如是，據自經歷分享正法勸諫證悟語，山間聖藥錄中，今生傳為轉世事，據前世憶念，連同總論略說，此為首篇。</p><p class=\"chinese-text\">嗟乎！今論第二事，由昔業願及今時因緣，於此世善惡入門差別之理，涓滴許姑述一二焉<br>吾生之地，乃雪域藏疆。藏分大小，吾處大藏。上中下三分，吾在下分。蓮師聖地之首噶陀金剛座南麓，即多康獅虎思成北五六大岡中，屬布木波岡。馬康岡與月源岡三圍其中，略近布木波岡。聖母誓句度母像自現於石，水流而下，故地名綠水。谷口北向，有金沙大川流過，綠水之左即此地勝處，多康之妙山嘉山，亦稱雄猛嘉山與雄山金剛岩。俗傳此山自天竺來藏，恐其復返，故置諸山中云。此類古談甚多，吾童時不以為然。後見俗書載：昔劫中，閻浮提山互相往來，傷害眾生至巨，帝釋以金剛折山足，令不復行。時有山逃入海底，帝釋金剛因名毀山云。又云：雪山之子魚山與雁山二山相爭，他山勸解不成，求六面神祈禱，六面神調解亦不聽，遂擲短矛碎雁山云。此語似與外道吠陀典籍相合，不必辨之。<br>雄猛嘉山，上師稱為康地班尼嘉山，然康之班尼嘉山者，中康雄波亦有之。實則吾根本上師金剛持謂卓嶂熱克境之地神斯塔瑪斯德屋，或稱功德嘉山者，乃班尼嘉山，為山王九兄弟之一，與雄猛嘉山非一也。然康地妙山嘉山者，諸聖共許。總之，鄔金蓮師加持之大聖地，有妙寶十三藏之處。山形如五股金剛，背面少許外，周圍百泉環繞，山腰上有提婆達嚕、娑羅、尼祖拉、阿濕婆薩他、阿伽嚕等林，眾妙樹木百有八種，密林蔥鬱，間以白赤岩峰，白蓮直立如傘肋，錯落絢麗。<br>虎豹熊羆狐狼雪豹等藏地猛獸，無一不有，鷹鶻雀鶯等飛禽亦種種具足。野人猿猴鼠及兔等多類有情恆出沒。其地暖妙而有威，可懼且恐，荒寂之境，人行甚難。蓮師謂之如天竺屍林寒林，一藏籍云：與鄔金達那俱舍實相等。西北隅岩面有禽獸之王擒執龍蛇飛騰空中之形，極為明顯，世稱鳥身山。其前有岩如右旋螺，上古瑜伽士眾修持之地，名白螺岩居，吾生於其下小茅蓬中。<br>蓮師授記云：“惡劫分節時，末劫爭鬥熾，眾生粗瞋巨，黑有毛衣者，鳥山飛處生。”此記昔為上師覺頂與寶生於今時吾亦應之。<br>吾所依殊勝暇滿之身，生我之母，乃田生空行部類。俗世於敵親有愛憎，然深信三寶，以金剛薩埵百字明為本尊，曾見金剛薩埵之面，名曰金剛三昧。父則世俗傳聞，出康巴牦牛地白門族，號門氏天女，容比天女。彼地神雄偉宗雄拉山頂，有天神循繩而降，與門氏天女配，吾乃其後裔。雖多人合謀百次譭謗隱蔽，終莫能翦。上古流傳之談，今人不敢新拒，今猶風行人口者是也。<br>然有謂門氏天女乃善婦能常與非人遊戲者，一時宗雄地神化為超人美男，白甲冑者，與配合生子。己意以後者類同，可信。無論如何，天子生後不久，離母，以牛乳養育，名吳古，此為牦牛語。問彼地人，吳古美，藏語謂飲牛乳也。少年時為十八部落之主，稱統御日程十八之地，為王族也。此與牦牛嘎王史相合，名亦同，然嘎王世系出於紹尼二十地神，傳為宗雄大臣有神通者。宗雄為馬山山王九子之長，馬山自稱財神之子，蓮師稱其為施財神，故謂出欲天四王種也。<br>白門乃吳古美之舅，吳自為別族無疑。吳族中名高巴則烏者，為居士修行人，久修本尊，俗則剛勇兇猛有智勇力，稱阿底那他讖迦，應舍利弗願。不共之父為上述聖山護法主，吾外祖母與母詳言其由，尊貴上師亦如是思。彼大地神上師謂，方俗所稱不同，乃千魔之王。依大聖者伏藏法，觀見為藏主財神之幻變，總之神通廣大者也。<br>一說名亦稱金剛岩雄，則於苦域等地甚著，居處與名號有據可考者，略而不述。總之，稱吾為非人之子，絕非誇耀之事。何故佛亦不現為帝釋、閻羅、龍王等大非人之子，成佛身唯人定，經言菩提道律儀生處與速成佛之勝依，唯勝天之人身六法具足，備受稱揚。種姓父母豈有勝人者，反言吾為食肉精靈之族，實為可恥之辭而已。<br>凡俗勇力者自誇為地神子，乃世俗惡習，修聖法者應遠棄之。然不違母語，真實無欺，如實而言，或令非人歡喜，助菩提行增長，故敢言之。諸智者賢聖必不訶責，從心祈禱。<br>六道眾生皆父母，業之理趣不思議。<br>知恩報德之心性，從無始來至今生。<br>為除一切苦難故，入此菩提妙道中。<br>精勤菩行不久證，父母眾亦佛地超。<br>不視父母諸苦難，唯求自身寂樂心。<br>無慚無愧下劣行，佛與佛子所訶處。<br>偏執寂滅涅槃心，願我此念不生起。<br>無量悲憫父母苦，盡未來際願除滅。<br>知諸有情為父母，業感今生父母緣。<br>略陳無過心雖想，若有過咎請聖恕。</p><p class=\"chinese-text\">如是種姓父母之子，於牧主之年<br>孕結而後至果實成熟之年，王月紅分之吉日，蓮花空行行時也。誕生之日，青空蔚藍光明覆蓋，日光燦爛而照，生後三月許，能稍作言語之表。迨至周歲，一日持明蓓瑪瑪尼手書上師報身壽命無量佛修法，見一前修之徒手執，余取之不還，作悲色云：“此乃吾物也。”連聲懇求，彼憶持明大師，感動垂淚，自此相愛。雖或有人謂余為蓓瑪諾布轉世與否，然此為今生首次言及前世之事，自此多言前事，與之相處者皆以為前生記憶甚明，歡喜適意。他人或有惡言詐語，於余無損也。<br>頌曰<br>昔時土地雖狹隘，聖者知名再降生，<br>聞者尚存愚夫輩，否認彼乃轉世人。<br>今於雪域閻浮提，證得大印持明尊，<br>眾稱幻化勝珍寶，冠飾遍佈諸方隅。<br>父若非天吾當應，稱善彼名如螢火，<br>自隱茅草霧中住，見日七馬何能言？<br>吾乃凡夫非聖者，何能堪稱真幻化？<br>然或業熟之神識，蒙彼加持抑轉世？<br>今尚自測不能知，豈為同輩觀察境？<br>若具信心不欺者，觀察何需若水紋。<br>若欲觀察如是事，智眼聖者境界求。<br>後漸成長，三四歲間，無定居所，住於石谷小村時，見己外祖母為蓮師所加持授記者修白法瑜伽，由此因緣，心深樂入此法。五歲許，往紅崖寺，遇多真實伏藏師，有傳為佛智大阿闍黎轉世，號曰普賢週遍任運成就者，為余族中叔父，一見歡喜，置余於座上，以食物上品相供，彼心念余為前身轉世與否，姑且以稚子不知善惡，以昔日身份相待，彼有廉恥自知，實屬難得。<br>他人皆各執八世法，不思前位，不特無慚，於余生地尤甚，比俗人出家僧侶更不顧廉恥，行徒手段而已。<br>頌曰<br>有行知恥古賢道，今時惟存虛名稱，<br>尤於邊地熱革境，現相之慢八法執，<br>身份地位全不顧。若於僧伽或行者，<br>非由修得成就力，種性出身所得位，<br>恣意驕慢不應為。何故施受天仍慚，<br>福德退失不祥因。然今時運所使然，<br>彼地黑民賢善者，勝過作法持相者，<br>放逸醉酒粗行持，良善舊規多污染。<br>言歸正傳，彼會中為誘余童心，手繪蓮師像賜與，談及余前生追憶之事甚多，亦因此知一二光明金剛心要法之修法，至今持為心要，施於勝解修道。今時多於眾中炫服飾為法，然吾為佛尊普賢與持明喜金剛再三諄諄告誡極密，若炫則吐心血命終，墮金剛地獄七十萬劫，懼此因緣，自童年至今未嘗言說。<br>若信佛語皆實，此誓極為嚴厲，必須了知。若不懼此誓，何懼因果三昧耶？是故於此當謹慎，合掌從心骨髓祈請。<br>頌曰<br>昔時佛教圓滿際，人皆悉護極密法，<br>此要能令億眾生，一時獲得解脫果。<br>藏地法王菩薩時，蓮師授灌號秘密，<br>名尚如此有顧慮，何況實灌與教授？<br>今時濁世劫末時，深妙諸法市井賤，<br>密咒證得何須說，心性相應見亦稀。<br>普賢蓮師秘密教，加封印者反背棄，<br>非法幕覆假作法，山谷焦乾如遍燒。<br>吾為成就覺者者！秘密輕慢心誓損，<br>如是慢心嗚呼哉！<br>言之少頃，吉日紅崖內殿備莊嚴座，大宴召余，然因童稚不能往，於彼因緣有損，似前世業緣使然。其春，上師宗支數位以認證化身名義邀余入宮。路中，述一二前生追憶事，彼時言多不悅，然而不論憶誰，彼處施灌頂於近百人眾，今猶明憶不忘。何為何人，指點無須，眾勿擾心。<br>任何如何，抵達王宮受薰灌，自此順彼流水行，余不需私待遇，餘無干涉。後余十七歲，往紅土方時，一鄰婦言：“昔有幼童今成此師否？不知，若知一請之，當供一碗牛乳足矣，然未得。”當時即此事也。上師親屬對余所視，此可全知矣。<br>留數日，返回時無人護持，自墮馬哉，暇滿身失，危殆。余無共通善緣，唯一請法客，亦逢此奇事。自此，余十三歲時，異居後成道場，師噶桑仁波切請余來座，余與彼等不復相見。余有類事甚多，乃由宿業與當時因緣所致，嗡嘛呢叭咪吽舍。<br>頌曰<br>現僧識他授記相，知慧大慢眾多者，<br>妄定有者前後違，顯自特性豈為勝？<br>黨執不作贊一人，詆詞雖多如谷響，<br>非作偽裝自性中，聞轉世名甚嗔恨。<br>偽裝諸者必滅盡，笑迎此事甚奇怪。<br>尊貴上師蓓瑪尼，勝者功德雖多具，<br>形小曲折邊隅處，隱居證得住彼焉。<br>吾不依他自道中，自鳴高奏遊王國，<br>此名浮空入何為？彼名非吾所用故。<br>名浮執者心繫者，各適其意任辛勞。<br>子繼父業金瓔珞，上師行持能持守，<br>吾常讚嘆或有之，知過不悅何足言？<br>父祖栴檀子孫薪，持教者後教賣客，<br>如是於吾發誓者，何等心相知者明。<br>父賣師教祖蹈前，己過如山不自顧，<br>他過毫芒能測者，下愚是輩淚垂悲。<br>嗟乎輪迴如是相，敵視親友親作敵，<br>迷亂曼陀羅所醉，思念決定增厭離。<br>嗟乎如幻術機關，於此永無貪著境，<br>然彼作果心熟現，世俗情狀如是言。<br>今復入正文，不久後往石谷住時，見數伏藏師畫像觸緣，一日童戲時，於穀殼內見伏藏師寶生寧巴、智巴寧巴、具力金剛明顯心要、虎衲金剛五成就者列坐，身形甚明。非現量亦非空影，意中極明，今觀宛若生起次第明現，然當時未得明現之義，總之奇矣。實乃彼等加持入相乎？<br>彼等之外尚有數人，隱約可見而不明記，不敢言也。當時多於意中唯見蓮師身相了了，尤以師現蓮師相而右手按地金剛，左手平置持顱，肘持卡當卡者，再三而來，如是周年。<br>非水泡眼境界，然不思而意中現量顯明者也。<br>頌曰<br>如同明鏡塗畫像，不落有無兩邊際，<br>自心境中所現形，金剛之身豈不妙？<br>虛空從來無分限，眾生皆見空普遍，<br>執為限量愚者心，知其遍滿實希奇。<br>五歲末，皈依主輪王金剛持處始學字母，長老無需多教，今略通讀寫，六歲時輕易獲得。六歲春隨舅父至忿王寺略遊，返鄉時因他緣需往復數處。期間飢渴寒熱之苦備嘗。<br>七歲時，尊勝輪王亦降臨熱革下沃季容若朗寺，余等眷屬亦依之居彼。七八歲時，修習大樂金剛忿怒尊事業頌珍珠鬘念持為本尊，除障礙並初獲成就徵兆，後未續修持故，成就相漸退。是故後學者童年起勿修本尊單獨法，此為忠告，然余無人告故。<br>總之八歲時，有種種似夢非夢相，尤於今生開啟蓮師甚深伏藏門與否之兆極明顯現。或此前後境界，乃離實執，非夢非覺，不能辨別，當時得指示者，能力極大，然未得。十一歲時，聞尊勝金剛持向善師根仁請教覺證境界，知心安住差別，生起修習與境界。<br>十三歲時，於王月吉日，承蒙具恩加持大悲根本上師金剛持蓓瑪炯德欽巴，頂禮承受三世諸佛同道究竟實相大圓滿前行教授，以暇滿難得、無常死亡、輪迴過患、解脫利益、業因果等，皈依發心，此三士道次第圓滿及曼達、金剛薩埵修持、祈願、共不共上師瑜伽等，成熟引導後，由心住起，依次導修，上進觀修二階段，獻銅器盛香茶，先賜其內容後賜器皿，並確認境轉覺三自性，賜以金剛加持語。因上師加持力，不久心性相應，境轉覺定立生起，然於當年末，持明巴瑪瑪尼宗傳寶噶桑鄔金丹增仁波切，令往喀陀王教持南方熱革境教統領袖，如白巔峰高顯具德巴瑪洛卓住處，特派遣使臣至沃季容若朗，稟請根本上師，於吉祥時日啟程，次第渡金沙清洌河至下部，尊師亦來接引，一見即視為先持明而為境內高低眾生頂嚴，依二道而安於吉祥座上，恭敬禮拜，殷勤接待，然余以無法緣不能還禮。<br>總之，余幼時頗固執，二十一歲前不禮無法緣之師，因聞天竺國法亦如是，此隨意行實乃生地曲隅之益耳。後巡禮王國各處，雖無法緣仍因身份隨機禮敬。不但如此，於火馬年末朝禮尼泊爾時，為守卑位淨觀修習，計三年餘，不論大小尊卑，一切僧相皆行敬禮，後不能持其極端，言雖守卑修凈觀未能成，但不察身份而禮不禮非妙，暫見不雅，久則害緣。年托阿亞巴曰：“前老態二十年來矣”，實為至言。<br>隨師足至綠水諸村，抵昂悉時請壽勝佛會灌頂加持，自此盡力以初供上師。次抵雄山內寺，住冬季至明年夏秋之間，依師教略學應需，然為寺眾事擾染，先前稍有境界亦漸消退。不僅如此，十三歲後夜見廣大天相與空影，常見非人眾形，夢中亦能對境而持，於多鬼神立誓及善惡涉隱處皆明了，蓋垢輕明淨且少年氣血清純，力不可言，然如明鏡塗油，自至道場漸次衰損。<br>寺中賤視輕慢，外人視為上師，施以資財，亦有過失。總之今生所需多不成就矣。故除發心受生者外，如余者冠以轉世名，為愚執者所圍繞，謂此為我師轉世、祖轉世、叔轉世、舅轉世等，令童孩習貪著資財，長大後亦自恃炫耀，虛度此生，此非余所願。<br>未遇善緣具相善知識，未能修二次第，持戒因果松散，唯恃強傲，著八法堅甲，享亡財活替，終將前世善果於今生盡，解脫懸索斷，墮無邊輪迴深淵者，嗚呼悲哉！<br>是故余從今生起至未得無上正覺聖勝位前，願不受轉世之名而自利未成仍散亂行輪迴業者，願永不作此事。<br>今復入正文，住雄山內寺之年夏，遇喀陀王子索南杜贊，得灌頂教授、口傳甚多，實成特殊加持因緣。秋初，請教權請主持仁波切後，往依上師總集之主金剛持德瓦欽，於沃季隱居處，因從道場來時深思：“今當真修實法，尤須自他二利圓滿根本真實見修證基礎，必持有真實上師，實難得如優曇花，緣差或不久住，今當日夜不舍精進修持。”然抵家時，難作堅定專一之修持，因童稚劣緣所障，友伴無勸修督責，雖有求實之心而無行力，思明日修明日修，虛度光陰，為紅焚薦福、度亡、灌頂等事務所縛，為魔散施浪費時歲，未能作上師歡喜利生之根本修持，至今追悔至極，淚流嘆息矣。<br>頌曰<br>嗟乎！<br>暇滿欲修有義行，魔力延緩歲月過，<br>命終虛度無義中，思之悲風豈不起？<br>是故修行莫延遲，大事須讓小可遲，<br>縱使天翻地轉來，自決自斷父母親，<br>眷侶友朋不隨順，一志閑處求實義，<br>勤修不懈恆精進，法命上師三昧耶，<br>寧捨己命不犯之。<br></p><p class=\"chinese-text\">今續前緣而言之<br>如是修持之心生起，不論己之年歲老少，既生淨心而列修道之列，則心不應生他想，當立堅志。縱使上有山崩，下有海湧，亦當守此淨心，不為父母親眷友朋所牽。極善者，盡此生修行；次者，十二年；下者，亦當六年；至少亦當三年，三期為期，立誓堅守。寧可死於關房中，病臥於禪院內，心中煩惱不樂，皆納入道中，晝夜分六時，不令生起次第修持有絲毫怠惰放逸。若外示閉關修行，內則長伸腿臥，或昏睡不醒，念頭紛紛如串珠，則猶如鼠居洞中，毫無修證之果。自幼當勤於修持，方能心中真切堅定。<br>如是修行之淨心一生，魔即為障礙；若決定入修行，更有重重阻礙。或化為父母親眷勸延後，或為親愛友伴道友施主深相關愛之人，或自安然處無事之人亦規勸，或為親教師和尚戒律導師等，各自示現而勸延修行，或言：“今汝年少，修行可待後時。”或言：“今既有所化機事業，暫且維持終可修行。”或言：“吾以誠心勸爾，爾既不從，嗟乎！”作悲憫狀而勸阻。或言：“爾若修行，吾將流浪或陷困厄。”或言：“爾若修行，吾之生計無依，爾可任意而行。”或時又言：“今年某某大事須成，明日即可修行。”<br>總之，或用慈言誘騙，或用忿言恐嚇，或柔或剛，或善言規諫，說之不盡。當知此等阻礙修行者，皆如幻術，不生喜怒，不隨其後，當勤方便不為所動。父母勸阻時，當言：“吾見惡夢不祥之兆多現，若今不修，死期必至，請暫垂慈恩，後當盡父母之命。”以善巧取悅之。<br>何以故？父母於今生大恩，施我此身，聖者言其與佛同尊同敬，故上者得其歡喜，中者不生不悅而得允許，下者亦不使父母身命有礙而得部分恩准，當以種種和平方便為之。其他勸阻者，當以和平或威嚴種種方便，斷然修行，自己當自決定。<br>有魔障尤甚者，為國君、執政大臣等阻止；或為敵賊眾多，不能自制愛憎；此等難以速制，若有怨憎者，應自認失敗而和解；對上者當以財物美言取悅；若終不能自主，則可裝作乞人，不留蹤跡往他方用心修行。<br>又有暫時師長道友勢力大者阻礙修行，此亦難事，當善巧不為所動而依法修行。若經種種艱難得以自由修行，則當立修行處所，獲二次第之暖相。若不能此，則今生來世皆無益，須於此策勵，甚為重要！<br>前言師長親教師道友者，須如是了知：雖無法緣而為寺院僧團之主者是也；若有法緣，則當視一切皆善，修淨觀，若自心向修，亦當善巧為之，必須獲得許可。金剛阿闍黎授灌頂引導教法者，乃真善知識；若彼不悅而不許，則雖修持千劫，亦無功德，如攪藍水求酪；若彼歡喜，則雖行不善亦為大乘之道。故唯當致力取悅師長，實則艱苦苦行百千年，不若以身口意清淨稍作師長事，福德更大，故當勤修侍奉。若不明辨而愚昧，欲隨意修行，恐墮金剛地獄之座，甚危險也。<br>如是談論衍事，則無窮無盡，不多言。然余因自無主意，虛度人生而生憂傷，故勸誡他人，似我等化身或宗支者，當使暇滿不虛度，自幼入修道，獲自在，至臨終不生怖畏之自信。此乃肯切之勸告也。<br>頌曰<br>我於童稚之時辰，心懷淨願修行意，<br>緣為魔擾供施事，修行之志漸蹉跎。<br>今雖一念生悔恨，如鼠逃遁堵穴遲。<br>是故後來似我者，修習佛法幼勤勉。<br>如是由於供施受用，猶如受傷鹿般，雖欲如是修持，然不能為。然師長住世數年間，授我甚深更甚深之教言，攝之則精簡，展之則廣大，乃諸佛心智要義，示現本果不二之體，自明自覺赤裸裸顯示之心要，如法授我，其恩難容於虛空。故知總集諸師之體性根本上師，實是此尊。<br>等同薄伽梵金剛薩埵，無有差別，就恩德而言，更勝諸佛。總之，自余生七日後，於無量壽佛壇城灌頂成熟，攝受我，乃至法爾智慧一分勝觀之體驗生起，皆由其加持之恩。余今生所遇諸師中，殊勝信敬唯此一人，故深信其為多世之師。<br>若有愚昧不淨眼者，謂此乃偏執黨派之信否？非也。知我根本上師功德不可思議而生不退信心也。非僅謂其曾為某伏藏師轉世之虛名而執著，亦非獨賴其立修行處所，修習金剛乘一切道果，成就金剛持王位，獲億萬三昧定自在之大成就者、轉輪王之名。<br>而是於此生不作學習之形相，因宿世修習力，生起無比自然智慧，了悟經續一切文義，於甚深廣大堅固難解之處，一言可令易解，能於無量劫海演說無畏無怯，故為大智者中之大智者。<br>尤其生圓次第大圓滿竅訣最微妙秘處，講說時如普賢金剛薩埵親臨。總之，一切所見所聞所憶所觸之所化境，皆引導至無上大乘之地，四種事業自在，具多聖妙用之聖中聖者。勝義中實乃圓滿佛陀，雖超越心智，然為凡庸劣慧之所化眾生而示現，尚且如是，於具善緣者，何須言哉！<br>雖確有如是殊勝功德，然不見者邪解之眾生，如目疾見白螺為黃，當知業緣所致。於無緣者，為大秘密所隔，當自知此理。<br>頌曰<br>圓滿諸佛降世間，不淨自現見過失，<br>具足百味甘露食，罪業餓鬼視沸水。<br>甘露非過己過故，累世惡業自覺知。<br>蓮師貝若幻化身，德欽林巴深信敬。<br>今復返正文。余年十六將滿，首月虛空盡日，普勝月朔，於光明特殊時分，根本大師於此土所化已畢，念彼淨土所化而幻身法身界中。此於我等薄福者前示滅，為破常執故；於具緣勝者前，實為大遷淨光金剛身，決無去住。然以我不淨心故，暫不見身相，生如裂心之痛，然無奈何，唯當以專一信心猛力祈禱。<br>若欲詳知此段因緣，可閱《哀思歌曲種種蓮華鬘》之前述文。今時有人，根本上師雖去世，無有痛苦，白面而笑，傲慢更甚，此唯入破誓者之列而已。瑜伽自在者，自心法身與師心融一，尚且示現悲歌痛苦，今之所為，豈非不知恩之無恥者乎？<br>主要者，當師長住世時獻悅意之侍奉；其次，師長去世修福德迴向以示悼念，為情切修福故，普通燈供百俱胝迴向，不如為師長追念一燈供功德更大。以類推之，一切善行皆為師長追思而發猛利信心修福，至為重要。<br>具德上師意如空，自罪盡滅無餘留，<br>二資廣大願增長，勤修福善此要機。<br>其年春至，名作夏季閉關，然未能勤修內行，故本尊修持未成，圓滿次第未得要領，止於安逸臥息，毫無益矣。彼時如夢境般，數見根本上師，蒙賜教言及隨教，允諾攝受至大乘精要，然為執著心所縛，不得親見，心中悲傷無時可消。<br>是年夏秋之際，座主嗣尊噶桑仁波切遣人相召，遂往道場隨師。時自作勸修之歌甚多，尤立十二誓願。余自幼時耳中常聞飄飄悲音，此年尤甚，聞婦人音韻如歌聲漸明，有詞可記，聞之不由憶死，悲修未成，厭諸俗務，心力轉變，此事自彼年起三四年明顯，五六年漸顯，後漸淡，終於數年後消失。後於土雞年復聞昔音，今猶時有所聞。當時疑為鬼神所擾，今思之非惡事，因能斷今世貪著，勸修法事，恩甚大矣。若無此事，恐沉溺愛著，必流轉輪迴。<br>頌曰<br>多劫修行勝本尊，吉祥上師音聲身，<br>智慧空行喉中出，引攝有緣真稀奇。<br>酉年初，往詣大聖地金剛忿怒尊。少時未至今老態，猶自寬洪，友人謂是朝聖而已。實則因夢兆而往，彼時諸兆靈異，此不贅言。<br>回座途中，於日穴岩縫中得白色土丸，大小不一，七十餘枚。余自幼耽樂正法，思此非法寶黃紙，亦無阿字印痕為聖物，不知何用，遂棄之，後亦不再尋，此乃彼時愚昧過也。聖物阿字，伏藏師多認為措嘉指印，固有此理，然多為聖物自然顯現，故無字形亦不相違，大小字形各異，亦如此理。然不可與偽飾土塊混也，此為要義。<br>是年，心未思而自現之語頻出，以藏心之名錄為文，成《上師惹喀顱鬘》法類大函，忽生無用之念，付之一炬，時有眾僧知之。今時有人心中自現善妙語句，雖是障礙，猶如閉目不見，而余自幼即信師語者，故棄如此事。<br>凡此類事，取捨難辨，能辨者亦稀。然當依佛陀蓮師教言及持明傳承上師口授而察之，此僅略述疑義，不作繁文。余於彼時，知此乃脈氣境相而已，暫不執著，如是行持則不為魔障所攝，余有不共定論，然此不宜明言。<br>總之，此類境現，人法之障易生。余十三歲童稚時，心未思而自現法語，謂為藏心伏藏，由此魔障險入。云何？緣藏心歡喜之中，多虛妄人法現，何以故？強烈念頭顯現相似天身，以為天語之自現妄念言辭，謂見天聞法，虛構增飾。<br>此將何往？成人法上師妄語，長劫住無間地獄之業，故言險入大魔障也。是故同緣同運者當慎之，此為衷心勸告。<br>余雖有種種顯境，然因前世積修福德力，得遇根本大師，多生信因果習氣略醒，見此生短暫不住，知無可貪執，聞諸顯現善惡皆如幻入道之理，於業及緣起現相，不作深執，故未陷偽妄邪行魔穴，於此暇滿未全虛度。<br>歷劫皈依唯鳥師，降魔大勇忿怒尊，<br>加持威力照十方，摧滅魔眾暗無餘。<br>憶念上師蓮德林，真實體性普賢心，<br>蒙君加持入心故，所作皆成證智分，<br>諸相如幻執見脫，緣起妙用分明達。<br>妄執善相自消融，暇滿雖非亦不虛。<br>續言衍事，考諸福德淺薄者，人法魔障入門雖多，然大部分皆由見聞勝者傳記之奇事所感，乃生貪著而望己亦有此相，或有於數月修持後，渴求尋常神通，或有未經修行而冀如大成就者般具神變，或有初於夢境或覺受，偶現吉相而妄生執著，向人誇耀，終無所得則多生願望，或有道友、僧眾、親眷、施主等冒相信己者言：“某某為我授記”，或言：“彼為成就者、伏藏師、或殊勝化身”，謂有通曉密事因緣，故請開示，自亦深生欲望，而生我慢；或有見他有可與己爭之人，聞其奇事而妒，欲顯己有功德；或有不願同於常人，欲超劣處而希今生獲富貴；總之，貪欲見神，聞授記，生他心通，得尋常神變，欲得如現象等事，如是心生即魔障大開之兆。<br>當了知此理，知諸法如幻，於徵兆不生希求懼怕，知此生短暫，不久必壞，如夢醒時，不生染著。今時安樂幸福，皆因前世修善積福；不悅意事亦由惡業所生，故於因果生真實信心，而斷惡修善，立志堅定，則能離魔障而入菩提道矣。<br>不爾，執著今生為實，於微小根基加以增飾，隨意妄言，是為魔入非法之根基；若無基礎而謊稱見神、得授記、有他心通、顯神變、發伏藏，是為魔已障礙而業已成，將長劫住無間地獄之人。如是以人法欺他而自取大殃之腐心，往昔多有，今亦見聞處皆多，未來或因時勢而益增。為此之因，乃執著此生，不知因果，未聞輪迴過患，亦由往世福德淺薄，惡友所引而起。<br>行此業者，依律，出家人以上犯四根本墮罪，既具基、思、行、究竟，則如碎瓦，不可修補，失解脫繩索。然依大乘共與不共教，若於所積業能憶念，無隱無覆，具足四力，勤修懺悔，則能淨障。然能如是行者甚難，雖心生少許悔意，而能言己有此過失者極為稀有。若於重罪不如是行，則罪難消；若已懺前罪，復再造，則前罪復增。是故，為慚愧前罪及防後犯，當明言過失而懺悔，此於一切罪懺皆同。然造大過者難行具足四力之懺悔，若不行此，必往無間獄。往昔聞一人於持明大師若巴多傑面前認錯，懺悔冒充伏藏師之事，吾甚隨喜。見聞他人作偽者雖多，然未聞作四力懺悔者，甚為悲哉。<br>是故，雖難知他人之量，然己所為隱事可自知，故於人法諸雜穢業，當自點鼻自指，悔過斷惡，取捨當行之事，不執此幻化人生，以大悲憫己。此為吾遍遊者之真切勸告，至為重要。<br>此言出於悲憫他人，非欲攻擊偽善者之過失。三世圓滿諸佛具一切相，稍知此理，是故偽者亦可視為佛之幻化而修淨觀，不生憎厭。<br>多劫成就暇滿身，獲此珍寶人身後，<br>福薄業牽魔所欺，無間地獄天宮墮。<br>慨嘆恐懼歲月久，聞唯長劫意疲勞，<br>是故於己生悲憫，幻世須臾莫貪著。<br>復入正文。於凶年往虎巢勝處忿怒尊修行，為惡友所障，不能成行，至寺與山麓若朗，建一獨修關房名猛虎獨聲，略修《明顯空行心要》之上師修法金粒一，然未嚴遵規儀，雖身無間作持咒狀，而心隨妄念，故修徵神變，連善夢亦未得。總之，時多希求神變之過。後修行圓滿時，念誦多寡雖無欺，不求神變為佳。若作修行狀而心散亂，何盼神變？是故，於本尊修持持咒時，心須專注，除妄念為重要，然彼時圓滿次第之解尚淺，唯任心安住以為足，實不解也。<br>此時生厭離心，悲己懈怠不成法，內心痛苦，故唱悲歌甚多。尤於夢中多至伏藏處，見諸深藏蓋函授記片段，然未能如法安排因緣。<br>又於此時，自立終生誓言，非僅隨俗禮儀，凡所受灌頂、傳法，當守根本三昧耶如命，並立暫時功課誓言：七支祈請、深道上師瑜伽、金剛上師咒、六字明、持氣如瓶等，初限月及時數，後定為每日課誦。然吾勤勉甚微，自生悔淚。<br>自慚懈怠勉修行，立請護法作證盟，<br>根本誓約一並四，支願功德歸菩提。<br>若發淨心諸善行，恆河流入大乘海，<br>諸佛既言微善業，求證佛果當精進。<br>金蛇年，修勝上尊金剛童子，時座主仁波切往他方，余思若不往拜求加持，恐顯傲慢不敬，故出關往拜。上師及智者道友雖言閉關中不宜出，然吾膽怯所致。今時有上師，於恩德深厚之根本上師亦執守我見，無愧於心。若出關時打破禮儀，吾心不堪，非能發大剛勇者也。<br>忽出關誠非善事，王亦貢寺所言甚是。後數修行多有間斷，故當立志定心，不為緣障而斷誓言為要。彼時修行雖未如前散亂，然未解經義本旨，修行亦難稱標準。徵相亦唯示病魔出之相而已。<br>夢見執九股金剛杵缺角者，或為灌頂上師有所輕忽，或為生起次第鬆散之兆，未能分辨。<br>本尊壇城如星象，奇妙威力本自具，<br>諸尊大悲與事業，集於除障賜成就，<br>密主金剛持童身，日月光照祈勒耶，<br>蓮師父母勝本尊，於彼體性吾修持，<br>暫時病緣入龍魔，勝尊威力令自散，<br>少時持咒修如是，三明久修何不成？<br>是年白薩爾因寺內爭，紛擾甚大，故無暇如意修行，然得閒暇，漸次行七日閉關，一度行金剛亥母七日修持，時有日後漸有聲名威望之兆，故歌云：<br>瑜伽士吾鳥王杜鵑二，遠遠行時聲漸高，<br>今於眾中青年被輕賤，傲慢欺壓徒自勞。<br>水木出土石難掩，暫時咒詛終無損，<br>或信年年過去時，此言漸加明朗顯。<br>於此時，因懶散未成法，心生大悲，故唱悲歌甚多。尤夢中多至伏藏處，得深藏封函授記片段，然未能如法安排因緣。<br>是年普遍於秋日施主處行清洗儀軌，因座主仁波切與司庫之堅請，不情願而往，返寺時染寒疾，身行失常，一月有餘，幾近死亡，病況甚危。吾雖輕視死亡，然司庫等有病不可之訓戒，為重負，不得舒心，甚為悲痛。<br>總之，座主仁波切雖以慈眼視護，特蒙灌頂法緣之恩，然今之某些轉世者，至寺後為宗支、僧眾、弟子、施主所愛戴敬奉者，於吾全無，此為眾所周知。<br>諸轉世者多可疑，誠為實言，吾亦難以相信。既有疑惑，不必請為轉世而迎入道場，誰復有歡怒之理？若非如此，既請為轉世入寺，則縱有疑惑，宗支、僧眾各自理當不間斷盡力奉侍。謂行善者，非指世俗之談笑、驕傲、飲酒、騎馬、縱欲遊戲等，令心厭法，輕視因果之基，及聚財不法，貪嗜飲食財物，非為法而積聚等，看似世間之善，實陷惡趣之墊石，令墜落之繩索，教者聽者皆為魔所欺，雖似利益而實送入無間，不可言善，實是最惡，當知之。<br>雖施食衣無艱難，及供財物、言讚等，於世間言有益，然未為大益。何謂真益？教導修學自他二利圓滿之菩提是也。如是則粗劣活命之食、禦寒之敝衣足矣，世間財物如夢，何足貪著？是故，自幼不厭法，精教因果三昧之利害，令心向法，重視教授成就，教守三學清淨，勉勵修行，尤應介紹前往近遠處之善知識所，令持清淨三昧，多方勸導以柔剛種種方式入證法性光明智慧，此乃真實利益，善之究竟也。然此等師長甚是稀少。<br>若有如是教導者，不論轉世與否，具神通或神變，自當知恩圖報。若不知此等之恩，乃己未明了耳，當知之，是人於法無益於世，空名虛銜，匪惟無濟，反致輕慢侮辱，此實非敬上師之道。蓋輕己師長，破壞三昧耶戒，必招過咎。<br>何以言之？凡認取之人，若其心向於法，欲成就二利，則或有疑其真偽，或縱非真，亦不可侮之。譬如泥像雖非金身，若有輕毀，亦結深重之業，與毀佛無異。<br>然雖號為之，若於法無益，反行不法，辱沒上師尊號，則罪過何在？蓋其雖有名號，若行不法，有若糞塊謂是如來，則出言此非淨器，亦不為過。嗣後傳人及座主徒眾，皆當深明此理。然如乞者之歌，雖有妙句，聞者絕少。<br>言歸正傳。吾未至本寺之事，不煩贅述。及至本寺，實賴座主慈悲攝受，其餘執事徒眾，於法不能相助，於世亦無實惠。<br>且置勿論。吾至本寺八載，為執事及上首弟子，每多視而不見，反常責備，出言不遜。謂吾非如他化身者，此誠然也。<br>無論吾為何人轉世，於吾心中實無分別。然諸近屬弟子，雖不認吾為彼前身，然以宿業因緣，今世被稱化身，肩負座主帕德瑪羅卓之寺院傳承重任，諸君勿生嗔怒。吾願為無拘無束之人，自在逍遙。<br>自吾入住本寺起，至未周遊他方之時，於上首者不生爭心，敬而順之；於平等者不生壓制，和而相處；於卑下者不生輕蔑，導而用之。然性情不馴者，或有責備，此乃當時行事之實況，眾皆明之。<br>總之，座主在世之時，以地域而論，吾雖為認取或化身，然無修證功德，焉能為表率。然於外儀，未曾為惡示範，此乃詳述於他處之傳記可知。<br>自金蛇年始，外寺廟施主信眾皆悅，弘法事業漸增。然於無力利他者而言，弘法事業實為虛妄，此於內心深信。而內之徒眾，卻益加呵責輕慢。<br>吾內心無貪著散亂之念，因此向上師再三懇求，獲准前往祖爾芒伏藏師處。若非如此，當留寺中。因悟智賢精藏典故，有所領悟。<br>其後修習無等岡波父子專一瑜伽，令心不動如山，體悟無二。<br>於普賢根本上師蓮花大樂尊前，雖已得生並獲認可，然此時仍屬片面狹隘。所謂“心無根本離體性”，此於尋覓心性時，多數智者經上師有經驗者指點，能於心中生起，此與普通不同之體驗，令先前所知皆成浮泛。此時雖從一面有所通達，然此通達已成無戲論之正見。<br>智慧正見者，與證悟相去不遠，如成就者鄔金巴於悅意賢者傳中所引述。吾之所證與他人是否相符，不得而知。<br>迄今，諸多證相超出限量，雖有宿世修習，然未能如實認識，未能如法修持，後享用財物時日漸衰減，不能自持。故此時之體驗，實為今生真修行之始基。<br>然於此時，對大手印生大信好樂，熟悉心性，如其所說而修。大手印諸先德曰：“得大手印證悟，生起修行，若不精進修持，則證悟日衰。”此語甚契真理。<br>然大智成就父子等則謂：“心法總持作為道用，龍欽巴以上，以境為道用，故大圓滿心要法中，見心本性後不退”，此亦如實了知之善說也。<br>福德因緣遇樂宮，因之法命得加持。<br>願力所致敬賢教，緣此深契大圓成。<br>彼等力故建實修，劣緣亦非無緣顯。<br>善惡諸業佛言真，如是分明生奇嘆。<br>依此體驗之相續，多數上師所說，樂空喻智亦於彼時分得生起。然依大續部之密意，似非真正證得。然無論如何，由體驗堅固生起之力，因內外緣起一致之理，外在所居之處，雲霧彩虹奇妙變化，微風徐徐，溫暖怡人，周遭諸人皆生歡喜，面露笑容。<br>實則心中生起樂受而已，何有定量可執？無論如何，彼時苦樂、悅非悅、冷熱等感受，皆知唯是分別念之自相，別無特定自性可得，皆成智慧一味。於天生愛慕，於鬼起嗔恨，亦唯是微細希望恐懼之相，餘皆自然寂滅。顯著貪嗔希憂，亦是自現自解，法性本然波動，別無他物，生堅定了悟。<br>如是等等，於他人心有違，於己心無違之體驗多有生起。此種境界持續約三月。此時本應依止靜處，修習拙火、風脈，以增益修行，然未能如是，致使後來進步甚少。<br>一般而言，不堅固之體驗為觀，而堅固者為證，雖有是說，然實心性種性自明之本體，實無變化。然於暫時，因隨緣起風脈明點增減之緣，及分別風力作用，修行有增有減多種情況。<br>雖有增減，然知增減之分別念自性平等，如認識波浪即是海水，從心深處決定，無微細疑惑，任運自在，此為證悟。若非如此，雖性不變，為分別念所蔽，於增減觀境有取捨，於任何所現不安，有微細疑慮，則置於觀境一類。<br>如是分類及自己少許體驗之情形，恐繁不錄，於他處詳述，當於彼處了知。<br>是年決定往祖爾芒，為辭別座主，抵日瑪洞時，寺院遣使者急報：“司庫日札於前往內地途中忽有隕石落頂圓寂，速來超薦引導。”急赴座前，真誠超薦引導。<br>其時，一次觀境中見聖觀音十一面尊，高約一肘。夢中見光芒形相，白色忿怒金剛尊。司庫送終畢，欲往祖爾芒，因司庫圓寂，座主暫不允許。<br>此後，一事畢而一事生，如水波紋無暇消散，光陰流逝。常思若如受傷野獸，於靜處專一修行，必當於此身成就，然未能遂願。<br>總之，如前體驗之延續，此時一切所見皆現為本尊。彼時僅是修行生起階段，後聞續部義理時，知先前乃續所說之身遠離真實生起也。<br>普賢根本上師蓮花大樂尊前生起並認識，然此時亦局部淺薄。所謂“心無基離根本”，此於尋心時，多數具慧者經有體驗上師指點，心中生起，與共同不同之體驗，令先前所解成為粗淺。<br>此時亦從一面有所了達，然此了達已成遠離戲論之正見。正見清淨，與證悟相去不遠，如成就者鄔金巴於悅意慈愛傳中所引。吾之所證與他人是否相符，不得而知。<br>至此，生起無量證相，為先前修習增上，然未能完全認識，亦未能如法修持，後享用財物時衰減不能自持。故此時之體驗，實為今生真修之始基。<br>頌曰<br>未染法性假心蔽，無為自覺知己時。<br>萬象現為大樂相，諸尊超越有無間。<br>無作天然虛空成，即是如來大手印。<br>密宗金剛總持基，聖教車轍天竺藏。<br>咸如所說心生信，不住有無兩邊間。<br>離垢大印實希有，自慶幸得遇此緣。<br>尤以此時，當謁見祖爾芒伏藏師珍寶金剛蓮花尊，然不得自由。誠如經云：“珍貴妙法難逢遇，常遭多障。”司庫歸真，致使吾承寺院重責，法道多礙。後欲修行者，不應遲延須臾，誠不可也。<br>是歲，尼泊爾內亂甚烈，初雖艱難，然經吾勤力調停，幾近解決，適時座主及諸眷屬皆至。是年秋末，往噶陀寺，謁見勝者之子索南德贊尊，於天降吉日，受持梵行近事戒，復於此時削髮，賜名索南特秋丹增班藏。<br>受皈依戒雖已多次，然削髮未得施行。蓋惑於僚伴惡習，又因根本上師圓寂，不欲輕慢行之。前此雖多為男女削髮，然己具皈依戒故，不致重咎。己髮未除而為他剃，則有小過。皈依以至梵行近事，若無受戒師，亦可於三寶像前自受，諸師皆許。<br>時，持明遊戲金剛在牙曲地方，欲晤如渴人之思水，至覺卧渡口，因二同行不願前往，遂折返。若獨行亦可，然懼人譏為狂，不敢前往。因畏今生不美名而受誑，是為大過。<br>真正修行聖法者，應置今生名聞利養一切言談於度外。人生須臾，若能忍受世人嘲諷惡言，方為真實聖法。然吾膽怯，竟失晤見上師之機，良可歎也。此皆由惡友狼背黃之故。願從今至菩提，永不為障法惡友所惑，願諸佛子及弟子，以教言為證。</p>",
    "status": "published",
    "meta": {
      "words": "藏 33738 音節 | 中 24067 字",
      "pages": "65 頁 (估算)",
      "readTime": "閱讀約 322 分鐘",
      "preview": "མཆོད་བརྗོད་ཀྱི་སྐབས།༈ ཨོཾ་སྭ་སྟི། རིགས་དང་དཀྱིལ་འཁོར་ཀུན་གཙོ་བླ་མེད་བླ་མ་མཆོག །ར..."
    },
    "availableLanguages": [
      "bo",
      "zh",
      "en"
    ],
    "createdAt": "2025-06-06T08:31:00Z",
    "updatedAt": "2025-06-06T08:31:00Z"
  },
  {
    "id": "autobiography_002",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": [
      "迴向"
    ],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": {
      "words": "藏 1 音節 | 中 9 字",
      "pages": "1 頁 (估算)",
      "readTime": "閱讀約 1 分鐘",
      "preview": "此祈願文之藏文內容..."
    },
    "availableLanguages": [
      "bo",
      "zh",
      "en"
    ],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "autobiography_003",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": [
      "迴向"
    ],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": {
      "words": "藏 1 音節 | 中 9 字",
      "pages": "1 頁 (估算)",
      "readTime": "閱讀約 1 分鐘",
      "preview": "此祈願文之藏文內容..."
    },
    "availableLanguages": [
      "bo",
      "zh",
      "en"
    ],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "autobiography_004",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": [
      "迴向"
    ],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": {
      "words": "藏 1 音節 | 中 9 字",
      "pages": "1 頁 (估算)",
      "readTime": "閱讀約 1 分鐘",
      "preview": "此祈願文之藏文內容..."
    },
    "availableLanguages": [
      "bo",
      "zh",
      "en"
    ],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "autobiography_005",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": [
      "迴向"
    ],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": {
      "words": "藏 1 音節 | 中 9 字",
      "pages": "1 頁 (估算)",
      "readTime": "閱讀約 1 分鐘",
      "preview": "此祈願文之藏文內容..."
    },
    "availableLanguages": [
      "bo",
      "zh",
      "en"
    ],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "解疑_001",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": [
      "迴向"
    ],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": {
      "words": "藏 1 音節 | 中 9 字",
      "pages": "1 頁 (估算)",
      "readTime": "閱讀約 1 分鐘",
      "preview": "此祈願文之藏文內容..."
    },
    "availableLanguages": [
      "bo",
      "zh",
      "en"
    ],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "Dohas_001",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": [
      "迴向"
    ],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": {
      "words": "藏 1 音節 | 中 9 字",
      "pages": "1 頁 (估算)",
      "readTime": "閱讀約 1 分鐘",
      "preview": "此祈願文之藏文內容..."
    },
    "availableLanguages": [
      "bo",
      "zh",
      "en"
    ],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "longevity_001",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": [
      "迴向"
    ],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": {
      "words": "藏 1 音節 | 中 9 字",
      "pages": "1 頁 (估算)",
      "readTime": "閱讀約 1 分鐘",
      "preview": "此祈願文之藏文內容..."
    },
    "availableLanguages": [
      "bo",
      "zh",
      "en"
    ],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  }
]
