[
  {
    "id": "history_005",
    "tibetanTitle": "༄༅། །བུ་སྟོན་ཁ་ཆེས་མཛད་པའི་ཆོས་འབྱུང་རིན་པོ་ཆེའི་མཛོད་ལས། ག་པ་འཛིན་པ་ཚེ་དབང་ནོར་བུས་ཉེ་བར་བཏུས་པ་བཞུགས་སོ། །",
    "chineseTitle": "布敦大師所撰佛法源流寶藏錄之持明才旺諾布節錄文",
    "englishTitle": "From the Treasury of Religious History by Buton Rinchen Drub Compiled by the Vidyādhara Tsewang Norbu", 
    "author": "才旺諾布",
    "category": "歷史",
    "tags": ["佛法源流", "布敦大師", "Buton"],
    "ContentTibetan": "<p class=\"tibetan-text\">༈ ཨོཾ་སྭཱསྟི། རྒྱལ་བའི་བསྟན་པ་ལ་མཁས་པའི་ཁྱུ་མཆོག་བུ་སྟོན་རིན་ཆེན་གྲུབ་ཀྱི་ཞལ་སྔ་ནས་བོད་ཀྱི་རྒྱལ་རབས་ཇི་ལྟར་བཞེད་ནི་དེས་མཛད་པའི་ཆོས་འབྱུང་གསུང་རབ་རིན་པོ་ཆེའི་མཛོད་ལས་འབྱུང་བ། མདོར་བསྡུ་ན། རྒྱ་གར་གྱི་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོའམ་གསལ་རྒྱལ་འཆར་བྱེད་གང་རིམ་ཞིག་གི་སྲས་མཚན་དང་ལྡན་པ་ཞིག་བོད་ཡུལ་ལྷ་རིའི་ཡོལ་བའི་ཁར་བྱུང་སྟེ་བཙན་ཐང་སྒོ་བཞིར་བྱོན་པ་བོད་ཀྱི་རྒྱལ་པོ་གཉན་ཁྲི་བཙན་པོར་གྱུར་ལ། དེ་ནས་རིམ་པར་གནམ་ལ་ཁྲི་བདུན་གྲགས་པ་བྱུང་ཞིང་། ཁྲི་བདུན་གྱི་ཐ་མ་སྲིབ་གྲི་བཙན་པོའི་སྐབས་གདོན་བོན་གཤེན་ཚ་མི་བོ་ཆེ་ཞེས་པ་བྱུང་། དེ་ནས་བར་གྱི་ལྟང་ཅིག་པ་ཡི་ལེགས་དྲུག དེ་ནས་ལྡེ་བརྒྱད་དང་བཙན་བཞི་སྟེ་དེ་རྣམས་ཀྱི་གཉའ་ཁྲི་བཙན་པོ་ནས་རྒྱལ་རབས་ཉི་ཤུ་རྩ་དྲུག་སོང་བ་ལས་རྒྱལ་པོ་ཉི་ཤུའི་རང་ཆབ་སྲིད་བོན་གྱིས་སྐྱོང་བར་གྲགས་སོ། །དེའི་མཐར་གསང་བའི་བདག་པོས་བྱིན་གྱིས་བརླབ་པའི་རྒྱལ་པོ་ཐོ་ཐོ་རི་གཉན་བཙན་བྱོན། དེ་ཡི་དགོང་ལོ་དྲུག་ཅུ་བར་ཕོ་བྲང་ཡུམ་བུ་བླ་སྒང་གི་རྩེ་ན་བཞུགས་པར་ནམ་མཁའ་ནས་ཟ་མ་ཏོག་བཀོད་པ་དང་སྤང་ཀོང་ཕྱག་རྒྱའི་གླེགས་བམ་གསེར་གྱི་མཆོད་རྟེན་རྣམས་བབས་པས་དམ་པའི་ཆོས་ཀྱི་དབུ་དེ་ནས་བརྙེས། དེ་ལ་རྒྱལ་པོས་གཉན་པོ་གསང་བར་བཏགས་ཤིང་མཆོད་པའི་བྱིན་རླབས་ཀྱིས་དགུང་ལོ་བརྒྱ་དང་ཉི་ཤུ་ཐུབ། དེ་ནས་རྒྱལ་རབས་བཞི་པ་གནམ་རི་སྲོང་བཙན་དང་དེ་ཡི་བཙུན་མོ་འབྲི་བཟའ་ཐོད་དཀར་ལ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྤྲུལ་པའི་སྐུ་དབུ་ལ་འོད་དཔག་མེད་པ་མངོན་སུམ་དུ་བཞུགས་པའི་རྒྱལ་བུ་གཅིག་མེ་མོ་གླང་གི་ལོ་ལ་འཁྲུངས་ཏེ་མཚན་ལ། ཁྲི་སྲོང་བཙན་བཏགས་དགུང་ལོ་བཅུ་གཉིས་སར་རྒྱལ་ཐབས་མཛད་དེ་མཐའ་ཡི་རྒྱལ་ཕྲན་ཐམས་ཅད་དབང་དུ་འདུས་པས་སྐྱེས་འབུལ་གྱི་འཕྲིན་ཡིག་བཀླགས། དེས་བོད་ལ་ཡི་གེ་དགོས་པར་གཟིགས་ཏེ་ཐོན་མི་སཾ་བྷོ་ཊ་རྒྱ་གར་དུ་བཏང་ནས་པཎྜི་ཏ་ལྷ་རིག་སེང་གེ་ལ་སྒྲ་བསླབ་སྟེ་བོད་ཀྱི་སྐད་དང་བསྟུན་པའི་དབྱངས་གསལ་སུམ་ཅུ་གཟུགས་ཁ་ཆེའི་ཡི་གེ་ལ་དཔེ་བླངས་ཏེ་ལྷ་སའི་སྐུ་མཁར་དམར་རུར་བཀོད་ཅིང་དེ་ཡི་ཆ་རྐྱེན་སྒྲ་ཡི་བསྟན་བཅོས་བརྒྱད་མཛད། དེར་རྒྱལ་པོས་ཀྱང་ལོ་བཞི་ཡི་བར་མཚམས་བཅད་དེ་སྒྲ་ལ་སྦྱངས་བའི་ཚུལ་མཛད་དེ་མདོ་ཟ་མ་ཏོག་དང་དཀོན་མཆོག་སྤྲིན་རྣམས་བོད་སྐད་དུ་བསྒྱུར། དེ་ཚེ་བོད་འབངས་རྣམས་ཀྱིས་རྒྱལ་པོ་ལ་གཤེ་བ་གསན་ནས་མི་དགེ་བ་ལས་ལྡོག་པའི་དགེ་བཅུའི་ཁྲིམས་བཅོས་པས་མཚན་ལ། སྲོང་བཙན་སྒམ་པོར་གྲགས། <b>དེ་ནས་རྒྱ་གར་ཤར་ཕྱོགས་ནས་ཙནྡན་སྦྲུལ་གྱི་སྙིང་པོ་ལས་རང་བྱུང་དུ་བྱོན་པའི་སྤྱན་རས་གཟིགས་བཅུ་གཅིག་ཞལ་སྤྲུལ་པས་སྤྱན་དྲངས་བལ་པོའི་རྒྱལ་པོ་འོད་ཟེར་གོ་ཆའི་སྲས་མོ་ཁབ་ཏུ་བཞེས་པས་དེས་ལྷ་མི་བསྐྱོད་རྡོ་རྗེ། བྱམས་པ། ཙན་དན་གྱི་སྒྲོལ་མ་རྣམས་སྤྱན་དྲངས། རྒྱ་ཡི་རྒྱལ་པོ་སེང་གེ་བཙན་པོ་ཞེས་ཐང་གི་རྒྱལ་རབས་གཉིས་པའི་སྲས་མོ་ཀོང་ཇོ་ཁབ་ཏུ་བཞེས་ཏེ་དེས་འཕྲུལ་སྣང་གི་ཇོ་བོ་གདན་དྲངས་སོ། །དེ་ནས་ཁྲི་བཙུན་གྱི་གཙུག་ལག་ཁང་བཞེངས་འདོད་ཀྱང་བཞེངས་སུ་མ་བཏུབ་པར་བོད་ཀྱི་ས་གཞི་སྲིན་མོ་གན་རྐྱལ་དུ་འགྱེལ་བ་འདི་གནས་དགོས་པར་གཟིགས་ནས་དཔུང་པ་གཡས་པ་ཀ་ཚལ། གཡོན་པ་ཁྲ་འབྲུག ཀོང་པ་གཡས་པ་གཙང་འབྲམ། གཡོན་པ་གྲཾ་པ་རྒྱང་སྟེ་གཙུག་ལག་ཁང་བཞི། གྲུ་མོ་གཡས་ལ་ཀོང་པོ་བུ་ཆུ། གཡོན་ལ་ལྷོ་བྲག་ཁོ་མཐིང་། སྤུས་མོ་གཡས་ལ་ཀ་བྲག གཡོན་ལ་པྲ་བདུན་རྩེ་སྟེ་མཐའ་འདུལ་བཞི། ལག་མཐིལ་གཡས་ལ་བྱང་འཚལ་གྱི་རླུང་གནོན། གཡོན་ལ་ཁམས་ཀྱི་འདན་ཀློང་ཐང་སྒྲོན་མ། རྐང་མཐིལ་གཡས་ལ་མང་ཡུལ་བྱམས་སྤྲིན། གཡོན་ལ་མོན་ཡུལ་བུམ་ཐང་། སྤ་གྲོ་སྐྱེར་ཆུ་ལ་སོགས་པ་གཙུག་ལག་ཁང་མང་པོ་བཞེང་ནས་གདོད་འོ་ཐང་མཚོ་ལ་རྡོ་མཁར་རྩིགས། ཤིང་གིས་ཕུབ། ཀླུའི་འདམ་པས་ཞ་ལ་བྱས་ཏེ་ར་ལ་ས་བཀལ་ནས་བཏབ་སྟེ་ལྷ་སའི་གཙུག་ལག་ཁང་ར་ས་འཕྲུལ་སྣང་བཞེངས། བློ་འབུར་བྱང་མར་བཟོ་རྒྱུ་སྤུང་བ་ལ་རང་བྱོན་དུ་བྱུང་བའི་ངོ་བོ་ཐུགས་རྗེ་ཆེན་པོ་བཅུ་གཅིག་ཞལ་བཞུགས་གསུངས་སོ། །དེ་ནས་རྒྱལ་པོས་རྒྱ་ནག་རི་བོ་རྩེ་ལྔ། བྱོན་ནས་ལྷ་ཁང་བརྒྱ་རྩ་བརྒྱད་བཞེངས་སོ། །རྒྱ་མོ་ཀོང་ཇོས་ར་མོ་ཆེའི་གཙུག་ལག་ཁང་བཞེངས། དེའི་ཚེ་རྒྱ་གར་གྱི་སློབ་དཔོན་ཀུ་མ་ར་དང་། བྲམ་ཟེ་ཤམ་ཀ་ར་དང་། བལ་པོ་སློབ་དཔོན་ཤཱི་ལ་མཉྫུ་དང་། རྒྱ་ནག་གི་སློབ་དཔོན་ཧ་ཤང་མ་ཧཱ་དེ་ཚེ་དང་། ལོ་ཙཱ་བ་ཐོན་མོ་སཾ་བྷོ་ཊ་དང་། དེའི་མཆན་བུའི་དྷརྨ་ཀོ་ཤ་དང་། ལྷ་ལུང་རྡོ་རྗེ་དཔལ་རྣམས་ཀྱི་ཆོས་ཅི་རིགས་བསྒྱུར་ཅིང་གཏན་ལ་ཕབ་བོ། །རྒྱལ་པོ་དེས་ཐུགས་རྗེ་ཆེན་པོའི་སྤྲུལ་པར་གྲགས་ཤིང་ལིའི་བཙུན་པ་གཉིས་ཀྱི་ལོ་རྒྱུས་ཀྱང་ཡོད་དོ། །རྒྱལ་པོ་དེས་ལོ་དྲུག་ཅུ་རྩ་དགུ་རྒྱལ་སྲིད་བཟུང་སྟེ་བརྒྱད་ཅུ་རྩ་གཉིས་ལ་གཤེགས་སོ། །<b>དེ་དང་མཉམ་དུ་ཀོང་ཇོའི་ཞལ་ནས་ཤཱཀྱ་མུ་ནེ་ར་མོ་ཆེ་ནས་གདན་དྲོངས་ལ་འཕྲུལ་སྣང་གི་བློ་འབུར་དུ་སྦོས་སྒོ་ལ་ཞ་ལ་གྱིས་ལ་འཇམ་དབྱངས་བྲིས་ཤིག་གསུངས་ཏེ་ཁྲི་བཙུན་དང་མཉམ་དུ་གསུམ་ཀ་ཐུགས་རྗེ་ཆེན་པོ་ལ་ཐིམ་པའམ་འདས་སོ། །བློན་པོ་རྣམས་ཀྱིས་ཀྱང་ལྷ་གཉིས་བརྗེས་ཏེ་ཞལ་ཆེམས་ལྟར་བྱས་སོ། །རྒྱལ་པོ་དེའི་སྲས་མང་སྲོང་མང་བཙན། དེའི་སྲས་གུང་སྲོང་གུང་བཙན། དེའི་སྲས་འདུས་སྲོང་མང་པོ་རྗེ་དེའི་སྲས་རླུང་ནམ་འཕྲུལ་གྱི་རྒྱལ་པོ། དེ་ཡི་སྲས་ཁྲི་ལྡེ་བཙུག་བརྟན་ཏེ་དེ་ལྷ་ས་མཁར་བྲག་སོགས་བཙུག་ལག་ཁང་བརྒྱད་བཞེངས། བྲན་ཀ་མུ་ལ་ཀོ་ཎ། མྱག་ཛྙཱ་ན་ཀུ་མ་ལ་རས་མདོ་སྡེ་ལས་བརྒྱ་པ་དང་གསེར་འོད་དམ་པ་བསྒྱུར། རྩིས་དང་སྨན་དཔྱད་ཅི་རིགས་ཡང་དར་བར་བྱས། དེའི་སྲས་འཇང་ཚ་ལྷ་དབོན་ལ་རྒྱ་ཡི་རྒྱལ་པོའི་སྲས་མོ་གྱིམ་ཤང་ཀོང་ཇོ་བླང་བར་རྒྱལ་པོའི་སྲས་གཤེགས་པས་མེས་དང་ལྷག་ཏུ་འདུས་པ་ལས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་རྣམ་འཕྲུལ་ཁྲི་སྲོང་ལྡེ་བཙན་ས་ཕོ་རྟ་ལ་བལྟམས། དེ་ཆུང་ངུའི་དུས་སུ་རྒྱ་ཡི་ཡུལ་དུ་སང་ཤིང་སོགས་མི་བཞི་ཆོས་ཚོལ་བར་བཏང་བས་ཆོས་དང་ཧ་ཤང་གཅིག་བཅས་བོད་ཡུལ་དུ་སླེབས་ཀྱང་ཤུལ་དུ་རྒྱལ་པོ་གཤེགས་ཤིང་རྒྱལ་བུ་ནར་མ་སོན་པས་བོན་བློན་རྣམས་ཀྱིས་ཆོས་བྱེད་དུ་མི་སྟེར་བའི་ཁྲིམས་བུ་ཆུང་བཅས་པས་སང་ཤིའི་ཆོས་རྣམས་རེ་ཞིག་བྲག་ལ་སྦས། སླར་རྒྱལ་བུའི་ན་ཆུང་ཟད་སོན་ཏེ་རྒྱལ་སྲིད་མཛད་པའི་སྐབས་སང་ཤིའི་རྒྱལ་བུའི་སྙན་དུ་ཆོས་གསོལ་བར་དགྱེས། དེ་དང་མཐུན་པར་རྦ་གསལ་སྣང་མང་ཡུལ་གྱི་སོ་ཁར་ཡོད་པ་ཡང་འཁོར་ཏེ་རྒྱལ་པོ་ལ་ཆོས་བགྱིད་པར་གསོལ་བའི་འགོས་ཀྱི་བློ་གྲོས་ཀྱི་མ་ཞང་མཆད་དུ་ལོ་གསུམ་བཅུག་སྟེ་དེའི་རིང་གསལ་སྣང་ཨ་ཙཱརྱ་བོ་དྷེ་ས་ཏྭ་སྤྱན་འདྲེན་བཏང་ནས་མང་ཡུལ་དུ་ཕེབས་པ་ན་བློན་པོ་གསུམ་བསུ་བར་བརྫངས་ནས་རིམ་པས་བོད་དུ་བྱོན། ཕོ་བྲང་བྲག་དམར་དུ་རྒྱལ་པོ་མཇལ་འཕྲད་མཛད། ཕོ་བྲང་རླུང་འཚུབ་དུ་ཟླ་བ་བཞི་ཡི་བར་མཁན་པོས་ཆོས་བཤད་པས་བོད་ཀྱི་ནག་ཕྱོགས་ལྷ་འདྲེའི་ཆོ་འཕྲུལ་དང་བློན་པོ་བོན་ལ་དགའ་བ་རྣམས་ཀྱིས་ཆོས་བཤད་དུ་མ་སྟེར་བས་རེ་ཞིག་མཁན་པོ་བལ་ཡུལ་དུ་བསྐྱལ། <b>དེ་ནས་རི་ས་ཤིག་ལོན་པ་ན་གསལ་སྣང་རྒྱ་ཡི་ཡུལ་ཆོས་འཚོལ་བ་དང་། སང་ཤིང་མཁན་པོ་སྤྱན་དྲངས་བར་བརྫངས་ཤིང་། སླར་ཡང་གསལ་སྣང་རྒྱ་ནས་འཁོར་ཏེ་མཁན་པོ་སྤྱན་འདྲེན་ཆེད་དུ་བསྐྱར་དུ་བརྫངས་པས་མཁན་པོ་བོད་དུ་ཕེབས། བསམ་ཡས་ཀྱི་ས་འདུལ་མཛད་པས་ལ་ཉེ་རྟེན་འབྲེལ་ཤིན་ཏུ་ལེགས། འོན་ཀྱང་བོད་ཡུལ་གྱི་ལྷ་འདྲེ་གདུག་པ་ཆེ་བས་དེ་དག་ཇི་བཞིན་འདུལ་བར་མ་བཟོད་པས་ཨོ་རྒྱན་གྱི་མཁན་པོ་པདྨ་སཾ་བྷ་ཝ་སྤྱན་དྲོངས་ཤིག་པར་ལུང་བསྟན་རྒྱལ་པོས་དེ་སྤྱན་འདྲེན་པར་ཕོ་ཉ་བདུན་བཏང་ནས་སློབ་དཔོན་གྱིས་མཁྱེན་ཏེ། མང་ཡུལ་དུ་བྱོན་པ་དང་མཇལ་ནས་རིམ་པས་ལྷ་སྲིན་དམ་ལ་བཏགས་ཀྱིན་བསམ་ཡས་སུ་ཕེབས། སློབ་དཔོན་གྱི་ས་ཕྱོགས་སུ་མཁན་པོས་ས་བཅད་མཛད་ཨོ་ཏནྟ་པུ་རིའི་གཙུག་ལག་ཁང་ལ་དཔེ་མཛད་དེ་མེ་མོ་ཡོས་བུའི་ལོ་ལ་རྨང་བཏིང་སྔོན་དུ་ཨཱརྱ་པཱ་ལོ་བཞེངས། ས་མོ་ཡོས་ཀྱི་ལོ་ལ་ཚར་ཞེས་གསུང་ཀྱང་མཁས་མཆོག་བུ་ལྟ་བུ་ལ་འཁྲུལ་པ་རགས་པ་འདི་ལྟ་བུ་གང་ལ་མང་། དེ་ནི་ཡིག་མཁན་གྱི་ལོ་ཁམས་ནོར་བར་མངོན། བསམ་ཡས་ལ་པདྨ་སམ་བྷ་ཝ་དང་བོ་དྷེ་ས་ཏྭ་གཉིས་ཀས་རབ་ཏུ་གནས་པ་མཛད། ལོ་དེའི་ཕྱི་མ་སད་མི་བདུན་རབ་ཏུ་བྱུང་། དེ་ནས་སློབ་དཔོན་ཆེན་པོ་ཡི་མངོན་པར་ཤེས་པའི་མཐུ་དང་རྫུ་འཕྲུལ་གྱིས་བློན་པོ་རྣམས་གུ་དོག་པས་རྒྱལ་པོ་ལ་ནན་གྱིས་ཞུས་ཏེ་རྒྱ་གར་དུ་བརྫངས། གཞན་རྒྱ་གར་གྱི་སློབ་དཔོན་བི་མ་ལ་མི་ཏྲ། བྷཱུདྡྷ་གུ་ཧྱ། ཤིནྟཾ་གཪྦྷ། བི་ཤཱུདྡྷ་སིངྷ། ཡོ་ག་མཁན་དྷརྨ་ཀིརྟི་སོགས་སྤྱན་དྲངས། སད་མི་བདུན་སོགས་ལོ་ཙཱ་རྣམས་ཀྱིས་ཆོས་རྒྱ་ཆེར་བསྒྱུར། འབྲུག་ལོ་ཕོ་བྲང་གདན་དཀར་དུ་བཞུགས་པའི་སྐབས་བོད་དུ་འགྱུར་བའི་ཆོས་རྣམས་དཀར་ཆག་གིས་གཏན་ལ་ཕབ། <b>དེ་ནས་མི་རིང་བར་མཁན་པོ་བོ་དྷེ་ས་ཏྭ་ཡང་ཞི་བར་གཤེགས། དཔལ་དབྱངས་སློབ་དཔོན་དུ་བསྐོས་ནས་སྦ་ཡེ་ཤེས་དབང་པོ་ལྷོ་བྲག་ཏུ་བསྒོམ་པར་གཤེགས། དེའི་འོག་ཏུ་ཧ་ཤང་དང་ཆོས་ཀྱི་རྩོད་པ་བྱུང་བར་མཁན་པོའི་སློབ་མ་ཀ་མ་ལ་ཤཱི་ལས་ཧ་ཤང་བཏུལ་ནས་རྒྱ་ནག་ཏུ་བརྫངས། ཡེ་ཤེས་དབང་པོ་ཁམས་ཀྱི་ཟས་སྤང་སྟེ་གཤེགས། མངའ་བདག་ཡང་དགུང་ལོ་དྲུག་ཅུ་རྩ་དགུ་པ་གཤེགས་པར་གསུངས་ཏེ་ས་རྟ་ལ་འཁྲུངས་གཤིས་མེ་སྟག་ལ་གཤེགས་པར་མངོན། དེ་ནས་སྲས་མུ་ནེ་བཙན་པོས་ཆུ་སྟག་ལ་རྒྱལ་སྲིད་བཟུང་། བསམ་ཡས་སུ་མཆོད་པ་ཆེན་པོ་བཞི་བཙུགས། བོད་འབངས་ཀྱི་ལྟོག་ཕྱུག་ལན་གསུམ་སྙོམས། ཆབ་སྲིད་ལོ་གཅིག་དང་ཟླ་བདུན་གྱི་མཐར་ཡུམ་གྱིས་དུག་བཏང་ནས་གཤེགས། དེ་ནས་གཅུང་ཁྲི་ལྡེ་བཙན་པོ་ལོ་བཞི་པ་རྒྱལ་སྲིད་གཏད་པས་སད་ན་ལེགས་གྲགས། དེས་སྐར་ཆུང་རྒྱལ་སྡེའི་གཙུག་ལག་ཁང་བཞེངས། ཆོས་ཀྱི་སྲོལ་ཆེར་མཛད། དེ་ལ་སྲས་ལྔ། ཁྲི་རལ། གཙང་མ། ཁྲི་དར་མ། ལྷ་རྗེ་ལྷུན་གྲུབ། ཁྲི་ཆེན། དེ་ལས་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོའི་སྤྲུལ་པ་རལ་པ་ཅན་དགུང་ལོ་བཅོ་བརྒྱད་པར་ཆབ་སྲིད་བཟུང་། ཕོ་བྲང་འོ་འཇང་དོ་བཞེངས། རྒྱ་ལ་དམག་དྲངས་ཏེ་བཅོམ་ཞིང་སླར་རྒྱ་དང་དུམ་བྱས་ནས་ལྷ་སར་རྡོ་རིང་བཙུགས། དེ་ནས་དགུང་ལོ་སོ་དྲུག་པ་ལྕགས་མོ་བྱ་ལ་བློན་པོས་བཀྲོངས་ཏེ་རྒྱལ་སྲིད་ལ་གླང་དར་མ་བཞག དེ་ནར་སོན་པ་དང་སངས་རྒྱས་ཀྱི་བསྟན་པ་ལ་གནོད་པ་ཆེར་བྱས། དེ་ནས་རིངས་ཤིག་ན་ལྷ་ལུང་དཔལ་གྱི་རྡོ་རྗེས་རྒྱལ་པོ་སྡིག་ཏོ་ཅན་དེ་ལྷ་སའི་རྡོ་རིང་གི་ཡི་གེ་ཀློགས་པར་ཡོད་པས་དེར་བསྒྲལ། རྒྱལ་པོ་དེ་ཡི་བཙུན་མོ་ཆུང་མ་ལ་སྲས་གཅིག་བྱུང་བ་མཚན་མོ་མར་མེའི་འོད་ཀྱིས་བསྲུང་བས་འོད་བསྲུང་དུ་གྲགས། ཆེན་མ་ལ་ཁྱེའུ་སྐྱེས་མ་ཐག་སོ་ཅན་ཞིག་བྱུང་བ་ཡུམ་བརྟན་གྲགས། གནམ་ལྡེ་འོད་བསྲུང་ལོ་དྲུག་ཅུ་རྩ་གསུམ་པར་གཤེགས་ཤིང་། དེ་ཡི་མ་སྲས་ཉིས་ཁྲི་བཀྲ་ཤིས་བརྩེགས་དང་། ཁྲི་ཉི་མ་མགོན་ཡིན་ལ། ཉི་མ་མགོན་མངའ་རིས་སུ་གཤེགས་ཏེ། དེ་ལ་སྲས་གསུམ། ཆེ་བ་རིག་པ་མགོན་མར་ཡུལ་གྱི་བདག་པོ་དང་། འབྲིང་བ་བཀྲ་ཤིས་མགོན་སྤུ་རོང་གི་བདག་པོ། ཆུང་བ་ལྡེ་གཙུག་མགོན་ཞང་ཞུང་གི་བདག་པོར་གྱུར། <b>ཆུང་བ་ལ་སྲས་དྲང་སྲོང་དང་འཁོར་ལོ་ལྡེ་གཉིས་སྟེ་མགྱོགས་མིང་དུ་སྲོང་ཁོ་རེར་གྲགས་སོང་ངེ་རབ་ཏུ་བྱུང་བ་ལ། མཚན་ཡེ་ཤེས་འོད་དེ། དེ་ཡི་ཁྱིའུ་བློ་རྣོ་བ་ཉི་ཤུ་རྩ་གཅིག་རྒྱ་གར་དུ་བཏང་བ་ལ་བཅོ་བརྒྱད་ཚད་པས་ཤི་ཞིང་གཉིས་བོད་དུ་ལོག་པ་ལ་ལོ་ཆེན་རིན་ཆེན་བཟང་པོ་དང་ལོ་ཆུང་ལེགས་པའི་ཤེས་རབ་སྟེ་བསྟན་པ་ལ་ཤིན་ཏུ་ཕན་པར་བྱུང་། གཞན་ཡང་པཎྜི་ཏ་མང་དུ་སྤྱན་དྲངས་ཤིང་། མདོ་སྔགས་ཅི་རིགས་པ་བསྒྱུར། ཁྱད་པར་ཡོ་ག་དང་གསང་འདུས་རྩལ་དུ་བཏོན། པཎྜི་ཏ་སྨྲྀ་ཏི་ཡང་བལ་པོ་བརྒྱུད་བོད་ནས་མདོ་ཁམས་སུ་གཤེགས་པ་འདི་སྐབས་ཡིན་པར་སྣང་། གཅུང་ཁོ་རེའི་སྲས་ལྷ་ལྡེ། དེ་ལ་སྲས་གསུམ་འོད་ལྡེ་དང་། ཕོ་བྲང་ཞི་བ་འོད། བཙུན་པ་བྱང་ཆུབ་འོད་སྟེ་བྱང་ཆུབ་འོད་ཀྱི་འབད་པས་ཇོ་བོ་རྗེ་བོད་དུ་སྤྱན་དྲངས་པས་བཀའ་དྲིན་ཤིན་ཏུ་ཆེ། བསྟན་པ་ཕྱི་དར་མདོ་ཁམས་ནས་བྱུང་བ་ནི་སྔར་གླང་དར་གྱིས་བསྟན་པ་བསྣུབ་པའི་སྐབས་སུ་གཙང་གཡོ་རྨ་གསུམ་གྱིས་གླེགས་བམ་ཇི་སྙེད་པ་བསྣམས་ཏེ་ཁམས་སུ་བྲོས་ཏེ་བཞུགས་པ་ལ་མོས་པས་སྤྱོད་པའི་ས་པ་དམུ་ཟི་རབ་གསལ་ཞེས་རབ་ཏུ་བྱུང་བས་མཚན་དགེ་བ་རབ་གསལ་བཏགས། ཤེས་རབ་ཆེ་བས་ཕྱིས་བླ་ཆེན་པོ་དགོངས་པ་རབ་གསལ་དུ་གྲགས། རབ་ཏུ་བྱུང་བའི་ལོ་ཕྱི་མར་སྔར་གྱི་མཁན་སློབ་དང་རྒྱ་ནག་ཧ་ཤང་གིས་ཁ་བསྐང་བྱས་ཏེ་བསྙེན་པར་རྫོགས། བསྙེན་པར་རྫོགས་ནས་ལོ་ལྔ་ལོན་པ་ན་དབུས་གཙང་གི་སྡེ་མི་བཅུ་མདོ་ཁམས་སུ་བྱོན་ནས་གཙང་པ་ལ་བསྙེན་པར་རྫོགས་པའི་བཀའ་དྲིན་ཞུས་པར་བླ་ཆེན་པོར་ཞུས་ཞིག་པ་བསྩལ་བས་ཁོང་རྣམས་བླ་ཆེན་པོ་ལ་དགེ་སློང་གི་དངོས་པོ་བསྒྲུབ། ཁོང་རྣམས་བོད་དུ་ཡོང་ནས་ཀླུ་མེས་སོགས་དབུས་མི་ལྔ་ཡི་དབུས་སུ་གནས་གཞི་ཐ་དད་རྩིགས་ཤིང་། ལ་སྟན་སོགས་གཙང་པ་ལྔ་ཡི་གཙང་དུ་གནས་གཞི་ཐ་དད་བཟུང་སྟེ་རྒྱལ་བ་ཤཱཀྱའི་བསྟན་པ་ལ་རྒྱས་པར་བྱས་སོ། །<b>འོན་ཀྱང་བླ་ཆེན་པོའི་མཁན་བརྒྱུད་དང་དབུས་གཙང་མི་བཅུའི་སྡོམ་པ་བླང་བའི་མཁན་པོ་ལོ་རྒྱུས་མི་མཐུན་པ་ཡོད་འདུག་ལ། དེ་ཡང་འདི་སྐད་ཅེས་འབྱུང་སྟེ་ཁ་ཅིག་ན་རེ་མཁན་པོ་བོ་དྷེ་ས་ཏྭའི་མཁན་བུ་རྦ་རཏྣ། དེས་ལྷ་ལུང་རྣལ་འབྱོར་དབྱངས། དེས་བླ་ཆེན་པོ་དགོངས་གསལ་དེས་ས་གོང་ཡེ་ཤེས་གཡུང་དྲུང་། དེས་གྲུམ་ཡེ་ཤེས་རྒྱལ་མཚན། དེས་ཀླུ་མེ་ལ་སོགས་པའོ་ཞེས་ཟེར་བ་དང་། བཀའ་ཆེམས་ཀྱི་ཡི་གེ་ཁ་ཅིག་ན་རེ། མཁན་པོ་བོ་དྷེ་ས་ཏྭའི་སློབ་མ་ད་ན་ཤི་ལ་དང་། ཛི་ན་མི་ཏྲས་བྱས་ནས་རྦ་རཏྣ་དེས་གཡོག་དགེ་འབྱུང་། དེས་བླ་ཆེན་དགོངས་པ་གསལ། དེས་སྒྲོལ་མཉྫུ་ཤྲཱི། དེས་གྲུམ་ཡེ་ཤེས་རྒྱལ་མཚན། དེའི་ཀླུ་མེས་ཞེས་འབྱུང་བ་དང་། རིག་རལ་ན་རེ། བླ་ཆེན་པོའམ་མཁན་བུ་གྲུམ་ལ་དབུས་གཙང་གི་མི་བཅུའི་སྡོམ་པ་བླང་ཟེར་བ་རྣམས་བརྟག་དགོས་སོ། །ཡང་གཡོ་ལ་སོགས་པ་རྣམས་ཁ་ཅིག་ཛི་ན་མི་ཏྲའི་མཁན་བརྒྱུད་བླང་འདོད་ཁ་ཅིག་ཞི་བ་འཚོའི་མཁན་བརྒྱུད་དུ་འཆད་པས་བརྟག་པར་བྱའོ། །དེ་ལྟར་དབུས་གཙང་དུ་བསྟན་པ་མེད་པ་ལོ་བདུན་ཅུ་བྱུང་ནས་དབུས་གཙང་གི་མི་བཅུས་བསྟན་པ་བཙུགས་པ་ཡིན་ཏེ། མི་བཅུ་དབུས་སུ་བྱོན་ཙ་ན་རྒན་མོ་ཞིག་ན་རེ་ང་ལོ་དྲུག་ལོན་པ་ན་བཙུན་པ་མཐོང་ཟེར། ཅི་ཙམ་ལོན་བྲིས་པས་ལོ་བདུན་ཅུ་དོན་དྲུག་ལོན་ཟེར་བས་སོ་ཞེས་ཟེར་ལ། ཁ་ཅིག་ལོ་བརྒྱ་རྩ་བརྒྱད་སོང་ཟེར། ཞེས་བུ་སྟོན་ཆེན་པོའི་བསྟན་པ་ཕྱི་དར་ཆུ་བྱ་ལོ་ལ་འདོད་ཞེས་པའི་གཏན་ཚིགས་ཡང་གསུང་དེ་ཡིན་ནོ། །དེ་སྐད་བུ་སྟོན་ཁ་ཆེའི་མཛད་པའི་ཆོས་འབྱུང་རིན་པོ་ཆེའི་མཛོད་ལས་རིག་པ་འཛིན་པས་ཉེ་བར་བཏུས་པའོ། །སརྦ་མངྒ་ལཾ།</p>",
    "ContentChinese": "<p class=\"english-text\">嗡娑帝<b>竊聞西藏王統之始末，據布敦仁欽竹大師所著《佛法源流寶藏》云：天竺國王色堅心王之子，具相好者，降生於雪域天幕之巔，後至贊塘四門，是為聶赤贊普。其後有天王七代，末代斯日贊普時，有本教師贊米波且者。<b>其後有朗七王，繼有德八王及贊四王。自聶赤贊至是，凡二十有六代。其中二十王以苯教治國。及後，觀世音加持之王托托日年贊即位。其六十歲時，居雍布拉岡宮，天降《華嚴經》及《手印經》并金塔，始得正法。王以為密寶而供奉之，福蔭所及，享年一百二十。<b>後四世為南日松贊，妃阿沙托嘎生一王子，乃觀世音化身，頂有無量光佛現於其身。生於丁丑年，號赤松贊。十二歲即位，諸邦歸附，進貢書信可讀。王見藏地需文字，遣禪米桑布扎赴天竺，從班智達獅子慧學習聲明，依藏語制三十音之文字，取法于闐文。於拉薩紅宮制定，並著八部文法論。王亦閉關四年修習聲明，譯《華嚴經》及《寶雲經》。<b>時藏民非議，王聞之，立十善法禁止惡業，故號松贊干布。後迎東印檀香木所現十一面觀音，納尼泊爾王子光甲女為妃，攜無動佛、彌勒佛、檀香度母等像。復納唐太宗女文成公主，攜來佛陀像。建赤孜寺，為降伏雪域大地如屍臥之羅剎女，建立四大廟、四邊寺及四隅寺，並建立布達拉宮。<b>時有天竺阿闍黎矩摩羅、婆羅門商羯羅、尼泊爾阿闍黎施羅曼殊、漢地和尚摩訶提婆、譯師禪米桑布扎及其弟子達磨戈沙、拉龍多杰巴等譯經立說。是王以觀世音化身聞名，傳有二漢僧之事。在位六十九年，享年八十二而崩。<b>時文成公主謂：“宜遷佛像自大昭寺至布達拉宮之北壁，繪文殊菩薩像。”既而與赤孜並歸寂於觀世音前。羣臣亦依遺命更易二佛之位。<b>其子芒松芒贊，子貢松貢贊，子都松莽布杰，子隆南朱爾之王，子赤德祖贊。赤德祖贊建拉薩殿八座，命班卡木拉戈那、乃若那庫瑪羅譯《百業經》、《金光明經》，復興醫算諸學。<b>其子姜扎拉翁有唐國公主金城公主，然王子先崩。後生一子具文殊菩薩化身之相，生於土馬年，是為赤松德贊。少時遣桑興等四人赴漢求法，攜經像一和尚至藏，然王已崩，太子未立，本教大臣不許行法，立禁童規，桑興藏經於巖。<b>及王子稍長掌國，桑興以法事奏聞，王悅。時惹格薩囊在芒域邊地，亦來朝覲，請弘法事。遣其入昂果智慧之門下三年習法。期間薩囊延請阿闍黎菩提薩埵至芒域，遣三臣迎之，漸至西藏。王於赤岩宮相見，於風宮說法四月。<b>然以藏地鬼神作祟，本教大臣喜奉鬼法，不得宣化，暫送大師還尼泊爾。後薩囊赴漢求法，復迎桑興和尚。薩囊自漢回，再迎大師入藏。於桑耶寺行鎮土法，因緣殊勝。然藏地邪魔難降，當迎鄔金大師蓮華生。王遣七使迎請，大師知之，至芒域相見，漸降諸魔至桑耶寺。<b>大師定基址，阿闍黎定規制，效那爛陀寺為式，己巳年奠基，先建阿里巴羅殿。雖云戊子年竣工，然此說不確，恐為書者之誤。蓮華生、菩提薩埵二師共作開光。是年後有七人出家。後因大師神通廣大，諸臣心生嫉妒，奏請王遣其還印。<b>復迎印師毗摩密多、佛陀笈多、寂藏、淨獅、瑜伽師達磨吉祥等。七士等譯師廣譯經典。辰年王居甘噶殿時，制藏地所譯經典目錄。<b>未幾，阿闍黎菩提薩埵亦入寂。立巴爾揚為師，巴耶謝旺布往洛札修行。其後漢僧與藏僧爭論佛法，請菩提薩埵弟子蓮花戒降伏漢僧，遣其還漢。耶謝旺布絕食而寂。贊普享年六十九歲而崩，生於土馬，卒於火虎。<b>其子穆尼贊普於水虎年即位，設桑耶四大供，三賜藏民財物均貧，治國一年七月，為后所毒而崩。其弟赤德贊年四歲即位，號薩那勒札。建噶瓊桂寺，大興佛法。生五子：赤繞、藏瑪、赤達瑪、拉杰倫珠、赤欽。<b>其中菩薩化身熱巴堅十八歲即位，建烏江多殿，征漢得勝，後與漢和好，立碑於拉薩。三十六歲鐵鳥年為臣所弒，立郎達瑪為王。及其長成，大害佛法。後由拉龍華多杰於拉薩碑前誅此惡王。<b>是王小妃生一子，以燈光護之，號鄔松。大妃生一子，生即有齒，號雍丹。烏松六十三歲崩。其母子系有尼赤扎西則與赤尼瑪袞。尼瑪袞往阿里，生三子：長曰日巴袞為瑪域主，中曰扎西袞為普絨主，幼曰德祖袞為象雄主。<b>幼者生昭松與廓勒德二子，廓勒德出家，號耶謝沃。選二十一聰慧童子赴印，十八人死於暑，二人還藏，為大譯師仁欽桑布與小譯師勒巴謝繞，大益佛法。又迎諸班智達，譯諸經典，尤重瑜伽密部。班智達斯密帝由尼泊爾入藏至多麻，似在此時。廓勒德子拉德，生三子：沃德、寂光沃、僧菩提沃。因菩提沃之請，迎至尊入藏，恩德甚大。<b>佛法後弘自多麻始者，初郎達瑪滅法時，藏瑜瑪三人攜經藏至康地。慕行者竇子繞薩出家，號德繞薩，智慧超群，後號大師功德明。次年以前師弟子及漢僧和尚為助緣受具足戒。受戒五年後，衛藏十人至康地，請藏人傳具足戒恩，稟告大師。彼等以大師為戒師受具足戒。<b>十人歸藏，魯美等五人於衛地各建寺院，拉敦等五人於藏地各立道場，大興釋迦遺教。<b>然大師傳承與衛藏十人受戒之師承，史有異說。或云菩提薩埵傳巴惹那，傳拉龍瑜伽音，傳大師功德明，傳薩貢耶謝雍仲，傳竹耶謝堅贊，傳魯美等。<b>又有遺教文獻云：菩提薩埵弟子達那施羅與智那密多傳巴惹那，傳約德郡，傳大師功德明，傳卓曼殊室利，傳竹耶謝堅贊，傳魯美。<b>智惹云：大師之弟子竹傳衛藏十人戒法云者，當詳考之。又瑜等或願受智那密多傳承，或願受寂護傳承，此亦當考。<b>衛藏無佛法者七十載，後十人立教。十人至衛時，有老嫗云：“吾六歲見僧人。‘問年幾何？’，答曰：‘七十有六。’”或云百有八載。布敦大師定後弘始於水雞年者，據此為證。<b>又據布敦大師所撰《佛法源流寶藏》，持明者輯錄。薩哇 芒嘎朗！。</p>", 
    "ContentEnglish": "<p class=\"chinese-text\"> Oṃ Svāsti!<b>According to the lineage of Tibetan kings as related by that most excellent among the learned in the Buddha's teaching, Buton Rinchen Drub, from his work “Treasury of Sacred Scriptures on Religious History,” briefly summarized:<b>A certain prince of royal lineage from an Indian king named Rūpakāya Snying-po or Gsal-rgyal 'char-byed came forth in the valley of Lha-ri in the land of Tibet and arrived at Btsan-thang sgo-bzhi, becoming the Tibetan king Gnyan-khri btsan-po. From him, the famous Seven Celestial Thrones (gnam-la khri-bdun) appeared in succession, and during the time of the last of these seven, Srib-gri btsan-po, there appeared the demon-taming Bon priest Gshen Tsha-mi bo-che.<b>Thereafter followed the intermediate period of the Six Legs, then the Eight Lde and the Four Btsan. From Gnya'-khri btsan-po onward, twenty-six generations of royal lineage passed, and the realm of the twenty kings was renowned to be governed by Srid-bon priests. <b>At the end of this period came the king blessed by the Secret Lord, Tho-tho-ri gnyan-btsan. When he reached his sixtieth year, whilst dwelling atop the palace of Yum-bu bla-sgang, from the sky fell a golden casket adorned with flowers, the book of Pang-kong phyag-rgya, and golden stupas. Thus was the beginning of the Sacred Dharma obtained. The king reverently guarded these treasures in secret and through the blessings of his devotions, he lived to one hundred and twenty years. <b>Then came the fourth in the royal lineage, Gnam-ri srong-btsan, and his queen 'Bri-bza' thod-dkar. To them was born a prince who was a manifestation of noble Avalokiteśvara, with Amitābha Buddha manifestly present above his head. He was born in the Fire-Ox year and named Khri-srong btsan. At the age of twelve years he assumed the throne, and having brought all the border principalities under his dominion, he received tribute letters. Perceiving that Tibet had need of writing, he sent Thon-mi Sambhoṭa to India, where he studied grammar with the paṇḍita Lha-rig seng-ge. Adapting to the Tibetan language, he created thirty clear vowel and consonant signs, taking the Kashmiri script as his model, and arranged them in the Lhasa palace at Sku-mkhar dmar-ru. He composed eight grammatical treatises to accompany this system. <b>The king himself spent four years in retreat studying grammar, and translated the Ratnamegha-sūtra and Ratnamegha into Tibetan. At that time, the Tibetan subjects, hearing the king's discourse, turned from unwholesome deeds and established laws based on the ten virtues. Thus he became known as Srong-btsan sgam-po. <b>Then from eastern India, he welcomed the eleven-faced Avalokiteśvara that had manifestly appeared from the heart of a sandalwood nāga, and took as queen the daughter of the Nepalese king 'Od-zer go-cha, who brought the images of Akṣobhya, Maitreya, and the sandalwood Tārā. From the Chinese emperor Seng-ge btsan-po, second of the Tang dynasty, he took as queen Kong-jo, who brought the miraculous Jowo statue. <b>When he desired to build the Trulnang temple but found it could not be constructed, he perceived that the earth of Tibet was a demoness lying supine and needed to be subdued. Thus he built temples: on the right shoulder at Ka-tshal, on the left at Khra-'brug; on the right hip at Gtsang-'bram, on the left at Gram-pa rgyang—these four temples. On the right elbow at Kong-po bu-chu, on the left at Lho-brag kho-mthing; on the right wrist at Ka-brag, on the left at Pra-bdun rtse—these four border-taming temples. On the right palm to suppress the wind at Byang-'tshal, on the left at 'Dan-klong thang-sgron-ma in Khams. On the right sole at Mang-yul byams-sprin, on the left at Mon-yul bum-thang, and at Spa-gro skyer-chu—many temples in all. <b>At the original 'O-thang lake, he built a stone fortress, covered it with wood, made foundations with nāga-clay, filled it with earth, and constructed the miraculous Trulnang temple of Lhasa. In the upper chamber to the north, it is said that the naturally arisen embodiment of the Great Compassionate One with eleven faces took residence. <b>Then the king went to China's Wu-tai shan and built one hundred and eight temples. The Chinese princess Kong-jo built the Ra-mo-che temple. At that time, the Indian ācārya Kumāra, the brahmin Śaṃkara, the Nepalese teacher Śīlā-mañju, the Chinese master Hva-shang Mahāyāna, the translator Thon-mi Sambhoṭa, his disciple Dharma-kośa, and Lha-lung rdo-rje dpal translated and established various teachings. <b>This king was renowned as a manifestation of the Great Compassionate One, and there exist accounts of the two Chinese princesses as well. This king ruled for sixty-nine years and passed away at the age of eighty-two. <b>Simultaneously, Kong-jo spoke from her deathbed, saying that the Śākyamuni statue should be moved from Ra-mo-che to Trulnang, and that Mañjuśrī should be painted with lac on the door of the upper chamber. She, together with Khri-btsun, all three dissolved into the Great Compassionate One, or passed away. The ministers also exchanged the two statues according to her testament. <b>The sons and successors followed: Mang-srong mang-btsan, his son Gung-srong gung-btsan, his son 'Dus-srong mang-po-rje, his son the miraculous king Rlung-nam 'khrul, and his son Khri-lde gtsug-brtsan, who built eight temples including Lhasa mkhar-brag. The brahmin Kamalakoṇa and Myag Jñānakumāra translated the Śatasāhasrikā Prajñāpāramitā and the Suvarṇabhāsottama, and various sciences of calculation and medicine flourished. <b>His son 'Jang-tsha lha-dbon went to take the Chinese princess Gyim-shang kong-jo as bride, but the king's son died en route. From his father's exceptional merit came the manifestation of Mañjuśrī as a youth, Khri-srong lde-btsan, born in the Earth-Horse year.<b>When he was young, four men including Sang-shi were sent to China to seek the Dharma. They returned with teachings and a Chinese monk, but subsequently the king died and the prince had not yet come of age. The Bon ministers made laws forbidding the practice of Dharma even by children, so Sang-shi's teachings were temporarily hidden in the rocks. <b>Later, when the prince had grown somewhat and assumed royal power, he was pleased when Sang-shi requested to teach the Dharma to the prince. In accordance with this, Rba Gsal-snang, who was at the border of Mang-yul, also returned and requested the king to practice Dharma. Following the advice of his maternal uncle Mchad, he was imprisoned for three years, during which time Gsal-snang sent invitation to Ācārya Bodhisattva. <b>When the master arrived in Mang-yul, three ministers were sent to receive him, and he gradually came to Tibet. He met the king at Pho-brang brag-dmar palace. At Pho-brang rlung-'tshub palace, for four months the abbot taught the Dharma, but the dark forces of Tibet—the magical displays of gods and demons, and the ministers who favored Bon—prevented the teaching of Dharma, so the abbot was temporarily sent back to Nepal. <b>Then, after some time had passed, Gsal-snang departed again for China to seek the Dharma and pretended to invite the abbot Sang-shi. Once more Gsal-snang returned from China and again pretended to invite the abbot, whereupon the abbot came to Tibet. When he performed the earth-taming ritual at Samye, the auspicious circumstances were exceedingly favorable. <b>However, since the malevolent gods and demons of Tibet were fierce and could not be properly subdued as they were, it was prophesied that the abbot Padmasambhava of Oḍḍiyāna should be invited. The king sent seven messengers to invite him, and the master, having knowledge thereof, came to Mang-yul. Upon meeting him, he gradually bound the gods and demons under oath and proceeded to Samye. <b>In the direction where the master resided, the abbot broke ground, taking as model the temple of Otantapuri, and in the Fire-Female-Sheep year, construction began with first building the Ārya Pāla. Though it is said to have been completed in the Earth-Female-Sheep year, how could such a gross error occur to an excellent scholar like Buton? This is clearly an error in the scribe's calculation of years and elements. <b>At Samye, both Padmasambhava and Bodhisattva performed the consecration ritual. In the following year, the seven Sad-mi were ordained as monks. Thereafter, through the great master's clairvoyant powers and magical displays, the ministers became jealous and earnestly petitioned the king, whereupon he was sent back to India. <b>Other Indian masters were invited: Vimalamitra, Buddha-guhya, Śāntam-garbha, Viśuddha-siṃha, the yoga master Dharma-kīrti, and others. The seven Sad-mi and other translators translated the Dharma extensively. During the Dragon year, whilst residing at Pho-brang gdan-dkar palace, the teachings to be translated into Tibetan were definitively established through catalogues. <b>Not long thereafter, the abbot Bodhisattva also passed into peace. Dpal-dbyangs was appointed as master, and Sba Ye-shes dbang-po departed to meditate in Lho-brag. Afterwards, when doctrinal disputes arose with the Chinese Hva-shang, the abbot's disciple Kamalaśīla defeated the Hva-shang and sent him back to China. Ye-shes dbang-po departed for the borderlands of Khams, abandoning food. The sovereign also passed away at the age of sixty-nine, having been born in the Earth-Horse year and died in the Fire-Tiger year. <b>Thereafter his son Mu-ne btsan-po assumed royal power in the Water-Tiger year. He established four great offerings at Samye and equalized the wealth of rich and poor Tibetan subjects three times. After one year and seven months of rule, he was poisoned by his mother and died. Then his younger brother Khri-lde btsan-po, having been entrusted with royal power for four years, was renowned as Sad-na legs-grags. <b>He built the Skar-chung rgyal-sde temple and greatly promoted the custom of Dharma. He had five sons: Khri-ral, Gtsang-ma, Khri dar-ma, Lha-rje lhun-grub, and Khri-chen. Of these, Ral-pa-can, a manifestation of a great bodhisattva, assumed royal power at the age of eighteen. He built the 'O-'jang-do palace, led armies against China and conquered it, then made a treaty with China and erected a stone pillar in Lhasa. <b>Then at the age of thirty-six, in the Iron-Female-Bird year, he was murdered by ministers who placed Lang dar-ma on the throne. When that one came to power, he greatly harmed the Buddha's teaching. Then, after some time had passed, Lha-lung dpal-gyi rdo-rje, seeing that the evil king was present at the Lhasa stone pillar reading inscriptions, slew him there. <b>This king's younger queen bore one son who was protected by lamplight at night, hence known as 'Od-bsrung. The senior queen bore a son who had teeth at birth, and the mother's name was Brtan-grags. Gnam-lde 'od-bsrung passed away at the age of sixty-three, and his maternal grandsons were Khri bkra-shis brtsegs and Khri nyi-ma mgon. <b>Nyi-ma mgon departed for Mnga'-ris, where he had three sons: the eldest, Rig-pa mgon, became lord of Mar-yul; the middle one, Bkra-shis mgon, became lord of Spu-rong; and the youngest, Lde-gtsug mgon, became lord of Zhang-zhung. <b>The youngest had two sons: Drang-srong and 'Khor-lo lde. The latter, whose birth name was Srong kho-re, became a monk with the ordination name Ye-shes 'od. He sent twenty-one intelligent youths to India, of whom eighteen died from disease, whilst two returned to Tibet: the elder Rin-chen bzang-po and the younger Legs-pa'i shes-rab, who proved exceedingly beneficial to the teaching. <b>Moreover, many paṇḍitas were invited and various sūtras and tantras were translated. Particularly, yoga and Guhyasamāja were excellently developed. It appears that this was the period when the paṇḍita Smṛti came via Nepal from Tibet to Mdo-khams. <b>Kho-re's younger brother's son was Lha-lde, who had three sons: 'Od-lde, Pho-brang zhi-ba 'od, and the monk Byang-chub 'od. Through Byang-chub 'od's efforts, Jo-bo-rje was invited to Tibet, which was an act of exceedingly great kindness. <b>The Later Diffusion of the teaching arose from Mdo-khams. Previously, when the teaching was destroyed during Lang dar-ma's time, the three—Gtsang, Gyo, and Rma—carried whatever books they could and fled to Khams, where they dwelled. Among them, a householder named Dmu-zi rab-gsal became ordained, receiving the name Dge-ba rab-gsal. Due to his great wisdom, he later became renowned as the great master Dgongs-pa rab-gsal. <b>In the year following his ordination, he received full ordination, with the former abbot and disciples and the Chinese Hva-shang completing the quorum. Five years after his full ordination, ten men from Dbus and Gtsang came to Mdo-khams and requested the great master to grant them full ordination. When they implored him as the great master, he established the monastic discipline for them.<b>When they returned to Tibet, they established separate monasteries: in Dbus, five men including Klu-mes established different foundations, and in Gtsang, five men including La-stod established different foundations, thus greatly flourishing the teaching of the Victorious Śākya. <b>However, there exist conflicting historical accounts regarding the lineage of abbots from the great master and the ordination of the ten men from Dbus and Gtsang. The accounts say: Some claim the succession was: Abbot Bodhisattva's disciple Rba Ratna, he ordained Lha-lung rnal-'byor dbyangs, he ordained the great master Dgongs-gsal, he ordained Sa-gong ye-shes g.yung-drung, he ordained Grum ye-shes rgyal-mtshan, who ordained Klu-mes and others.<b>Certain testament documents state: The disciples of Abbot Bodhisattva, Dana-śīla and Jina-mitra, ordained Rba Ratna, he ordained G.yog dge-'byung, he ordained the great master Dgongs-pa gsal, he ordained Sgrol mañju-śrī, he ordained Grum ye-shes rgyal-mtshan, who ordained Klu-mes. <b>According to Rig-ral, whether the great master or the abbot's disciple Grum received ordination from the ten men of Dbus and Gtsang requires investigation. Again, regarding Gyo and others, some wish to follow the abbatial lineage of Jina-mitra, whilst others explain it as the lineage of Śī-ba-'tsho, which requires examination.<b>Thus it was that after seventy years without the teaching in Dbus and Gtsang, the ten men from Dbus and Gtsang reestablished the teaching. When the ten men came to Dbus, an old woman said, “When I was six years old, I saw monks.” When asked how old she had become, she said she was about seventy-six years old. Some say one hundred and eight years had passed. This accords with great Buton's reasoning that the Later Diffusion of the teaching began in the Water-Bird year. <b>Thus speaks the Treasury of Religious History composed by Buton the Kashmiri, as compiled by the Vidyādhara. <b>Sarva Maṅgalam (May all be auspicious) </p>", 

    "status": "published",
    "meta": { "words": "N/A", "pages": "N/A", "readTime": "N/A", "preview": "N/A" },
    "availableLanguages": ["bo", "zh", "en"],
    "createdAt": "2025-05-31T14:08:00Z",
    "updatedAt": "2025-05-31T22:18:00Z"
  },
  {
    "id": "aspiration_002",
    "tibetanTitle": "另一篇祈願文 (藏)",
    "chineseTitle": "另一篇祈願文 (中)",
    "author": "佚名",
    "category": "祈請文",
    "tags": ["迴向"],
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": { "words": "N/A", "pages": "N/A", "readTime": "N/A", "preview": "N/A" },
     "availableLanguages": ["bo", "zh", "en"],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  }
]